swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
/**************************************************************************//**
 * @file     rtl8735b_crypto.c
 * @brief    This file implements the CRYPTO Secure and Non-secure HAL functions in ROM.
 *
 * @version  V1.00
 * @date     2021-07-22
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "cmsis.h"
#include "hal_crypto.h"
#include "rtl8735b_crypto.h"
#include "rtl8735b_crypto_type.h"
#include "rtl8735b_crypto_ctrl.h"
//#include "crypto_verification.h"

#define UNIFY_CRYPTO 0

#if CONFIG_CRYPTO_EN
/**
 * @addtogroup hs_hal_crypto CRYPTO
 * @{
 */
#if !defined(CONFIG_BUILD_NONSECURE)

#undef CRYPTO_MODULE
#define CRYPTO_MODULE (CRYPTO_S_MODULE)

#undef CRYPTO_REG_BASE
#define CRYPTO_REG_BASE (CRYPTO_S_BASE)

#define key_lock                    0x500704F0
#define SK_ADDR                     0x50070500


#else

#undef CRYPTO_MODULE
#define CRYPTO_MODULE (CRYPTO_NS_MODULE)

#undef CRYPTO_REG_BASE
#define CRYPTO_REG_BASE (CRYPTO_NS_BASE)

#define key_lock                    0x400704F0
#define SK_ADDR                     0x40070500



#endif

/// @cond DOXYGEN_ROM_HAL_API


// options
#define INIT_REG_NOONE                  0x0
#define INIT_REG_SOMEONE                0x1
#define CHECK_INIT_FROM_HAL             0x1

/// LEXRA bus is little endian
#define LEXRA_BIG_ENDIAN            0
/// Timeout value of waiting available source descriptor FIFO nodes
#define FIFOCNT_TIMEOUT             0x100000
#define DISABLE_PLATFORM            0x0
#define ENABLE_PLATFORM             0x1

//KeyStorage
//#define key_lock                    0x500704F0
#define SK_OFFSET                   0x20
//#define SK_ADDR                     0x50070500

//#define VENDOR_KEY                  3
//#define USER_KEY                    (8 - VENDOR_KEY)
#define Hash_out                    0
#define SECUREKEY_MAX    8
#define SECUREKEY_OFFSET 4


//
// crc
//
/// Timeout value of waiting CRC engine calculating a result interrupt
#define CRC_TIMEOUT  10000

/* Macros for hp crypto module CRC type */
/// CRC reset register
#define REG_CRC_RST         (0x100) //crc_rst_reg_b
/// CRC operation register
#define REG_CRC_OP          (0x104) //crc_op_reg_b
/// CRC polynomial register
#define REG_CRC_POLY        (0x108) //crc_poly_reg_b
/// CRC initial value register
#define REG_CRC_IV          (0x10C) //crc_iv_reg_b
/// CRC output XOR register
#define REG_CRC_OXOR        (0x110) //crc_oxor_reg_b
/// CRC data register
#define REG_CRC_DATA        (0x114) //crc_data_reg_b
/// CRC status register
#define REG_CRC_STAT        (0x118) //crc_stat_reg_b
/// CRC result register
#define REG_CRC_RES         (0x11C) //crc_result_reg_b
/// CRC count register
#define REG_CRC_CNT         (0x120) //crc_count_reg_b
/// CRC operation register DMA mode setting bit offset
#define CRC_104_DMA         (1<<7)
/// CRC status register checking CRC engine busy bit offset
#define CRC_118_BUSY        (1<<0)
/// CRC status register setting/checking CRC engine interrupt bit offset
#define CRC_118_INTR        (1<<1)
/// CRC status register setting/checking CRC engine interrupt mask bit offset
#define CRC_118_INTRMSK     (1<<2)
/// CRC status register setting/checking CRC engine little endian bit offset
#define CRC_118_LE          (1<<3)

/// @endcond
/** @} */ /* End of group hs_hal_crypto */

//static int crypto_debug_on = 0;
//
//
#define SECTION(_name) __attribute__ ((__section__(_name)))

#if defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE == 1)
#define SECTION_CRYPTO_TEXT           SECTION(".rom.hal_crypto_ns.text")
#define SECTION_CRYPTO_DATA           SECTION(".rom.hal_crypto_ns.data")
#define SECTION_CRYPTO_RODATA         SECTION(".rom.hal_crypto_ns.rodata")
#define SECTION_CRYPTO_BSS            SECTION(".rom.hal_crypto_ns.bss")
#define SECTION_CRYPTO_STUBS          SECTION(".rom.hal_crypto_ns.stubs")

#else

#define SECTION_CRYPTO_TEXT           SECTION(".rom.hal_crypto_s.text")
#define SECTION_CRYPTO_DATA           SECTION(".rom.hal_crypto_s.data")
#define SECTION_CRYPTO_RODATA         SECTION(".rom.hal_crypto_s.rodata")
#define SECTION_CRYPTO_BSS            SECTION(".rom.hal_crypto_s.bss")
#define SECTION_CRYPTO_STUBS          SECTION(".rom.hal_crypto_s.stubs")
#endif

/**
 * @addtogroup hs_hal_crypto CRYPTO
 * @{
 */

/// @cond DOXYGEN_ROM_HAL_API

const u8 gcm_iv_tail[] __attribute__((aligned(64))) = {0x00, 0x00, 0x00, 0x01};

SECTION_CRYPTO_BSS
hal_crypto_adapter_t *pg_rtl_cryptoEngine;

SECTION_CRYPTO_BSS
volatile uint8_t reg_init;

//#include "../rom_template/rtl8710c_rom_crypto_template.h"
SECTION_CRYPTO_TEXT
extern void dump_for_one_bytes(u8 *pdata, u32 len);
/**  \brief     __dbg_mem_dump is only used to print out memory information of CRYPTO IP. \n
 *              Use \em enable to enable/disable this function which dumps \em size bytes of momery information
 *              from the \em start address.
 */
#undef __dbg_mem_dump
#define __dbg_mem_dump(enable, start, size, str_header) do{ \
    if(enable){ \
        DBG_CRYPTO_INFO(str_header "\r\n");\
        dump_for_one_bytes ((u8 *)start, size);}\
}while(0)

#if   defined (__CC_ARM)
#pragma push
#pragma anon_unions
#endif

/* Functions for crypto module */

/**
 * @addtogroup hs_hal_crypto_rom_func CRYPTO HAL ROM APIs.
 * @ingroup hs_hal_crypto
 * @{
 * @brief CRYPTO HAL ROM API. The user application(in RAM space) should not call these APIs directly.
 *        There is another set of CRYPTO HAL APIs in the RAM space is provided for the user application.
 */

/**
 *  \fn          u32 __rtl_cpu_to_be32(u32 val)
 *  \brief       Reverse \em val to byte order in a word.
 *  \param[in]   val The value to be reversed
 *  \return      value  Reverse result
 */
SECTION_CRYPTO_TEXT
u32 __rtl_cpu_to_be32(u32 val)
{
	asm volatile(
		"rev %0, %0"
		: "=r"(val)
		: "0"(val));

	return val;
}

/**
 *  \fn          void *rtlc_memset(void *dst, int c, size_t n)
 *  \brief       Sets the first \em c bytes of the block of memory pointed by \em dst to the specified \em value .
 *  \param[in]   dst Pointer to destination address
 *  \param[in]   c Value to be set
 *  \param[in]   n Number of bytes to be set to the \em value
 *  \return      value  destination address
 */
SECTION_CRYPTO_TEXT
void *rtlc_memset(void *dst, int c, size_t n)
{
	if (n != 0) {
		char *d = dst;

		do {
			*d++ = c;
		} while (--n > 0);
	}
	return dst;
}

/**
 *  \fn          void *rtlc_memcpy( void *s1, const void *s2, size_t n )
 *  \brief       Copies the values of \em n bytes from the location pointed to by \em s2 directly to the memory block pointed to by \em s1 .
 *  \param[in]   s1 Pointer to the destination array where the content is to be copied
 *  \param[in]   s2 Pointer to the source of data to be copied
 *  \param[in]   n Number of bytes to copy
 *  \return      value  destination address
 */
SECTION_CRYPTO_TEXT
void *rtlc_memcpy(void *s1, const void *s2, size_t n)
{
	char *dst = (char *) s1;
	const char *src = (const char *) s2;

