swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
	while (n--) {
		*dst++ = *src++;
	}
	return s1;
}

// cache functions
/**
 *  \fn          int isDCacheDisabled(void)
 *  \brief       Make sure Dcache state.
 *  \param       void
 *  \return      value 0   Dcache enable
 *  \return      value 1   Dcache disable
 */
SECTION_CRYPTO_TEXT
int isDCacheDisabled(void)
{
	int ret;
	ret = (!(SCB->CCR & (uint32_t)(SCB_CCR_DC_Msk)));

	return ret;
}

/**
 *  \fn          void arch_invalidate_dcache_by_size(hal_crypto_adapter_t *pcrypto_adapter, uint32_t start_address, uint32_t size)
 *  \brief       Invalidate the first \em size bytes of the block of memory pointed by \em start_address .
 *  \note        If programmer doesn't register an other invalidating dcache function, then it means use internal ram.
 *  \param[in]   pcrypto_adapter Pointer to crypto adapter data
 *  \param[in]   start_address Pointer to start address
 *  \param[in]   size Number of bytes to be clean
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void arch_invalidate_dcache_by_size(hal_crypto_adapter_t *pcrypto_adapter, uint32_t start_address, uint32_t size)
{
	if (isDCacheDisabled()) {
		DBG_CRYPTO_WARN("Dcache disable\r\n");
		return;
	}
	if (pcrypto_adapter != NULL) {
		if (pcrypto_adapter->arch_invalidate_dcache_by_size != NULL) {
			pcrypto_adapter->arch_invalidate_dcache_by_size(start_address, size);
		}
		return;
	}
}

/**
 *  \fn          void arch_clean_dcache_by_size(hal_crypto_adapter_t *pcrypto_adapter, uint32_t start_address, uint32_t size)
 *  \brief       Clean the first \em size bytes of the block of memory pointed by \em start_address .
 *  \note        If programmer doesn't register an other cleaning dcache function, then it means use internal ram.
 *  \param[in]   pcrypto_adapter Pointer to crypto adapter data
 *  \param[in]   start_address Pointer to start address
 *  \param[in]   size Number of bytes to be clean
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void arch_clean_dcache_by_size(hal_crypto_adapter_t *pcrypto_adapter, uint32_t start_address, uint32_t size)
{
	if (isDCacheDisabled()) {
		DBG_CRYPTO_WARN("Dcache disable\r\n");
		return;
	}

	if (pcrypto_adapter != NULL) {
		if (pcrypto_adapter->arch_clean_dcache_by_size != NULL) {
			pcrypto_adapter->arch_clean_dcache_by_size(start_address, size);
		}
		return;
	}

}

/**
 *  \fn          void hal_crypto_engine_set_digestlen_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const uint32_t auth_type)
 *  \brief       Set authentication digest length in crypto adapter.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   auth_type Authentication type ID
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_engine_set_digestlen(hal_crypto_adapter_t *pcrypto_adapter, IN const uint32_t auth_type)
{
	int digestlen;

	switch (auth_type &  AUTH_TYPE_MASK_FUNC) {
	case AUTH_TYPE_MD5:
		digestlen = CRYPTO_MD5_DIGEST_LENGTH;
		break;

	case AUTH_TYPE_SHA1:
		digestlen = CRYPTO_SHA1_DIGEST_LENGTH;
		break;

	case AUTH_TYPE_SHA2:
		digestlen = pcrypto_adapter->sha2type;
		break;

	default:
		digestlen = 0;
		break;
	}

	pcrypto_adapter->digestlen = digestlen;
	DBG_CRYPTO_INFO("[Set digestlen] digestlen = %d\r\n", digestlen);
}

/**
 *  \fn          int hal_crypto_engine_set_key_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
                                                        IN const u8* pCipherKey, IN const int lenCipherKey,
                                                        IN const u8* pAuthKey, IN const int lenAuthKey )
 *  \brief       Set cipher key, authentication key information in crypto adapter.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   pCipherKey Pointer to crypto cipher key buffer
 *  \param[in]   lenCipherKey Crypto cipher key buffer length
 *  \param[in]   pAuthKey Pointer to authentication key buffer
 *  \param[in]   lenAuthKey Authentication key buffer length
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_engine_set_key(hal_crypto_adapter_t *pcrypto_adapter,
								   IN const u8 *pCipherKey, IN const int lenCipherKey,
								   IN const u8 *pAuthKey,   IN const int lenAuthKey)
{
	DBG_CRYPTO_INFO("[Set Cipherkey/Authkey] lenCipherKey = %d,lenAuthKey = %d\r\n", lenCipherKey, lenAuthKey);

	pcrypto_adapter->lenCipherKey = lenCipherKey;
	pcrypto_adapter->pCipherKey   = pCipherKey;

	pcrypto_adapter->pAuthKey   = pAuthKey;
	pcrypto_adapter->lenAuthKey = lenAuthKey;

	if ((pcrypto_adapter->sha2type == SHA2_384) || (pcrypto_adapter->sha2type == SHA2_512)) {
		if (lenAuthKey > 0) {
			int i;

			pcrypto_adapter->ipad = (u8 *)(&(pcrypto_adapter->g_IOPAD_SHA512[0]));
			pcrypto_adapter->opad = (u8 *)(&(pcrypto_adapter->g_IOPAD_SHA512[CRYPTO_PADSIZE_SHA512]));

			rtlc_memset(pcrypto_adapter->ipad, 0x36, CRYPTO_PADSIZE_SHA512);
			rtlc_memset(pcrypto_adapter->opad, 0x5c, CRYPTO_PADSIZE_SHA512);

			for (i = 0; i < lenAuthKey; i++) {
				pcrypto_adapter->ipad[i] ^= ((u8 *) pcrypto_adapter->pAuthKey)[i];
				pcrypto_adapter->opad[i] ^= ((u8 *) pcrypto_adapter->pAuthKey)[i];
			}

		} else {
			pcrypto_adapter->ipad = 0;
			pcrypto_adapter->opad = 0;
		}
	} else {
		if (lenAuthKey > 0) {
			int i;

			pcrypto_adapter->ipad = (u8 *)(&(pcrypto_adapter->g_IOPAD[0]));
			pcrypto_adapter->opad = (u8 *)(&(pcrypto_adapter->g_IOPAD[CRYPTO_PADSIZE]));

			rtlc_memset(pcrypto_adapter->ipad, 0x36, CRYPTO_PADSIZE);
			rtlc_memset(pcrypto_adapter->opad, 0x5c, CRYPTO_PADSIZE);

			for (i = 0; i < lenAuthKey; i++) {
				pcrypto_adapter->ipad[i] ^= ((u8 *) pcrypto_adapter->pAuthKey)[i];
				pcrypto_adapter->opad[i] ^= ((u8 *) pcrypto_adapter->pAuthKey)[i];
			}

		} else {
			pcrypto_adapter->ipad = 0;
			pcrypto_adapter->opad = 0;
		}
	}


}

#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_engine_set_key_SHA512(hal_crypto_adapter_t *pcrypto_adapter,
		IN const u8 *pCipherKey, IN const int lenCipherKey,
		IN const u8 *pAuthKey,   IN const int lenAuthKey)
{
	DBG_CRYPTO_INFO("[Set Cipherkey/Authkey] lenCipherKey = %d,lenAuthKey = %d\r\n", lenCipherKey, lenAuthKey);

