swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
	pcrypto_adapter->lenCipherKey = lenCipherKey;
	pcrypto_adapter->pCipherKey   = pCipherKey;

	pcrypto_adapter->pAuthKey   = pAuthKey;
	pcrypto_adapter->lenAuthKey = lenAuthKey;

	if (lenAuthKey > 0) {
		int i;

		pcrypto_adapter->ipad = (u8 *)(&(pcrypto_adapter->g_IOPAD_SHA512[0]));
		pcrypto_adapter->opad = (u8 *)(&(pcrypto_adapter->g_IOPAD_SHA512[CRYPTO_PADSIZE_SHA512]));

		rtlc_memset(pcrypto_adapter->ipad, 0x36, CRYPTO_PADSIZE_SHA512);
		rtlc_memset(pcrypto_adapter->opad, 0x5c, CRYPTO_PADSIZE_SHA512);

		for (i = 0; i < lenAuthKey; i++) {
			pcrypto_adapter->ipad[i] ^= ((u8 *) pcrypto_adapter->pAuthKey)[i];
			pcrypto_adapter->opad[i] ^= ((u8 *) pcrypto_adapter->pAuthKey)[i];
		}

	} else {
		pcrypto_adapter->ipad = 0;
		pcrypto_adapter->opad = 0;
	}
}
#endif

SECTION_CRYPTO_TEXT
int hal_rtl_crypto_engine_set_security_type(hal_crypto_adapter_t *pcrypto_adapter,
		IN const uint32_t cipher_type, IN const uint32_t auth_type)
{
	int ret = SUCCESS;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT;
	}

	// Cipher
	pcrypto_adapter->trides      = 0;
	pcrypto_adapter->aes         = 0;
	pcrypto_adapter->des         = 0;
	pcrypto_adapter->chacha      = 0;
	pcrypto_adapter->isDecrypt   = 0;
	pcrypto_adapter->cipher_type = cipher_type;

	if (cipher_type != CIPHER_TYPE_NO_CIPHER) {
		switch (cipher_type & CIPHER_TYPE_MASK_FUNC) {
		case CIPHER_TYPE_FUNC_AES :
			pcrypto_adapter->aes = 1;
			break;
		case CIPHER_TYPE_FUNC_DES :
			pcrypto_adapter->des = 1;
			break;
		case CIPHER_TYPE_FUNC_3DES :
			pcrypto_adapter->trides = 1;
			break;
		case CIPHER_TYPE_FUNC_CHACHA :
			pcrypto_adapter->chacha = 1;
			break;

		}
		pcrypto_adapter->isDecrypt = (cipher_type & CIPHER_TYPE_MODE_ENCRYPT) ? 0 : 1;
	}

	// Auth
	pcrypto_adapter->auth_type = auth_type;
	if (auth_type != AUTH_TYPE_NO_AUTH) {
		pcrypto_adapter->isHMAC = (auth_type & AUTH_TYPE_MASK_HMAC) ? 1 : 0;
		pcrypto_adapter->isMD5  = ((auth_type & AUTH_TYPE_MASK_FUNC) == AUTH_TYPE_MD5) ? 1 : 0;
		pcrypto_adapter->isSHA1 = ((auth_type & AUTH_TYPE_MASK_FUNC) == AUTH_TYPE_SHA1) ? 1 : 0;
		pcrypto_adapter->isSHA2 = ((auth_type & AUTH_TYPE_MASK_FUNC) == AUTH_TYPE_SHA2) ? 1 : 0;
		if (pcrypto_adapter->isSHA2) {
			switch (auth_type & AUTH_TYPE_MASK_SHA2) {
			case AUTH_TYPE_SHA2_224 :
				pcrypto_adapter->sha2type = SHA2_224;
				break;
			case AUTH_TYPE_SHA2_256 :
				pcrypto_adapter->sha2type = SHA2_256;
				break;
			case AUTH_TYPE_SHA2_384 :
				pcrypto_adapter->sha2type = SHA2_384;
				break;
			case AUTH_TYPE_SHA2_512 :
				pcrypto_adapter->sha2type = SHA2_512;
				break;

			default :
				DBG_CRYPTO_ERR("No this auth_type(%d) for SHA2\n", auth_type);
				pcrypto_adapter->sha2type = SHA2_NONE;
				break;
			}
		} else {
			pcrypto_adapter->sha2type = SHA2_NONE;
		}
		hal_rtl_crypto_engine_set_digestlen(pcrypto_adapter, auth_type);
		pcrypto_adapter->hmac_seq_hash_first = 1;
		pcrypto_adapter->hmac_seq_hash_last = 0;
		pcrypto_adapter->hmac_seq_hash_total_len = 0;
	} else {
		pcrypto_adapter->isMD5    = 0;
		pcrypto_adapter->isHMAC   = 0;
		pcrypto_adapter->isSHA1   = 0;
		pcrypto_adapter->isSHA2   = 0;
		pcrypto_adapter->sha2type = SHA2_NONE;
	}
	return ret;
}


/**
 *  \fn          int hal_crypto_engine_set_security_mode_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
                                                                  IN const uint32_t cipher_type, IN const uint32_t auth_type,
                                                                  IN const void* pCipherKey, IN const uint32_t lenCipherKey,
                                                                  IN const void* pAuthKey, IN const uint32_t lenAuthKey)
 *  \brief       Set basic crypto information in crypto adapter data.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   cipher_type Cipher type ID
 *  \param[in]   auth_type Authentication type ID
 *  \param[in]   pCipherKey Pointer to Crypto cipher key buffer
 *  \param[in]   lenCipherKey Crypto cipher key buffer length
 *  \param[in]   pAuthKey Pointer to Authentication key buffer
 *  \param[in]   lenAuthKey Authentication key buffer length
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_engine_set_security_mode(hal_crypto_adapter_t *pcrypto_adapter,
		IN const uint32_t cipher_type, IN const uint32_t auth_type,
		IN const void *pCipherKey,     IN const uint32_t lenCipherKey,
		IN const void *pAuthKey,       IN const uint32_t lenAuthKey)
{
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT;
	}
	if (lenAuthKey > 0) { // Authentication
		if (pAuthKey == NULL) {
			return _ERRNO_CRYPTO_NULL_POINTER;
		}
		if ((AUTH_TYPE_HMAC_SHA2_384_ALL == auth_type) || (AUTH_TYPE_HMAC_SHA2_512_ALL == auth_type)) {
			if (lenAuthKey > CRYPTO_PADSIZE_SHA512) {
				return _ERRNO_CRYPTO_KEY_OutRange;
			}
		} else {
			if (lenAuthKey > CRYPTO_AUTH_PADDING) {
				return _ERRNO_CRYPTO_KEY_OutRange;
			}
		}
	}
	hal_rtl_crypto_engine_set_security_type(pcrypto_adapter, cipher_type, auth_type);
	hal_rtl_crypto_engine_set_key(pcrypto_adapter, pCipherKey, lenCipherKey, pAuthKey, lenAuthKey);
	return SUCCESS;
}

#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_engine_set_security_mode_SHA512(hal_crypto_adapter_t *pcrypto_adapter,
		IN const uint32_t cipher_type, IN const uint32_t auth_type,
		IN const void *pCipherKey,     IN const uint32_t lenCipherKey,
		IN const void *pAuthKey,       IN const uint32_t lenAuthKey)
{
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT;
	}
	if (lenAuthKey > 0) { // Authentication
		if (pAuthKey == NULL) {
			return _ERRNO_CRYPTO_NULL_POINTER;
		}
		if (lenAuthKey > CRYPTO_AUTH_PADDING) {
			return _ERRNO_CRYPTO_KEY_OutRange;
		}
	}
	hal_rtl_crypto_engine_set_security_type(pcrypto_adapter, cipher_type, auth_type);
	hal_rtl_crypto_engine_set_key_SHA512(pcrypto_adapter, pCipherKey, lenCipherKey, pAuthKey, lenAuthKey);
	return SUCCESS;
}
#endif

/**
 *  \fn          int hal_crypto_engine_pre_exec_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter)
 *  \brief       If programmer has registered a pre_exec function, it indicates using interrupt handler. So it calls
 *               a registered function to initialize the notified flag before crypto calculating result interrupt triggers ISR.\n
 *               If programmer didn't register a function, it indicates using polling way to detect interrupt.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      value == 0     success
 *  \return      value == -1    fail
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_engine_pre_exec(hal_crypto_adapter_t *pcrypto_adapter)
{
	if ((pcrypto_adapter != NULL) && (pcrypto_adapter->pre_exec_func != NULL)) {
		DBG_CRYPTO_INFO("Use pcrypto_adapter->pre_exec_func!\r\n");
		return pcrypto_adapter->pre_exec_func(pcrypto_adapter);
	}
	return SUCCESS;
}

/**
 *  \fn          int hal_crypto_engine_wait_done_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter)
 *  \brief       If programmer has registered a wait_done function, it indicates using interrupt handler. So it calls
 *               a registered function waiting to be notified\n
 *               If programmer didn't register a function, it indicates using polling way. So it will busy-waiting the
 *               crypto calculating result interrupt arrives, or wait until timeout value count down to zero then return fail.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      value == 0     success
 *  \return      value == -1    fail
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_engine_wait_done(hal_crypto_adapter_t *pcrypto_adapter)
{
	volatile uint32_t ips_err;
	volatile uint32_t ips_10_status;
	uint32_t loopWait;
	CRYPTO_Type *pcrypto;

#if UNIFY_CRYPTO

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}

	//pcrypto = pcrypto_adapter->base_addr;
	CRYPTO_TypeDef *CRYPTO_OBJ = (CRYPTO_TypeDef *)(pcrypto_adapter->base_addr);

	if (pcrypto_adapter->wait_done_func != NULL) {
		DBG_CRYPTO_INFO("Interrupt Handler way[Use pcrypto_adapter->wait_done_func]!\r\n");
		return pcrypto_adapter->wait_done_func(pcrypto_adapter);
	}

	// wait until ipsec engine stop
	loopWait = 1000000; /* hope long enough */
	while (1) {
		if (CRYPTO_OBJ->CRYPTO_IPSCSR_RESET_ISR_CONF_REG
			pcrypto->ipscsr_reset_isr_conf_reg_b.cmd_ok) {
			break;
		}

		ips_err = (pcrypto->ipscsr_err_stats_reg);
		if (ips_err) {
			//dbg_printf("ips 0x1C err = 0x%08x\r\n", ips_err);
			DBG_CRYPTO_ERR("ips 0x1C err = %x\r\n", ips_err);
			return FAIL;
		}

		loopWait--;
		if (loopWait == 0) {
			ips_10_status = (pcrypto->ipscsr_reset_isr_conf_reg);
			ips_err = (pcrypto->ipscsr_err_stats_reg);
			DBG_CRYPTO_ERR("Wait Timeout ips status =0x%08x, ips err = 0x%08x\r\n", ips_10_status, ips_err);
			return FAIL; /* error occurs */
		}
	}
	return SUCCESS;

#else

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	pcrypto = pcrypto_adapter->base_addr;

	if (pcrypto_adapter->wait_done_func != NULL) {
		DBG_CRYPTO_INFO("Interrupt Handler way[Use pcrypto_adapter->wait_done_func]!\r\n");
		return pcrypto_adapter->wait_done_func(pcrypto_adapter);
	}

	// wait until ipsec engine stop
	loopWait = 1000000; /* hope long enough */
	while (1) {
		if (pcrypto->ipscsr_reset_isr_conf_reg_b.cmd_ok) {
			break;
		}

		ips_err = (pcrypto->ipscsr_err_stats_reg);
		if (ips_err) {
			DBG_CRYPTO_ERR("ips 0x1C err = %x\r\n", ips_err);
			return FAIL;
		}

		loopWait--;
		if (loopWait == 0) {
			ips_10_status = (pcrypto->ipscsr_reset_isr_conf_reg);
			ips_err = (pcrypto->ipscsr_err_stats_reg);
			DBG_CRYPTO_ERR("Wait Timeout ips status =0x%08x, ips err = 0x%08x\r\n", ips_10_status, ips_err);
			return FAIL; /* error occurs */
		}
	}
	return SUCCESS;

#endif
}

/**
 *  \fn          void hal_crypto_start_packet_init_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter)
 *  \brief       Clear command ok interrupt and error interrupts.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_start_packet_init(hal_crypto_adapter_t *pcrypto_adapter)
{
#if UNIFY_CRYPTO

