swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
	CRYPTO_TypeDef *CRYPTO_OBJ = (CRYPTO_TypeDef *)(pcrypto_adapter->base_addr);
	DBG_CRYPTO_INFO("[Crypto_engine] start packet init\r\n");
	//CRYPTO_OBJ->CRYPTO_IPSCSR_ERR_STATS_REG = 0;
	CRYPTO_OBJ->CRYPTO_IPSCSR_ERR_STATS_REG |= 0x3FFF;
	CRYPTO_OBJ->CRYPTO_IPSCSR_RESET_ISR_CONF_REG |= CRYPTO_BIT_CMD_OK;

#else

	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	DBG_CRYPTO_INFO("[Crypto_engine] start packet init\r\n");
	(pcrypto->ipscsr_err_stats_reg) = 0x3FFF;
	(pcrypto->ipscsr_reset_isr_conf_reg_b.cmd_ok) = 1;

#endif
}

/**
 *  \fn          void hal_crypto_engine_auth_calc_apl_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
                                                               IN const uint32_t a2eo, IN const uint32_t msglen,
                                                               IN const uint32_t hash_padlen, IN const uint32_t enc_padlen)
 *  \brief       Set crypto the last valid data size and padding data length in crypto adapter.
 *  \details     AES,Hash need 16 bytes alignment message buffer
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   a2eo Additional authentication data buffer length
 *  \param[in]   msglen crypto message buffer length
 *  \param[in]   hash_padlen mix mode hash padding data buffer length
 *  \param[in]   enc_padlen  mix mode encryption padding data buffer length
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_engine_auth_calc_apl(hal_crypto_adapter_t *pcrypto_adapter,
		IN const uint32_t a2eo, IN const uint32_t msglen,
		IN const uint32_t hash_padlen, IN const uint32_t enc_padlen)
{
	DBG_CRYPTO_INFO("[Crypto_engine] set engine needs relative length data\r\n");
	DBG_CRYPTO_INFO("[Crypto_engine] a2eo = %d, msglen = %d, hash_padlen = %d, enc_padlen = %d\r\n", a2eo, msglen, hash_padlen, enc_padlen);
	pcrypto_adapter->a2eo = a2eo;
	pcrypto_adapter->enl  = msglen;
	pcrypto_adapter->hash_padlen  = hash_padlen;
	pcrypto_adapter->enc_padlen   = enc_padlen;

	if (hash_padlen == 0) { // normal mode:HASH,AES msglen 16 byte alignment, AES_GCM aadlen 16 byte alignment
		// DES / 3DES : 8 byte alignment
		if ((pcrypto_adapter->des == 1) || (pcrypto_adapter->trides == 1)) {
			pcrypto_adapter->enc_last_data_size = msglen % 8;
			pcrypto_adapter->apl = (8 - pcrypto_adapter->enc_last_data_size) % 8;

			pcrypto_adapter->aad_last_data_size = a2eo % 8;
			pcrypto_adapter->apl_aad = (8 - pcrypto_adapter->aad_last_data_size) % 8;
		} else { // AES,Chacha,Hash : 16 byte alignment
			pcrypto_adapter->enc_last_data_size = msglen % 16;
			pcrypto_adapter->apl = (16 - pcrypto_adapter->enc_last_data_size) % 16;

			pcrypto_adapter->aad_last_data_size = a2eo % 16;
			pcrypto_adapter->apl_aad = (16 - pcrypto_adapter->aad_last_data_size) % 16;
		}
	} else { // mix mode: a2eo 8 byte alignment, hash_padlen 8 byte alignment, enc_padlen 8 byte alignment
		pcrypto_adapter->enc_last_data_size = msglen % 16;
		pcrypto_adapter->apl = (16 - pcrypto_adapter->enc_last_data_size) % 16;

		pcrypto_adapter->aad_last_data_size = a2eo % 8;
		pcrypto_adapter->apl_aad = (8 - pcrypto_adapter->aad_last_data_size) % 8;

		pcrypto_adapter->hashpad_last_data_size = hash_padlen % 8;
		pcrypto_adapter->hashpad_pad = (8 - pcrypto_adapter->hashpad_last_data_size) % 8;

		pcrypto_adapter->encpad_last_data_size = enc_padlen % 8;
		pcrypto_adapter->encpad_pad = (8 - pcrypto_adapter->encpad_last_data_size) % 8;
	}
}

/**
 *  \fn          void hal_crypto_modify_enc_last_data_size_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
                                                                    IN const u8 *message,IN const uint32_t msglen)
 *  \brief       Only AES_GCM may modify enc_last_data_size in decryption to match with the tag value of encryption.
 *  \note        Observe if AES_GCM use non-16 bytes aligned plaintext as an input,
 *               it will generate a 16 bytes aligned ciphertext which is composed of ori_len(plaintext)+padding_len(0). \n
 *               And then use this 16 bytes aligned msglen of ciphertext as decryption input,
 *               this could recover back to the plaintext; however, the enc_last_data_size is different from encryption,
 *               so it leads to different tag value of decryption. That's why need to modify the enc_last_data_size same as encryption.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   message Pointer to Crypto cipher message buffer
 *  \param[in]   msglen Crypto cipher message buffer length
 *  \return      void
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_modify_enc_last_data_size(hal_crypto_adapter_t *pcrypto_adapter,
		IN const u8 *message, IN const uint32_t msglen)
{
	int vLaid_byte = 0;
	int find_zero = 0;
	// Because AES_GCM,Chacha_poly1305 only allow 16bytes aligned msglen to decrypt,
	// jump to the start_addr of the last 16 bytes msg.
	int offset_byte = (msglen - 16);
	u8 *pLast_start = (u8 *)message + offset_byte;

	while (vLaid_byte < 16) {

		if (*pLast_start != 0x00) {
			if (find_zero != 0) {
				find_zero = 0;
			}
		} else {
			++find_zero;
		}
		++vLaid_byte;
		++pLast_start;
	}

	if (16 == vLaid_byte) {
		// The last one
		if (1 == find_zero) {
			find_zero = 0;
		}

		vLaid_byte = 16 - find_zero;
	}

	DBG_CRYPTO_INFO("vLaid_byte = %d\r\n", vLaid_byte);
	pcrypto_adapter->enc_last_data_size = vLaid_byte;
}

/**
 *  \fn          uint32_t hal_crypto_dstdesc_fifo_cnt_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter)
 *  \brief       Know how many destination descripter fifo nodes are available to use.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      value >= 0     fifo empty nodes count value
 */
SECTION_CRYPTO_TEXT
uint32_t hal_rtl_crypto_dstdesc_fifo_cnt(hal_crypto_adapter_t *pcrypto_adapter)
{
#if UNIFY_CRYPTO

	CRYPTO_TypeDef *CRYPTO_OBJ = (CRYPTO_TypeDef *)(pcrypto_adapter->base_addr);
	return (CRYPTO_OBJ->CRYPTO_DSTDESC_STATUS_REG & CRYPTO_MASK_FIFO_EMPTY_CNT);

#else

	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	return (pcrypto->dstdesc_status_reg_b.fifo_empty_cnt);

#endif

