swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
}

/**
 *  \fn          void hal_crypto_set_dstdesc_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, uint32_t dd1, uint32_t ddpr)
 *  \brief       Check whether there are enough fifo nodes for destination descripter, if there're enough,
 *               then set destination descripter first/second words to crypto destination descripter registers.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   dd1 Destination descripter first word pointer value
 *  \param[in]   ddpr Destination descripter second word pointer value(data pointer value)
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_set_dstdesc(hal_crypto_adapter_t *pcrypto_adapter, uint32_t dd1, uint32_t ddpr)
{
#if UNIFY_CRYPTO

	CRYPTO_TypeDef *CRYPTO_OBJ = (CRYPTO_TypeDef *)(pcrypto_adapter->base_addr);
	if (hal_rtl_crypto_dstdesc_fifo_cnt(pcrypto_adapter) > 0) {
		DBG_CRYPTO_INFO("dd1=0x%08x , ddpr=0x%08x\r\n", dd1, ddpr);
		(CRYPTO_OBJ->CRYPTO_DDFW_REG) |= (CRYPTO_MASK_DDFW & dd1);
		(CRYPTO_OBJ->CRYPTO_DDSW_REG) |= (CRYPTO_MASK_DDSW & ddpr);
	} else {
		DBG_CRYPTO_ERR("dst fifo_cnt is not correct: %d \r\n", hal_rtl_crypto_dstdesc_fifo_cnt(pcrypto_adapter));
	}

#else

	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	if (hal_rtl_crypto_dstdesc_fifo_cnt(pcrypto_adapter) > 0) {
		DBG_CRYPTO_INFO("dd1=0x%08x , ddpr=0x%08x\r\n", dd1, ddpr);
		(pcrypto->ddfw_reg) = dd1;
		(pcrypto->ddsw_reg) = ddpr;
	} else {
		DBG_CRYPTO_ERR("dst fifo_cnt is not correct: %d \r\n", hal_rtl_crypto_dstdesc_fifo_cnt(pcrypto_adapter));
	}
#endif


}

/**
 *  \fn          uint32_t hal_crypto_srcdesc_fifo_cnt_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter)
 *  \brief       Know how many source descripter fifo nodes are available to use.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      value >= 0     fifo empty nodes count value
 */
SECTION_CRYPTO_TEXT
uint32_t hal_rtl_crypto_srcdesc_fifo_cnt(hal_crypto_adapter_t *pcrypto_adapter)
{
#if UNIFY_CRYPTO

	CRYPTO_TypeDef *CRYPTO_OBJ = (CRYPTO_TypeDef *)(pcrypto_adapter->base_addr);
	return (CRYPTO_OBJ->CRYPTO_SRCDESC_STATUS_REG & CRYPTO_MASK_FIFO_EMPTY_CNT);

#else

	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	return (pcrypto->srcdesc_status_reg_b.fifo_empty_cnt);

#endif
}

/**
 *  \fn          void hal_crypto_set_srcdesc_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, uint32_t sd1, uint32_t sdpr)
 *  \brief       Check whether there are enough fifo nodes for source descripter, if there're enough,
 *               then set source descripter first/second words to crypto source descripter registers,
 *               or wait until timeout value count down to zero then break.
 *  \param[in]   pcrypto_adapter Pointer to crypto adapter data
 *  \param[in]   sd1 Source descripter first word pointer value
 *  \param[in]   sdpr Source descripter second word pointer value(data pointer value)
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_set_srcdesc(hal_crypto_adapter_t *pcrypto_adapter, uint32_t sd1, uint32_t sdpr)
{
	uint32_t cnt, timeout;
	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	timeout = FIFOCNT_TIMEOUT;

	while (1) {
		if ((cnt = hal_rtl_crypto_srcdesc_fifo_cnt(pcrypto_adapter)) > 0) {
			DBG_CRYPTO_INFO("sd1=0x%08x , sdpr=0x%08x\r\n", sd1, sdpr);
			(pcrypto->sdfw_reg) = (sd1 | 0x80000000);
			(pcrypto->sdsw_reg) = (sdpr);
			break;
		}
		if (pcrypto_adapter->fifo_wait_func != NULL) {
			pcrypto_adapter->fifo_wait_func(pcrypto_adapter);
		} else {
			DBG_CRYPTO_ERR("src fifo_cnt is FULL: %d \r\n", cnt);
			timeout--;
			if (timeout == 0) {
				break;
			}
		}
	}
}

#if IS_CUT_TEST(CONFIG_CHIP_VER)
/**
 *  \fn          void hal_crypto_engine_setup_cl_buffer_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter)
 *  \brief       Use crypto adatper information to set crypto command setting buffer for normal mode.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_engine_setup_cl_buffer(hal_crypto_adapter_t *pcrypto_adapter)
{
	rtl_crypto_cl_t *pCL;
	uint32_t a2eo;
	uint32_t enl;

	DBG_CRYPTO_INFO("Set up src_desc command register\r\n");
	a2eo = pcrypto_adapter->a2eo;
	enl  = pcrypto_adapter->enl;

	//allocate a 32byte-aligned buffer and memset
	pCL = (rtl_crypto_cl_t *)pcrypto_adapter->cl_buffer;
	rtlc_memset((u8 *)pCL, 0, sizeof(pcrypto_adapter->cl_buffer));

	if (pcrypto_adapter->auth_type != AUTH_TYPE_NO_AUTH) {
		pCL->engine_mode = 1; //hash only

		//Enable seq_hash mechanism
		pCL->hmac_seq_hash = 1;

		//Check seq_hash first msg payload
		pCL->hmac_seq_hash_first = 0;
		if (pcrypto_adapter->hmac_seq_hash_first == 1) {
			pCL->hmac_seq_hash_first = 1;
			pcrypto_adapter->hmac_seq_hash_first = 0;
		}

		//Set mode parameters depend on what hash algorithm is
		if (pcrypto_adapter->isMD5) {
			pCL->habs = 1;
			pCL->hibs = 1;
			pCL->hobs = 1;
			pCL->hkbs = 1;
		} else if (pcrypto_adapter->isSHA1) {
			pCL->hmac_mode = 1;
			pCL->habs = 1;
		} else if (pcrypto_adapter->sha2type != SHA2_NONE) {
			//pCL->hmac_mode = (pcrypto_adapter->sha2type == SHA2_224 )? 2 : 3 ; // currently only support SHA2_224 / SHA2_256
			if (pcrypto_adapter->sha2type == SHA2_224) {
				pCL->hmac_mode = 2;
			} else if (pcrypto_adapter->sha2type == SHA2_256) {
				pCL->hmac_mode = 3;
			} else if (pcrypto_adapter->sha2type == SHA2_384) {
				pCL->hmac_mode = 4;
			} else if (pcrypto_adapter->sha2type == SHA2_512) {
				pCL->hmac_mode = 5;
			}
			pCL->habs = 1;
		}

		if (pcrypto_adapter->isHMAC) {
			pCL->hmac_en = 1;
		}

		if (pcrypto_adapter->hmac_seq_hash_last == 1) {

			// last msg payload always uses auto padding
			//pCL->enl = 1;
			pCL->enl = (enl + 15) / 16 ;
			pCL->enc_last_data_size = pcrypto_adapter->enc_last_data_size;
			pCL->ap0 = pcrypto_adapter->hmac_seq_hash_total_len * 8;
			DBG_CRYPTO_INFO("[Set src_desc_cmd_rst] enl = %d, enc_last_data_size = %d\r\n", pCL->enl, pcrypto_adapter->enc_last_data_size);
			DBG_CRYPTO_INFO("[Set src_desc_cmd_rst] hmac_seq_hash_total_len = %d\r\n", pcrypto_adapter->hmac_seq_hash_total_len);
			if (pcrypto_adapter->isHMAC) {
				if (pcrypto_adapter->sha2type == SHA2_384 || pcrypto_adapter->sha2type == SHA2_512) {
					pCL->ap0 += (128 * 8);
				} else {
					pCL->ap0 += (64 * 8);
				}
			}
		} else {
			if (pcrypto_adapter->sha2type == SHA2_384 || pcrypto_adapter->sha2type == SHA2_512) {
				pCL->enl = enl / 128;
				DBG_CRYPTO_INFO("Set enl / pCL->enl %x %x\r\n", enl, pCL->enl);
			} else {
				pCL->enl = enl / 64;
			}
		}

		//Check seq_hash last msg payload. If it's the last msg payload,need to write back(Hash out result)
		pCL->hmac_seq_hash_last = 0;
		pCL->hmac_seq_hash_no_wb = 1;
		if (pcrypto_adapter->hmac_seq_hash_last == 1) {
			pCL->hmac_seq_hash_last = 1;
			pCL->hmac_seq_hash_no_wb = 0;
		}
		if (pcrypto_adapter->is_wb == 1) {
			pCL->hmac_seq_hash_no_wb = 0;
		}

