swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
	}

	else { // cipher - encryption / decryption

		uint32_t cipher_type;
		uint32_t block_mode;

		// ECB / CBC / CTR;
		cipher_type = pcrypto_adapter->cipher_type;
		block_mode = cipher_type & CIPHER_TYPE_MASK_BLOCK;
		pCL->cipher_mode = block_mode;
		DBG_CRYPTO_INFO("[Set src_desc_cmd_rst] cipher_type = 0x%x,cipher_mode = 0x%x\r\n", cipher_type, block_mode);

		if (pcrypto_adapter->aes) {
			pCL->cipher_eng_sel = 0;
			switch (pcrypto_adapter->lenCipherKey) {
			case 128/8 :
				pCL->aes_key_sel = 0;
				break;
			case 192/8 :
				pCL->aes_key_sel = 1;
				break;
			case 256/8 :
				pCL->aes_key_sel = 2;
				break;
			default:
				break;
			}

			//AES,Chacha take 16bytes as a block to process data
			pCL->enl = (enl + 15) / 16;
			pCL->enc_last_data_size = pcrypto_adapter->enc_last_data_size;

			if ((block_mode ==  CIPHER_TYPE_BLOCK_GCM) || (block_mode ==  CIPHER_TYPE_BLOCK_GMAC)) {
				pCL->header_total_len = (a2eo + 15) / 16;
				pCL->aad_last_data_size = pcrypto_adapter->aad_last_data_size;
			}
		} else if (pcrypto_adapter->des) { //DES,3DES take 8bytes as a block to process data
			pCL->cipher_eng_sel = 1;
			pCL->des3_en = 0;
			pCL->enl = (enl + 7) / 8;
			pCL->enc_last_data_size = pcrypto_adapter->enc_last_data_size;
		} else if (pcrypto_adapter->trides) {
			pCL->cipher_eng_sel = 1;
			pCL->des3_en = 1;
			pCL->enl = (enl + 7) / 8;
			pCL->enc_last_data_size = pcrypto_adapter->enc_last_data_size;
		} else if (pcrypto_adapter->chacha) {
			pCL->cipher_eng_sel = 2;
			pCL->enl = (enl + 15) / 16;
			pCL->enc_last_data_size = pcrypto_adapter->enc_last_data_size;

			pCL->header_total_len = (a2eo + 15) / 16;
			pCL->aad_last_data_size = pcrypto_adapter->aad_last_data_size;
		}

		DBG_CRYPTO_INFO("[Set src_desc_cmd_rst] enl = %d, enc_last_data_size = %d\r\n", pCL->enl, pCL->enc_last_data_size);
		DBG_CRYPTO_INFO("[Set src_desc_cmd_rst] header_total_len = %d, aad_last_data_size = %d\r\n", pCL->header_total_len, pCL->aad_last_data_size);

		if (pcrypto_adapter->isDecrypt == 0) {
			pCL->cipher_encrypt = 1;
		}

		if (pcrypto_adapter->chacha) {
			pCL->ckws = 1;
			pCL->cabs = 1;
			pCL->ciws = 1;
			pCL->cibs = 1;
			pCL->cows = 1;
			pCL->cobs = 1;
			pCL->codws = 1;
			pCL->cidws = 1;
		}


		if (pcrypto_adapter->aes) {
			pCL->cabs = 1;
		}

		if (pcrypto_adapter->chacha) {
			pCL->ckbs = 1;
		}
	}


	pCL->icv_total_length = 0x40; // for mix mode, but need to set a value 0x40
}
#else

/**
 *  \fn          void hal_crypto_engine_setup_cl_buffer_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter)
 *  \brief       Use crypto adatper information to set crypto command setting buffer for normal mode.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_engine_setup_cl_buffer(hal_crypto_adapter_t *pcrypto_adapter)
{
	rtl_crypto_cl_t *pCL;
	uint32_t a2eo;
	uint32_t enl;

	DBG_CRYPTO_INFO("Set up src_desc command register\r\n");
	a2eo = pcrypto_adapter->a2eo;
	enl  = pcrypto_adapter->enl;

	//allocate a 32byte-aligned buffer and memset
	pCL = (rtl_crypto_cl_t *)pcrypto_adapter->cl_buffer;
	rtlc_memset((u8 *)pCL, 0, sizeof(pcrypto_adapter->cl_buffer));

	if (pcrypto_adapter->auth_type != AUTH_TYPE_NO_AUTH) {
		pCL->engine_mode = 1; //hash only

		//Enable seq_hash mechanism
		pCL->hmac_seq_hash = 1;

		//Check seq_hash first msg payload
		pCL->hmac_seq_hash_first = 0;
		if (pcrypto_adapter->hmac_seq_hash_first == 1) {
			pCL->hmac_seq_hash_first = 1;
			pcrypto_adapter->hmac_seq_hash_first = 0;
		}

		//Set mode parameters depend on what hash algorithm is
		if (pcrypto_adapter->isMD5) {
			pCL->habs = 1;
			pCL->hibs = 1;
			pCL->hobs = 1;
			pCL->hkbs = 1;
		} else if (pcrypto_adapter->isSHA1) {
			pCL->hmac_mode = 1;
			pCL->habs = 1;
		} else if (pcrypto_adapter->sha2type != SHA2_NONE) {
			//pCL->hmac_mode = (pcrypto_adapter->sha2type == SHA2_224 )? 2 : 3 ; // currently only support SHA2_224 / SHA2_256
			if (pcrypto_adapter->sha2type == SHA2_224) {
				pCL->hmac_mode = 2;
			} else if (pcrypto_adapter->sha2type == SHA2_256) {
				pCL->hmac_mode = 3;
			} else if (pcrypto_adapter->sha2type == SHA2_384) {
				pCL->hmac_mode = 4;
			} else if (pcrypto_adapter->sha2type == SHA2_512) {
				pCL->hmac_mode = 5;
			}
			pCL->habs = 1;
		}

		if (pcrypto_adapter->isHMAC) {
			pCL->hmac_en = 1;
		}

		if (pcrypto_adapter->hmac_seq_hash_last == 1) {

			// last msg payload always uses auto padding
			//pCL->enl = 1;
			pCL->enl = (enl + 15) / 16 ;
			pCL->enc_last_data_size = pcrypto_adapter->enc_last_data_size;
			pCL->ap0 = pcrypto_adapter->hmac_seq_hash_total_len * 8;
			DBG_CRYPTO_INFO("[Set src_desc_cmd_rst] enl = %d, enc_last_data_size = %d\r\n", pCL->enl, pcrypto_adapter->enc_last_data_size);
			DBG_CRYPTO_INFO("[Set src_desc_cmd_rst] hmac_seq_hash_total_len = %d\r\n", pcrypto_adapter->hmac_seq_hash_total_len);
			if (pcrypto_adapter->isHMAC) {
				if (pcrypto_adapter->sha2type == SHA2_384 || pcrypto_adapter->sha2type == SHA2_512) {
					pCL->ap0 += (128 * 8);
				} else {
					pCL->ap0 += (64 * 8);
				}
			}
		} else {
			if (pcrypto_adapter->sha2type == SHA2_384 || pcrypto_adapter->sha2type == SHA2_512) {
				pCL->enl = enl / 128;
				DBG_CRYPTO_INFO("Set enl / pCL->enl %x %x\r\n", enl, pCL->enl);
			} else {
				pCL->enl = enl / 64;
			}
		}

		//Check seq_hash last msg payload. If it's the last msg payload,need to write back(Hash out result)
		pCL->hmac_seq_hash_last = 0;
		pCL->hmac_seq_hash_no_wb = 1;
		if (pcrypto_adapter->hmac_seq_hash_last == 1) {
			pCL->hmac_seq_hash_last = 1;
			if (KEY_STG_WBTYPE_WB_ONLY_STG == (pcrypto_adapter->wb_key_cfg.b.sel)) {
				pCL->hmac_seq_hash_no_wb = 1;
			} else {
				pCL->hmac_seq_hash_no_wb = 0;
			}
		}
		if (pcrypto_adapter->is_wb == 1) {
			pCL->hmac_seq_hash_no_wb = 0;
		}
	} else { // cipher - encryption / decryption

		uint32_t cipher_type;
		uint32_t block_mode;

		// ECB / CBC / CTR;
		cipher_type = pcrypto_adapter->cipher_type;
		block_mode = cipher_type & CIPHER_TYPE_MASK_BLOCK;
		pCL->cipher_mode = block_mode;
		DBG_CRYPTO_INFO("[Set src_desc_cmd_rst] cipher_type = 0x%x,cipher_mode = 0x%x\r\n", cipher_type, block_mode);

