swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
		if (pcrypto_adapter->aes) {
			pCL->cipher_eng_sel = 0;
			switch (pcrypto_adapter->lenCipherKey) {
			case 128/8 :
				pCL->aes_key_sel = 0;
				break;
			case 192/8 :
				pCL->aes_key_sel = 1;
				break;
			case 256/8 :
				pCL->aes_key_sel = 2;
				break;
			default:
				break;
			}

			//AES,Chacha take 16bytes as a block to process data
			pCL->enl = (enl + 15) / 16;
			pCL->enc_last_data_size = pcrypto_adapter->enc_last_data_size;

			if ((block_mode ==  CIPHER_TYPE_BLOCK_GCM) || (block_mode ==  CIPHER_TYPE_BLOCK_GMAC)) {
				pCL->header_total_len = (a2eo + 15) / 16;
				pCL->aad_last_data_size = pcrypto_adapter->aad_last_data_size;
			}
		} else if (pcrypto_adapter->des) { //DES,3DES take 8bytes as a block to process data
			pCL->cipher_eng_sel = 1;
			pCL->des3_en = 0;
			pCL->enl = (enl + 7) / 8;
			pCL->enc_last_data_size = pcrypto_adapter->enc_last_data_size;
		} else if (pcrypto_adapter->trides) {
			pCL->cipher_eng_sel = 1;
			pCL->des3_en = 1;
			pCL->enl = (enl + 7) / 8;
			pCL->enc_last_data_size = pcrypto_adapter->enc_last_data_size;
		} else if (pcrypto_adapter->chacha) {
			pCL->cipher_eng_sel = 2;
			pCL->enl = (enl + 15) / 16;
			pCL->enc_last_data_size = pcrypto_adapter->enc_last_data_size;

			pCL->header_total_len = (a2eo + 15) / 16;
			pCL->aad_last_data_size = pcrypto_adapter->aad_last_data_size;
		}

		DBG_CRYPTO_INFO("[Set src_desc_cmd_rst] enl = %d, enc_last_data_size = %d\r\n", pCL->enl, pCL->enc_last_data_size);
		DBG_CRYPTO_INFO("[Set src_desc_cmd_rst] header_total_len = %d, aad_last_data_size = %d\r\n", pCL->header_total_len, pCL->aad_last_data_size);

		if (pcrypto_adapter->isDecrypt == 0) {
			pCL->cipher_encrypt = 1;
		}

		if (pcrypto_adapter->chacha) {
			pCL->ckws = 1;
			pCL->cabs = 1;
			pCL->ciws = 1;
			pCL->cibs = 1;
			pCL->cows = 1;
			pCL->cobs = 1;
			pCL->codws = 1;
			pCL->cidws = 1;
		}


		if (pcrypto_adapter->aes) {
			pCL->cabs = 1;
		}

		if (pcrypto_adapter->chacha) {
			pCL->ckbs = 1;
		}
	}


	pCL->icv_total_length = 0x40; // for mix mode, but need to set a value 0x40
}

#endif

/**
 *  \fn          void hal_crypto_engine_mix_setup_cl_buffer_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter)
 *  \brief       Use crypto adatper information to set crypto command setting buffer for mix mode.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_engine_mix_setup_cl_buffer(hal_crypto_adapter_t *pcrypto_adapter)
{
	rtl_crypto_cl_t *pCL;
	uint32_t a2eo;
	uint32_t enl;
	uint32_t hash_padlen;
	uint32_t enc_padlen;

	DBG_CRYPTO_INFO("[Mix mode]Set up src_desc command register\r\n");
	a2eo = pcrypto_adapter->a2eo;
	enl  = pcrypto_adapter->enl;
	hash_padlen = pcrypto_adapter->hash_padlen;
	enc_padlen  = pcrypto_adapter->enc_padlen;

	//allocate a 32byte-aligned buffer and memset
	pCL = (rtl_crypto_cl_t *)pcrypto_adapter->cl_buffer;
	rtlc_memset((u8 *)pCL, 0, sizeof(pcrypto_adapter->cl_buffer));

	if ((pcrypto_adapter->auth_type != AUTH_TYPE_NO_AUTH) && (pcrypto_adapter->cipher_type != CIPHER_TYPE_NO_CIPHER)) {
		pCL->engine_mode = pcrypto_adapter->mix_mode_type; //SSH-enc/ESP-dec

		//Disable seq_hash mechanism
		pCL->hmac_seq_hash = 0;

		// Mix mode doesn't have the seq_hash mechanism
		pCL->hmac_seq_hash_first = 0;
		pCL->hmac_seq_hash_last = 0;
		pCL->hmac_seq_hash_no_wb = 0;
		pcrypto_adapter->hmac_seq_hash_first = 0;

		//Set mode parameters depend on what hash algorithm is
		if (pcrypto_adapter->isMD5) {
			pCL->habs = 1;
			pCL->hibs = 1;
			pCL->hobs = 1;
			pCL->hkbs = 1;
			pCL->hmac_mode = 0;
		} else if (pcrypto_adapter->isSHA1) {
			pCL->hmac_mode = 1;
			pCL->habs = 1;
		} else if (pcrypto_adapter->sha2type != SHA2_NONE) {
			pCL->hmac_mode = (pcrypto_adapter->sha2type == SHA2_224) ? 2 : 3 ; // currently only support SHA2_224 / SHA2_256
			pCL->habs = 1;
		}

		if (pcrypto_adapter->isHMAC) {
			pCL->hmac_en = 1;
		}

		//cipher
		uint32_t cipher_type;
		uint32_t block_mode;

		// ECB / CBC / CFB / OFB /CTR;
		cipher_type = pcrypto_adapter->cipher_type;
		block_mode = cipher_type & CIPHER_TYPE_MASK_BLOCK;
		pCL->cipher_mode = block_mode;
		DBG_CRYPTO_INFO("[Set src_desc_cmd_rst] cipher_type = 0x%x,cipher_mode = 0x%x\r\n", cipher_type, block_mode);

		if (pcrypto_adapter->aes) {
			pCL->cipher_eng_sel = 0;
			switch (pcrypto_adapter->lenCipherKey) {
			case 128/8 :
				pCL->aes_key_sel = 0;
				break;
			case 192/8 :
				pCL->aes_key_sel = 1;
				break;
			case 256/8 :
				pCL->aes_key_sel = 2;
				break;
			default:
				break;
			}

			//AES take 16bytes as a block to process data
			pCL->enl = (enl + 15) / 16;
			pCL->enc_last_data_size = pcrypto_adapter->enc_last_data_size;

			pCL->header_total_len = (a2eo + 7) / 8;
			pCL->aad_last_data_size = pcrypto_adapter->aad_last_data_size;

			pCL->hash_pad_len = (hash_padlen + 7) / 8;
			pCL->pad_last_data_size = pcrypto_adapter->hashpad_last_data_size;

			pCL->eptl = (enc_padlen + 7) / 8;
			pCL->enc_pad_last_data_size = pcrypto_adapter->encpad_last_data_size;

		}

#if 1

		if (pcrypto_adapter->des) {   //DES,3DES take 8bytes as a block to process data
			pCL->cipher_eng_sel = 1;
			pCL->des3_en = 0;
			pCL->enl = (enl + 7) / 8;
			pCL->enc_last_data_size = pcrypto_adapter->enc_last_data_size;
		}
		if (pcrypto_adapter->trides) {
			pCL->cipher_eng_sel = 1;
			pCL->des3_en = 1;
			pCL->enl = (enl + 7) / 8;
			pCL->enc_last_data_size = pcrypto_adapter->enc_last_data_size;
		}
		if (pcrypto_adapter->chacha) {
			pCL->cipher_eng_sel = 2;
			pCL->enl = (enl + 15) / 16;
			pCL->enc_last_data_size = pcrypto_adapter->enc_last_data_size;

			pCL->header_total_len = (a2eo + 15) / 16;
			pCL->aad_last_data_size = pcrypto_adapter->aad_last_data_size;
		}

#endif

		DBG_CRYPTO_INFO("[Set src_desc_cmd_rst] enl = %d, enc_last_data_size = %d\r\n", pCL->enl, pCL->enc_last_data_size);
		DBG_CRYPTO_INFO("[Set src_desc_cmd_rst] header_total_len = %d, aad_last_data_size = %d\r\n", pCL->header_total_len, pCL->aad_last_data_size);
		DBG_CRYPTO_INFO("[Set src_desc_cmd_rst] hash_padlen = %d, pad_last_data_size = %d\r\n", pCL->hash_pad_len, pCL->pad_last_data_size);
		DBG_CRYPTO_INFO("[Set src_desc_cmd_rst] enc_padlen = %d, enc_pad_last_data_size = %d\r\n", pCL->eptl, pCL->enc_pad_last_data_size);

