swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
		if (pcrypto_adapter->isDecrypt == 0) {
			pCL->cipher_encrypt = 1;
		}
		if (pcrypto_adapter->chacha) {
			pCL->ckws = 1;
			pCL->cabs = 1;
			pCL->ciws = 1;
			pCL->cibs = 1;
			pCL->cows = 1;
			pCL->cobs = 1;
			pCL->codws = 1;
			pCL->cidws = 1;
		}


		if (pcrypto_adapter->aes) {
			pCL->cabs = 1;
		}

		if (pcrypto_adapter->chacha) {
			pCL->ckbs = 1;
		}
	}
	if (CRYPTO_ENGINE_SET_MIX_MODE_SSL_TLS_ENC == (pCL->engine_mode)) {
		pCL->icv_total_length = (pcrypto_adapter->digestlen); // For mix mode ssl_tls_enc, need to set less than or equal to digest length.
	} else {
		pCL->icv_total_length = 0x40; // For others(mix_mode ssh,esp/only cipher/only hash),this set max. digest length value = 64byts(0x40).
	}
}

/**
 *  \fn          void hal_crypto_engine_srcdesc_generate_cl_key_iv_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
 *                                                                          const u8* p_iv, uint32_t ivLen)
 *  \brief       Set command setting buffer, key buffer, initial vector buffer, HMAC padding buffer in source descripter.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   p_iv Pointer to crypto initial vector buffer
 *  \param[in]   ivLen Crypto initial vector buffer length
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_engine_srcdesc_generate_cl_key_iv(hal_crypto_adapter_t *pcrypto_adapter,
		const u8 *p_iv, uint32_t ivLen)
{
	rtl_crypto_srcdesc_t src_desc;
	//uint32_t val;

	src_desc.w = 0;

	// FS=1, CL=3
	src_desc.b.rs = 1;
	src_desc.b.fs = 1;
	src_desc.b.cl = 3;

	if (pcrypto_adapter->is_securekey == 1) {
		src_desc.b.sk = 1;
		src_desc.b.key_len = pcrypto_adapter->index_securekey;
		//dbg_printf("set input sk = %d\r\n",(pcrypto_adapter->index_securekey));
	}

	if (pcrypto_adapter->auth_type != AUTH_TYPE_NO_AUTH) {
		if (pcrypto_adapter->sha2type == SHA2_256) {
			if (pcrypto_adapter->is_writeback == 1) {
				src_desc.b.wk = 1;
				src_desc.b.iv_len = pcrypto_adapter->index_writeback;
				//dbg_printf("set wb sk = %d\r\n",(pcrypto_adapter->index_writeback));
			}
		}
	}

	if ((pcrypto_adapter->hash_padlen) == 0) { // Normal mode: enable auto-padding
		// auto padding[Hash algorithms need to set this]
		// It doesn't mean padding that makes up 16bytes aligned msglen]
		if (pcrypto_adapter->hmac_seq_hash_last) {
			src_desc.b.ap = 0x01;
			if (pcrypto_adapter->sha2type == SHA2_384 || pcrypto_adapter->sha2type == SHA2_512) {
				//src_desc.b.ap = 0x11; //john codes? really weird!! To verify
				src_desc.b.ap = 0x3;
			}
//            else if(pcrypto_adapter->sha2type == SHA2_512){
//                src_desc.b.ap = 0x10;
//            }
		}
		hal_rtl_crypto_engine_setup_cl_buffer(pcrypto_adapter);
	} else {  //Mix mode: disable auto-padding
		src_desc.b.ap = 0x00;
		hal_rtl_crypto_engine_mix_setup_cl_buffer(pcrypto_adapter);
	}

	arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)(&(pcrypto_adapter->cl_buffer)[0]), 32);
	__dbg_mem_dump(pcrypto_adapter->isMemDump, (uint32_t)(&(pcrypto_adapter->cl_buffer)[0]), sizeof(pcrypto_adapter->cl_buffer), "Command Setting: ");
	hal_rtl_crypto_set_srcdesc(pcrypto_adapter, src_desc.w, (uint32_t)(&(pcrypto_adapter->cl_buffer)[0]));

	// Set key
	if (pcrypto_adapter->cipher_type != CIPHER_TYPE_NO_CIPHER) {
		if (pcrypto_adapter->is_securekey == 0) {
			uint32_t lenCipherKey;
			u8  *pCipherKey;
			uint32_t cache_len;

			lenCipherKey = (uint32_t) pcrypto_adapter->lenCipherKey;
			pCipherKey = (u8 *) pcrypto_adapter->pCipherKey;
			DBG_CRYPTO_INFO("[Set src_desc_set_key] lenCipherKey = %d\r\n", lenCipherKey);

			src_desc.w = 0;
			src_desc.b.rs = 1;
			src_desc.b.fs = 1;
			src_desc.b.key_len = lenCipherKey / 4; //key_len use 4bytes as a unit

			cache_len = (lenCipherKey & 0x1F) ? ((lenCipherKey / 32) + 1) * 32 : lenCipherKey;
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)(pCipherKey), cache_len);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, (uint32_t)(pCipherKey), lenCipherKey, "KEY: ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, src_desc.w, (uint32_t)(pCipherKey));
		}
	}

	// Set IV
	if (pcrypto_adapter->cipher_type != CIPHER_TYPE_NO_CIPHER) {
		if (p_iv != NULL && ivLen > 0) {
			DBG_CRYPTO_INFO("[Set src_desc_set_IV] ivLen = %d\r\n", ivLen);
			uint32_t cache_len;
			src_desc.w = 0;
			src_desc.b.rs = 1;
			src_desc.b.fs = 1;
			src_desc.b.iv_len = ivLen / 4; //iv_len use 4bytes as a unit

			if (ivLen & 0x1F) {
				cache_len = ((ivLen / 32) + 1) * 32;
			} else {
				cache_len = ivLen;
			}
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)(p_iv), cache_len);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, (uint32_t)(p_iv), ivLen, "IV: ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, src_desc.w, (uint32_t)(p_iv));
		}
	}


	// Set Pad
	if (pcrypto_adapter->isHMAC) {
		if (pcrypto_adapter->is_securekey == 0) {
			src_desc.w = 0;
			src_desc.b.rs = 1;
			src_desc.b.fs = 1;
			if ((pcrypto_adapter->sha2type == SHA2_384) || (pcrypto_adapter->sha2type == SHA2_512)) {
				src_desc.b.keypad_len = (256 / 4); //HMAC keypad_len use 4bytes as a unit
			} else {
				src_desc.b.keypad_len = (128 / 4); //HMAC keypad_len use 4bytes as a unit
			}

			if (pcrypto_adapter->sha2type == SHA2_384 || pcrypto_adapter->sha2type == SHA2_512) {
				arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)(&(pcrypto_adapter->g_IOPAD_SHA512[0])), 256);
				__dbg_mem_dump(pcrypto_adapter->isMemDump, (uint32_t)(&(pcrypto_adapter->g_IOPAD_SHA512[0])), 256, "HMAC Key PAD SHA384: ");
				hal_rtl_crypto_set_srcdesc(pcrypto_adapter, src_desc.w, (uint32_t)(&(pcrypto_adapter->g_IOPAD_SHA512[0])));
			} else {
				arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)(&(pcrypto_adapter->g_IOPAD[0])), 128);
				__dbg_mem_dump(pcrypto_adapter->isMemDump, (uint32_t)(&(pcrypto_adapter->g_IOPAD[0])), 128, "HMAC Key PAD: ");
				hal_rtl_crypto_set_srcdesc(pcrypto_adapter, src_desc.w, (uint32_t)(&(pcrypto_adapter->g_IOPAD[0])));
			}
		}
	}

	// Set SHIVL
	if (pcrypto_adapter->is_SHIVL == 1) {

		src_desc.w = 0;
		src_desc.b.rs = 1;
		src_desc.b.fs = 1;
		src_desc.b.hash_iv_len = 4;//pcrypto_adapter->SHIVL_len/4; // 4bytes as a unit

		//dbg_printf("SHIVL addr %x\r\n", (uint32_t)(&(pcrypto_adapter->SHIVL_buff[0]))  );

		arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)(&(pcrypto_adapter->SHIVL_buff[0])), 32);
		__dbg_mem_dump(pcrypto_adapter->isMemDump, (uint32_t)(&(pcrypto_adapter->SHIVL_buff[0])), 32, "SHIVL: ");
		hal_rtl_crypto_set_srcdesc(pcrypto_adapter, src_desc.w, (uint32_t)(&(pcrypto_adapter->SHIVL_buff[0])));
	}
}

/**
 *  \fn          int hal_crypto_engine_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
                                                IN const u8 *message,   IN const uint32_t msglen,
                                                IN const u8 *pIv,       IN const uint32_t ivlen,
                                                IN const u8 *paad,      IN const uint32_t aadlen,
                                                OUT u8 *pResult, OUT u8 *pTag)
 *  \brief       Check input parameters, and set crypto engine registers, then make crypto engine handle this algorithm.
 *  \details     The executing order of crypto engine setting: \n
 *               - Initialize the notified mechanism.
 *               - Set essential buffers and buffer lengths of the cryptographic feature to crypto adapter
 *               - Setup desitination descriptor
 *               - Setup source descriptor
 *                  - Setup command setting buffer
 *                  - Setup key, initial vector, HMAC padding buffer
 *                  - Prepare Data1 ~ DataN
 *               - Wait to be notified after interrupt service routine processed over.
 *  \note        For normal mode(Seperate to calcualte each algorithm)
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   message Pointer to Crypto cipher message buffer
 *  \param[in]   msglen Crypto cipher message buffer length
 *  \param[in]   pIv Pointer to Crypto cipher initial vector buffer
 *  \param[in]   ivlen Crypto cipher initial vector buffer length
 *  \param[in]   paad Pointer to Crypto cipher additional authentication data buffer
 *  \param[in]   aadlen Crypto cipher additional authentication data buffer length
 *  \param[out]  pResult Pointer to Crypto cipher result buffer
 *  \param[out]  pTag Pointer to Crypto cipher Tag buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_engine(hal_crypto_adapter_t *pcrypto_adapter,
						  IN const u8 *message,    IN const uint32_t msglen,
						  IN const u8 *pIv,        IN const uint32_t ivlen,
						  IN const u8 *paad,     IN const uint32_t aadlen,
						  OUT u8 *pResult, OUT u8 *pTag)
{
	rtl_crypto_srcdesc_t srcdesc;

	uint32_t a2eo;
	uint32_t enl;
	uint32_t digestlen;
	uint32_t cipher_type = CIPHER_TYPE_NONE;
	uint32_t block_mode;
	volatile uint8_t *padding = NULL;
	int ret = SUCCESS;

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	} else {
		padding = (&(pcrypto_adapter->padding[0]));
	}
	hal_rtl_crypto_engine_pre_exec(pcrypto_adapter);

	if ((paad != NULL) && (aadlen > 0)) {
		uint32_t cache_len;
		if (aadlen & 0x1F) {
			cache_len = ((aadlen / 32) + 1) * 32;
		} else {
			cache_len = aadlen;
		}
		arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)paad, cache_len);
	}

