swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
	// Use only one scatter
	a2eo = aadlen;
	enl = msglen;

	hal_rtl_crypto_start_packet_init(pcrypto_adapter);
//
//   Set relative length data
//
	hal_rtl_crypto_engine_auth_calc_apl(pcrypto_adapter, a2eo, enl, 0, 0);
	//Only AES_GCM may modify enc_last_data_size in decryption to match with the tag value of encryption
	if (pcrypto_adapter->isDecrypt) {
		cipher_type = pcrypto_adapter->cipher_type;
		block_mode  = cipher_type & CIPHER_TYPE_MASK_BLOCK;
		if ((pcrypto_adapter->aes) && (block_mode ==  CIPHER_TYPE_BLOCK_GCM)) {
			hal_rtl_crypto_modify_enc_last_data_size(pcrypto_adapter, message, enl);
		}
	}

	//Hash result length
	digestlen = pcrypto_adapter->digestlen;

	if (pcrypto_adapter->auth_type != AUTH_TYPE_NO_AUTH) {

		//Sum of seq_hash msglen
		pcrypto_adapter->hmac_seq_hash_total_len += msglen;

		//Make sure if it's the last seq_hash msg payload
#if IS_CUT_TEST(CONFIG_CHIP_VER)
		if (pResult != NULL) {
			pcrypto_adapter->hmac_seq_hash_last = 1;
		}
#else
		if (pResult != NULL) {
			pcrypto_adapter->hmac_seq_hash_last = 1;
		} else {
			if (pcrypto_adapter->hmac_seq_hash_sk_last == 1) {
				pcrypto_adapter->hmac_seq_hash_last = 1;
			}
		}
#endif
	}

	/********************************************
	 * step 1: Setup desitination descriptor
	 ********************************************/
	pcrypto_adapter->is_dst_first_cache_used = 0;
	pcrypto_adapter->is_dst_last_cache_used  = 0;

	if (pcrypto_adapter->auth_type != AUTH_TYPE_NO_AUTH) {
		rtl_crypto_dstdesc_t dst_desc;

#if IS_CUT_TEST(CONFIG_CHIP_VER)
		if (pResult == NULL) {
			if (pcrypto_adapter->is_wb == 1) {
				//dbg_printf("des_is_SHIVL\r\n");
				dst_desc.w = 0;
				dst_desc.auth.ws  = 1;
				dst_desc.auth.fs  = 1;
				dst_desc.auth.ls  = 1;
				dst_desc.auth.adl = digestlen;
				arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pcrypto_adapter->temp_digest_result, 32);
				hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_desc.w, (uint32_t)pcrypto_adapter->temp_digest_result);

			}
		}
		//It's the last seq_hash msg payload, so need to hash out the result
		if (pResult != NULL) {
			dst_desc.w = 0;
			dst_desc.auth.ws  = 1;
			dst_desc.auth.fs  = 1;
			dst_desc.auth.ls  = 1;
			dst_desc.auth.adl = digestlen;
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pcrypto_adapter->digest_result, 32);
			hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_desc.w, (uint32_t)pcrypto_adapter->digest_result);
		}
#else
		if (pResult == NULL) {
			if (KEY_STG_WBTYPE_WB_ONLY_STG != (pcrypto_adapter->wb_key_cfg.b.sel)) {
				if (pcrypto_adapter->is_wb == 1) {
					//dbg_printf("des_is_SHIVL\r\n");
					dst_desc.w = 0;
					dst_desc.auth.ws  = 1;
					dst_desc.auth.fs  = 1;
					dst_desc.auth.ls  = 1;
					dst_desc.auth.adl = digestlen;
					arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pcrypto_adapter->temp_digest_result, 32);
					hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_desc.w, (uint32_t)pcrypto_adapter->temp_digest_result);

				}
			}
		}

		//else{
		//It's the last seq_hash msg payload, so need to hash out the result
		if (pResult != NULL) {
			dst_desc.w = 0;
			dst_desc.auth.ws  = 1;
			dst_desc.auth.fs  = 1;
			dst_desc.auth.ls  = 1;
			dst_desc.auth.adl = digestlen;
			if ((pcrypto_adapter->sha2type == SHA2_384) || (pcrypto_adapter->sha2type == SHA2_512)) {
				arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pcrypto_adapter->digest_result_SHA512, 64);
				hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_desc.w, (uint32_t)pcrypto_adapter->digest_result_SHA512);
			} else {
				arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pcrypto_adapter->digest_result, 32);
				hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_desc.w, (uint32_t)pcrypto_adapter->digest_result);
			}
		}
#endif
		//}
	} else { // cipher(also need dst_auth_desc(such as AES_GCM or Chacha_poly1305) or poly1305)
		rtl_crypto_dstdesc_t  dst_auth_desc;
		rtl_crypto_dstdesc_t  dst_cipher_desc;
		int8_t first_cache_pos = 0;
		int8_t first_cache_len = 0;
		int8_t last_cache_pos  = 0;
		int8_t last_cache_len  = 0;
		int dst_len;

		if (pResult != NULL) {
			//Destination descriptor may change msglen, because of encryption padding
			dst_len = (pcrypto_adapter->enl + (pcrypto_adapter->apl));
			DBG_CRYPTO_INFO("[Set dest_desc] dst_len = %d,enl = %d,apl = %d\r\n", dst_len, (pcrypto_adapter->enl), (pcrypto_adapter->apl));

			first_cache_pos = (uint32_t)pResult & 0x1F;
			first_cache_len = (32 - first_cache_pos) % 32;
			if (first_cache_len >= dst_len) {
				//There's an enough space of first_cache_line for dst_len
				first_cache_len = dst_len;
				last_cache_len  = 0;
			} else {
				last_cache_pos = (uint32_t)(pResult + dst_len - 1) & 0x1F;
				last_cache_len = last_cache_pos + 1;
				if (last_cache_len == 32) {
					last_cache_len = 0;
				}
			}
			DBG_CRYPTO_INFO("[Set dest_desc] f_cache_pos = %d,f_cache_len = %d\r\n", first_cache_pos, first_cache_len);
			DBG_CRYPTO_INFO("[Set dest_desc] l_cache_pos = %d,l_cache_len = %d\r\n", last_cache_pos, last_cache_len);

			dst_cipher_desc.w = 0;
			dst_cipher_desc.cipher.ws  = 1;
			dst_cipher_desc.cipher.fs  = 1;
			dst_cipher_desc.cipher.enc = 1;

			if (first_cache_len != 0) {
				pcrypto_adapter->is_dst_first_cache_used = 1;
				dst_cipher_desc.cipher.enl = first_cache_len;
				DBG_CRYPTO_INFO("[Set dest_desc] f_cache_line_enl = %d\r\n", first_cache_len);
				if ((first_cache_len >= dst_len) && (pTag == NULL)) {
					dst_cipher_desc.cipher.ls = 1;
				}
				arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pcrypto_adapter->dst_first_cache_line, 32);
				hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_cipher_desc.w, (uint32_t)pcrypto_adapter->dst_first_cache_line);

				dst_len -= first_cache_len;
				pResult += first_cache_len;

				dst_cipher_desc.w = 0;
				dst_cipher_desc.cipher.ws = 1;
				dst_cipher_desc.cipher.enc = 1;
			}

			if (dst_len > 0) {
				//Cut off valid msg of last_cache_line
				//It means leave 32 bytes alignment addr of msg_body
				dst_cipher_desc.cipher.enl = (dst_len - last_cache_len);

