swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
				if (last_cache_len != 0) {
					pcrypto_adapter->is_dst_last_cache_used = 1;
					if (dst_len > last_cache_len) { // body
						arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pResult, (dst_len - last_cache_len));
						hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_cipher_desc.w, (uint32_t)pResult);
					}
					pResult += (dst_len - last_cache_len);
					dst_len = last_cache_len;

					dst_cipher_desc.w = 0;
					dst_cipher_desc.cipher.ws  = 1;
					dst_cipher_desc.cipher.enc = 1;
					dst_cipher_desc.cipher.enl = last_cache_len;
					DBG_CRYPTO_INFO("[Set dest_desc] l_cache_line_enl = %d\r\n", last_cache_len);
					if (pTag == NULL) {
						dst_cipher_desc.cipher.ls = 1;
					}
					arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pcrypto_adapter->dst_last_cache_line, 32);
					hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_cipher_desc.w, (uint32_t)pcrypto_adapter->dst_last_cache_line);
				} else {
					if (pTag == NULL) {
						dst_cipher_desc.cipher.ls = 1;
					}
					arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pResult, dst_cipher_desc.cipher.enl);
					hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_cipher_desc.w, (uint32_t)pResult);
				}
			}
		}

		if (pTag != NULL) {
			//Calculate cipher Tag,use adl not enc!
			dst_auth_desc.w = 0;

			if (CIPHER_TYPE_POLY1305 == (cipher_type & CIPHER_TYPE_MASK_ALL)) {
				dst_auth_desc.auth.fs = 1;
			}


			if ((CIPHER_TYPE_AES_GHASH == (cipher_type & CIPHER_TYPE_MASK_ALL)) ||
				(CIPHER_TYPE_AES_GMAC  == (cipher_type & CIPHER_TYPE_MASK_ALL))) {
				dst_auth_desc.auth.fs = 1;
			}
			dst_auth_desc.auth.ws  = 1;
			dst_auth_desc.auth.enc = 0;
			dst_auth_desc.auth.adl = 16;
			dst_auth_desc.auth.ls  = 1;
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pcrypto_adapter->tag_result, 32);
			hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_auth_desc.w, (uint32_t)pcrypto_adapter->tag_result);
		}
	}

	/********************************************
	 * step 2: Setup source descriptor
	 ********************************************/
	/********************************************
	  * step 2-1: prepare Key & IV array:
	  ********************************************/

	hal_rtl_crypto_engine_srcdesc_generate_cl_key_iv(pcrypto_adapter, pIv, ivlen);


	/********************************************
	 * step 2-2: prepare Data1 ~ DataN
	 ********************************************/

	srcdesc.w = 0;
	srcdesc.d.rs = 1;

	if (paad != NULL) {
		while (a2eo > 16) {
			srcdesc.d.a2eo = 16;

			__dbg_mem_dump(pcrypto_adapter->isMemDump, paad, 16, "AAD[while-loop]: ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)paad);

			paad += 16;
			a2eo -= 16;
			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		}

		if (a2eo > 0) {
			DBG_CRYPTO_INFO("[Set src_desc_data] a2eo = %d\r\n", a2eo);
			srcdesc.d.a2eo = a2eo;
			__dbg_mem_dump(pcrypto_adapter->isMemDump, paad, a2eo, "AAD[rest]: ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)paad);
			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		}

		//Handle padding issue
		if (pcrypto_adapter->apl_aad > 0) {
			DBG_CRYPTO_INFO("[Set src_desc_data] apl_aad = %d\r\n", pcrypto_adapter->apl_aad);
			srcdesc.d.a2eo = pcrypto_adapter->apl_aad;
			//rtl_printf("clean padding: 0x%x \r\n", padding);
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)padding, 64);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, padding, pcrypto_adapter->apl_aad, "AAD padding ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)padding);
			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		}

	}

	{
		int8_t first_cache_pos = 0;
		int8_t first_cache_len = 0;
		int8_t last_cache_pos  = 0;
		int8_t last_cache_len  = 0;

		first_cache_pos = (uint32_t) message & 0x1F;
		first_cache_len = (32 - first_cache_pos) % 32;
		if ((uint32_t)first_cache_len >= enl) { // the same one
			first_cache_len = enl;
			last_cache_len  = 0;
		} else {
			last_cache_pos = ((uint32_t)(message) + enl - 1) & 0x1F;
			last_cache_len = last_cache_pos + 1;
		}

		DBG_CRYPTO_INFO("[Set src_desc_data] f_cache_pos = %d,f_cache_len = %d\r\n", first_cache_pos, first_cache_len);
		DBG_CRYPTO_INFO("[Set src_desc_data] l_cache_pos = %d,l_cache_len = %d\r\n", last_cache_pos, last_cache_len);

		if (first_cache_len != 0) {
			rtlc_memcpy((void *)(&(pcrypto_adapter->src_first_cache_line[0])), (const void *)(message), first_cache_len);

			if (((uint32_t)first_cache_len >= enl) && (pcrypto_adapter->apl == 0)) {
				srcdesc.d.ls = 1;
			}
			srcdesc.d.enl = first_cache_len;
			DBG_CRYPTO_INFO("[Set src_desc_data] f_cache_line_enl = %d\r\n", first_cache_len);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, &(pcrypto_adapter->src_first_cache_line[0]), first_cache_len, "src_data[first_cache_line]: ");
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)(&(pcrypto_adapter->src_first_cache_line[0])), 32);
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)(&(pcrypto_adapter->src_first_cache_line[0])));
			message += first_cache_len;
			enl -= first_cache_len; // 未消化的
			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		}

		// 16352 bytes is the max size of enl could set!
		while (enl > 16352) {
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)message, 16352);
			srcdesc.d.enl = 16352;
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)message);

			message += 16352;
			enl -= 16352;
			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		}

		//Cut off valid msg of last_cache_line
		//It means leave 32 bytes alignment addr of msg_body
		// message aligned body
		if (enl > (uint32_t)(last_cache_len)) {
			uint32_t dst_len = enl - (uint32_t)(last_cache_len);

			// assert
			if ((dst_len & 0x1F) != 0) {
				DBG_CRYPTO_INFO("Strange : enl(%d), last_cache_len(%d)", enl, last_cache_len);
				return _ERRNO_CRYPTO_CACHE_HANDLE;
			}

			DBG_CRYPTO_INFO("[Set src_desc_data] dst_len = %d\r\n", dst_len);
			srcdesc.d.enl = dst_len;
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)message, srcdesc.d.enl);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, message, msglen, "src_data[msg_32align_body]: ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)message);
			message += dst_len;
			enl -= dst_len;

			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		} else if (enl < (uint32_t)(last_cache_len)) {
			// can change to use assert function
			DBG_CRYPTO_INFO("Strange : enl(%d), last_cache_len(%d)", enl, last_cache_len);
			return _ERRNO_CRYPTO_CACHE_HANDLE;
		}

		if (last_cache_len == 32) {
			if (pcrypto_adapter->apl == 0) {
				srcdesc.d.ls = 1;
			}
			srcdesc.d.enl = 32;
			__dbg_mem_dump(pcrypto_adapter->isMemDump, message, 32, "src_data[last_cache_len_equal_32]: ");
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)message, 32);
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)message);
		} else if (last_cache_len != 0)  {
			rtlc_memcpy((void *)(pcrypto_adapter->src_last_cache_line), (const void *)(message), last_cache_len);
			DBG_CRYPTO_INFO("[Set src_desc_data] l_cache_len(below 32) = %d\r\n", last_cache_len);
			if (pcrypto_adapter->apl == 0) {
				srcdesc.d.ls = 1;
			}
			srcdesc.d.enl = last_cache_len;
			__dbg_mem_dump(pcrypto_adapter->isMemDump, pcrypto_adapter->src_last_cache_line, last_cache_len, "src_data[last_cache_len_below_32]: ");
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pcrypto_adapter->src_last_cache_line, 32);
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)pcrypto_adapter->src_last_cache_line);
		}

		if (pcrypto_adapter->apl != 0) {
			DBG_CRYPTO_INFO("[Set src_desc_data] pcrypto_adapter->apl = %d\r\n", pcrypto_adapter->apl);
			srcdesc.w = 0;
			srcdesc.d.rs  = 1;
			srcdesc.d.enl = pcrypto_adapter->apl;
			srcdesc.d.ls  = 1;
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)padding, 64);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, padding, srcdesc.d.enl, "src_data padding ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)padding);
		}
	}

