swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
	ret = hal_rtl_crypto_engine_wait_done(pcrypto_adapter);

//    __dbg_mem_dump(pcrypto_adapter->isMemDump,pcrypto_adapter->temp_digest_result, 32, "wait temp_digest_result: ");
//    __dbg_mem_dump(pcrypto_adapter->isMemDump,pcrypto_adapter->digest_result, 32, "wait digest_result: ");

	if (pcrypto_adapter->is_wb == 1) {
		rtlc_memcpy((void *)(pcrypto_adapter->SHIVL_buff), (const void *)(pcrypto_adapter->temp_digest_result), 32);
		//pcrypto_adapter->SHIVL_len = 32/4;
		__dbg_mem_dump(pcrypto_adapter->isMemDump, pcrypto_adapter->SHIVL_buff, 32, "pcrypto_adapter->SHIVL_buff: ");
	}
	return ret;
}

#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_engine_SHA512(hal_crypto_adapter_t *pcrypto_adapter,
								 IN const u8 *message,   IN const uint32_t msglen,
								 IN const u8 *pIv,       IN const uint32_t ivlen,
								 IN const u8 *paad,     IN const uint32_t aadlen,
								 OUT u8 *pResult, OUT u8 *pTag)
{
	rtl_crypto_srcdesc_t srcdesc;

	uint32_t a2eo;
	uint32_t enl;
	uint32_t digestlen;
	//uint32_t cipher_type = CIPHER_TYPE_NONE;
	//uint32_t block_mode;
	volatile uint8_t *padding = NULL;
	int ret = SUCCESS;

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	} else {
		padding = (&(pcrypto_adapter->padding[0]));
	}
	hal_rtl_crypto_engine_pre_exec(pcrypto_adapter);

	if ((paad != NULL) && (aadlen > 0)) {
		uint32_t cache_len;
		if (aadlen & 0x1F) {
			cache_len = ((aadlen / 32) + 1) * 32;
		} else {
			cache_len = aadlen;
		}
		arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)paad, cache_len);
	}

	// Use only one scatter
	a2eo = aadlen;
	enl = msglen;

	hal_rtl_crypto_start_packet_init(pcrypto_adapter);
//
//   Set relative length data
//
	hal_rtl_crypto_engine_auth_calc_apl(pcrypto_adapter, a2eo, enl, 0, 0);
	//Only AES_GCM may modify enc_last_data_size in decryption to match with the tag value of encryption
//    if (pcrypto_adapter->isDecrypt){
//        cipher_type = pcrypto_adapter->cipher_type;
//        block_mode  = cipher_type & CIPHER_TYPE_MASK_BLOCK;
//        if ((pcrypto_adapter->aes) && (block_mode ==  CIPHER_TYPE_BLOCK_GCM)) {
//            hal_crypto_modify_enc_last_data_size_rtl8710c(pcrypto_adapter,message,enl);
//        }
//    }

	//Hash result length
	digestlen = pcrypto_adapter->digestlen;

	if (pcrypto_adapter->auth_type != AUTH_TYPE_NO_AUTH) {

		//Sum of seq_hash msglen
		pcrypto_adapter->hmac_seq_hash_total_len += msglen;

		//Make sure if it's the last seq_hash msg payload
		if (pResult != NULL) {
			pcrypto_adapter->hmac_seq_hash_last = 1;
		}

	}

	/********************************************
	 * step 1: Setup desitination descriptor
	 ********************************************/
	pcrypto_adapter->is_dst_first_cache_used = 0;
	pcrypto_adapter->is_dst_last_cache_used  = 0;

	if (pcrypto_adapter->auth_type != AUTH_TYPE_NO_AUTH) {
		rtl_crypto_dstdesc_t dst_desc;

		//It's the last seq_hash msg payload, so need to hash out the result
		if (pResult != NULL) {
			dst_desc.w = 0;
			dst_desc.auth.ws  = 1;
			dst_desc.auth.fs  = 1;
			dst_desc.auth.ls  = 1;
			dst_desc.auth.adl = digestlen;
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pcrypto_adapter->digest_result_SHA512, 64);
			hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_desc.w, (uint32_t)pcrypto_adapter->digest_result_SHA512);
		}
		//}


	}


	/********************************************
	 * step 2: Setup source descriptor
	 ********************************************/
	/********************************************
	  * step 2-1: prepare Key & IV array:
	  ********************************************/

	hal_rtl_crypto_engine_srcdesc_generate_cl_key_iv(pcrypto_adapter, pIv, ivlen);


	/********************************************
	 * step 2-2: prepare Data1 ~ DataN
	 ********************************************/

	srcdesc.w = 0;
	srcdesc.d.rs = 1;

	if (paad != NULL) {
		while (a2eo > 16) {
			srcdesc.d.a2eo = 16;

			__dbg_mem_dump(pcrypto_adapter->isMemDump, paad, 16, "AAD[while-loop]: ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)paad);

			paad += 16;
			a2eo -= 16;
			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		}

		if (a2eo > 0) {
			DBG_CRYPTO_INFO("[Set src_desc_data] a2eo = %d\r\n", a2eo);
			srcdesc.d.a2eo = a2eo;
			__dbg_mem_dump(pcrypto_adapter->isMemDump, paad, a2eo, "AAD[rest]: ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)paad);
			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		}

		//Handle padding issue
		if (pcrypto_adapter->apl_aad > 0) {
			DBG_CRYPTO_INFO("[Set src_desc_data] apl_aad = %d\r\n", pcrypto_adapter->apl_aad);
			srcdesc.d.a2eo = pcrypto_adapter->apl_aad;
			//rtl_printf("clean padding: 0x%x \r\n", padding);
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)padding, 64);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, padding, pcrypto_adapter->apl_aad, "AAD padding ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)padding);
			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		}

	}

	{
		int8_t first_cache_pos = 0;
		int8_t first_cache_len = 0;
		int8_t last_cache_pos  = 0;
		int8_t last_cache_len  = 0;

		first_cache_pos = (uint32_t) message & 0x1F;
		first_cache_len = (32 - first_cache_pos) % 32;
		if ((uint32_t)first_cache_len >= enl) { // the same one
			first_cache_len = enl;
			last_cache_len  = 0;
		} else {
			last_cache_pos = ((uint32_t)(message) + enl - 1) & 0x1F;
			last_cache_len = last_cache_pos + 1;
		}

		DBG_CRYPTO_INFO("[Set src_desc_data] f_cache_pos = %d,f_cache_len = %d\r\n", first_cache_pos, first_cache_len);
		DBG_CRYPTO_INFO("[Set src_desc_data] l_cache_pos = %d,l_cache_len = %d\r\n", last_cache_pos, last_cache_len);

		if (first_cache_len != 0) {
			rtlc_memcpy((void *)(&(pcrypto_adapter->src_first_cache_line[0])), (const void *)(message), first_cache_len);

			if (((uint32_t)first_cache_len >= enl) && (pcrypto_adapter->apl == 0)) {
				srcdesc.d.ls = 1;
			}
			srcdesc.d.enl = first_cache_len;
			DBG_CRYPTO_INFO("[Set src_desc_data] f_cache_line_enl = %d\r\n", first_cache_len);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, &(pcrypto_adapter->src_first_cache_line[0]), first_cache_len, "src_data[first_cache_line]: ");
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)(&(pcrypto_adapter->src_first_cache_line[0])), 32);
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)(&(pcrypto_adapter->src_first_cache_line[0])));
			message += first_cache_len;
			enl -= first_cache_len; // 未消化的
			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		}

