swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
		// 16352 bytes is the max size of enl could set!
		while (enl > 16352) {
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)message, 16352);
			srcdesc.d.enl = 16352;
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)message);

			message += 16352;
			enl -= 16352;
			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		}

		//Cut off valid msg of last_cache_line
		//It means leave 32 bytes alignment addr of msg_body
		// message aligned body
		if (enl > (uint32_t)(last_cache_len)) {
			uint32_t dst_len = enl - (uint32_t)(last_cache_len);

			// assert
			if ((dst_len & 0x1F) != 0) {
				DBG_CRYPTO_INFO("Strange : enl(%d), last_cache_len(%d)", enl, last_cache_len);
				return _ERRNO_CRYPTO_CACHE_HANDLE;
			}

			DBG_CRYPTO_INFO("[Set src_desc_data] dst_len = %d\r\n", dst_len);
			srcdesc.d.enl = dst_len;
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)message, srcdesc.d.enl);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, message, msglen, "src_data[msg_32align_body]: ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)message);
			message += dst_len;
			enl -= dst_len;

			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		} else if (enl < (uint32_t)(last_cache_len)) {
			// can change to use assert function
			DBG_CRYPTO_INFO("Strange : enl(%d), last_cache_len(%d)", enl, last_cache_len);
			return _ERRNO_CRYPTO_CACHE_HANDLE;
		}

		if (last_cache_len == 32) {
			if (pcrypto_adapter->apl == 0) {
				srcdesc.d.ls = 1;
			}
			srcdesc.d.enl = 32;
			__dbg_mem_dump(pcrypto_adapter->isMemDump, message, 32, "src_data[last_cache_len_equal_32]: ");
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)message, 32);
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)message);
		} else if (last_cache_len != 0)  {
			rtlc_memcpy((void *)(pcrypto_adapter->src_last_cache_line), (const void *)(message), last_cache_len);
			DBG_CRYPTO_INFO("[Set src_desc_data] l_cache_len(below 32) = %d\r\n", last_cache_len);
			if (pcrypto_adapter->apl == 0) {
				srcdesc.d.ls = 1;
			}
			srcdesc.d.enl = last_cache_len;
			__dbg_mem_dump(pcrypto_adapter->isMemDump, pcrypto_adapter->src_last_cache_line, last_cache_len, "src_data[last_cache_len_below_32]: ");
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pcrypto_adapter->src_last_cache_line, 32);
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)pcrypto_adapter->src_last_cache_line);
		}

		if (pcrypto_adapter->apl != 0) {
			DBG_CRYPTO_INFO("[Set src_desc_data] pcrypto_adapter->apl = %d\r\n", pcrypto_adapter->apl);
			srcdesc.w = 0;
			srcdesc.d.rs  = 1;
			srcdesc.d.enl = pcrypto_adapter->apl;
			srcdesc.d.ls  = 1;
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)padding, 64);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, padding, srcdesc.d.enl, "src_data padding ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)padding);
		}
	}

	ret = hal_rtl_crypto_engine_wait_done(pcrypto_adapter);

	//__dbg_mem_dump(pcrypto_adapter->isMemDump,pcrypto_adapter->temp_digest_result, 32, "wait temp_digest_result: ");
	__dbg_mem_dump(pcrypto_adapter->isMemDump, pcrypto_adapter->digest_result_SHA512, 32, "wait digest_result: ");

	if (pcrypto_adapter->is_wb == 1) {
		rtlc_memcpy((void *)(pcrypto_adapter->SHIVL_buff), (const void *)(pcrypto_adapter->temp_digest_result), 32);
		//pcrypto_adapter->SHIVL_len = 32/4;
		//__dbg_mem_dump(pcrypto_adapter->isMemDump, pcrypto_adapter->SHIVL_buff, 32, "pcrypto_adapter->SHIVL_buff: ");
	}


	return ret;
}
#endif

/**
 *  \fn          void hal_crypto_engine_get_result_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, u8 *pDigest, u8 *pResult,
 *                                                          uint32_t len, u8 *pTag)
 *  \brief       Get crypto cipher result/authetication digest or crypto cipher tag.
 *  \note        For normal mode
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   len Crypto cipher message buffer length
 *  \param[out]  pDigest Pointer to authentication digest buffer
 *  \param[out]  pResult Pointer to crypto cipher result buffer
 *  \param[out]  pTag Pointer to crypto cipher Tag buffer
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_engine_get_result(hal_crypto_adapter_t *pcrypto_adapter, u8 *pDigest, u8 *pResult, uint32_t len, u8 *pTag)
{
	if (pcrypto_adapter->auth_type != AUTH_TYPE_NO_AUTH) {
		if ((pcrypto_adapter->sha2type == SHA2_384) || (pcrypto_adapter->sha2type == SHA2_512)) {
			arch_invalidate_dcache_by_size(pcrypto_adapter, (uint32_t)(pcrypto_adapter->digest_result_SHA512), 64);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, pcrypto_adapter->digest_result_SHA512, 64, "digest_result: ");
			rtlc_memcpy((void *)(pDigest), (const void *)(pcrypto_adapter->digest_result_SHA512), pcrypto_adapter->digestlen);
		} else {
			arch_invalidate_dcache_by_size(pcrypto_adapter, (uint32_t)(pcrypto_adapter->digest_result), 32);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, pcrypto_adapter->digest_result, 32, "digest_result: ");
			rtlc_memcpy((void *)(pDigest), (const void *)(pcrypto_adapter->digest_result), pcrypto_adapter->digestlen);
		}
	} else {

		uint32_t dst_len = 0;
		uint32_t first_cache_pos = 0;
		uint32_t first_cache_len = 0;
		uint32_t last_cache_pos  = 0;
		uint32_t last_cache_len  = 0;

		first_cache_pos = (uint32_t)(pResult) & 0x1F;
		first_cache_len = (32 - first_cache_pos) % 32;
		if (first_cache_len >= len) { // the same one
			first_cache_len = len;
			last_cache_len  = 0;
		} else {
			last_cache_pos = ((uint32_t)(pResult) + len - 1) & 0x1F;
			last_cache_len = last_cache_pos + 1;
			if (last_cache_len == 32) {
				last_cache_len = 0;
			}
		}

		DBG_CRYPTO_INFO("[Get cipher_result] f_cache_pos = %d,f_cache_len = %d\r\n", first_cache_pos, first_cache_len);
		DBG_CRYPTO_INFO("[Get cipher_result] l_cache_pos = %d,l_cache_len = %d\r\n", last_cache_pos, last_cache_len);

		if (pcrypto_adapter->is_dst_first_cache_used != 0) {
			arch_invalidate_dcache_by_size(pcrypto_adapter, (uint32_t)(pcrypto_adapter->dst_first_cache_line), 32);
			rtlc_memcpy((void *)(pResult), (const void *)(pcrypto_adapter->dst_first_cache_line), first_cache_len);
			dst_len += first_cache_len;
		}

