swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
		//32 byte aligned msg body which doesn't need memcpy
		if (len > (dst_len + last_cache_len)) {
			DBG_CRYPTO_INFO("[Get cipher_result] msg_body_len = %d\r\n", (len - dst_len - last_cache_len));
			//rtl_printf("arch_invalidate - %d \r\n", (len-dst_len-last_cache_len));
			arch_invalidate_dcache_by_size(pcrypto_adapter, (uint32_t)(pResult) + dst_len, (len - dst_len - last_cache_len));
		}

		//Handle last_cache_line
		dst_len = len - last_cache_len;
		if (pcrypto_adapter->is_dst_last_cache_used != 0) {
			arch_invalidate_dcache_by_size(pcrypto_adapter, (uint32_t)(pcrypto_adapter->dst_last_cache_line), 32);
			rtlc_memcpy((void *)(pResult + dst_len), (const void *)(pcrypto_adapter->dst_last_cache_line), last_cache_len);
		}
	}
	if (pTag != NULL) {
		arch_invalidate_dcache_by_size(pcrypto_adapter, (uint32_t)(pcrypto_adapter->tag_result), sizeof(pcrypto_adapter->tag_result));
		rtlc_memcpy((void *)pTag, (const void *)(pcrypto_adapter->tag_result), 16);
	}
}

#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_engine_get_result_SHA512(hal_crypto_adapter_t *pcrypto_adapter, u8 *pDigest, u8 *pResult, uint32_t len, u8 *pTag)
{
	if (pcrypto_adapter->auth_type != AUTH_TYPE_NO_AUTH) {
		arch_invalidate_dcache_by_size(pcrypto_adapter, (uint32_t)(pcrypto_adapter->digest_result_SHA512), 64);
		__dbg_mem_dump(pcrypto_adapter->isMemDump, pcrypto_adapter->digest_result_SHA512, 64, "digest_result: ");
		rtlc_memcpy((void *)(pDigest), (const void *)(pcrypto_adapter->digest_result_SHA512), pcrypto_adapter->digestlen);
	} else {

		uint32_t dst_len = 0;
		uint32_t first_cache_pos = 0;
		uint32_t first_cache_len = 0;
		uint32_t last_cache_pos  = 0;
		uint32_t last_cache_len  = 0;

		first_cache_pos = (uint32_t)(pResult) & 0x1F;
		first_cache_len = (32 - first_cache_pos) % 32;
		if (first_cache_len >= len) { // the same one
			first_cache_len = len;
			last_cache_len  = 0;
		} else {
			last_cache_pos = ((uint32_t)(pResult) + len - 1) & 0x1F;
			last_cache_len = last_cache_pos + 1;
			if (last_cache_len == 32) {
				last_cache_len = 0;
			}
		}

		DBG_CRYPTO_INFO("[Get cipher_result] f_cache_pos = %d,f_cache_len = %d\r\n", first_cache_pos, first_cache_len);
		DBG_CRYPTO_INFO("[Get cipher_result] l_cache_pos = %d,l_cache_len = %d\r\n", last_cache_pos, last_cache_len);

		if (pcrypto_adapter->is_dst_first_cache_used != 0) {
			arch_invalidate_dcache_by_size(pcrypto_adapter, (uint32_t)(pcrypto_adapter->dst_first_cache_line), 32);
			rtlc_memcpy((void *)(pResult), (const void *)(pcrypto_adapter->dst_first_cache_line), first_cache_len);
			dst_len += first_cache_len;
		}

		//32 byte aligned msg body which doesn't need memcpy
		if (len > (dst_len + last_cache_len)) {
			DBG_CRYPTO_INFO("[Get cipher_result] msg_body_len = %d\r\n", (len - dst_len - last_cache_len));
			//rtl_printf("arch_invalidate - %d \r\n", (len-dst_len-last_cache_len));
			arch_invalidate_dcache_by_size(pcrypto_adapter, (uint32_t)(pResult) + dst_len, (len - dst_len - last_cache_len));
		}

		//Handle last_cache_line
		dst_len = len - last_cache_len;
		if (pcrypto_adapter->is_dst_last_cache_used != 0) {
			arch_invalidate_dcache_by_size(pcrypto_adapter, (uint32_t)(pcrypto_adapter->dst_last_cache_line), 32);
			rtlc_memcpy((void *)(pResult + dst_len), (const void *)(pcrypto_adapter->dst_last_cache_line), last_cache_len);
		}
	}
	if (pTag != NULL) {
		arch_invalidate_dcache_by_size(pcrypto_adapter, (uint32_t)(pcrypto_adapter->tag_result), sizeof(pcrypto_adapter->tag_result));
		rtlc_memcpy((void *)pTag, (const void *)(pcrypto_adapter->tag_result), 16);
	}
}
#endif

#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_send_seq_buf(hal_crypto_adapter_t *pcrypto_adapter, u8 *pDigest)
{
	int ret = SUCCESS;
	//const u8 *pIV     = NULL;
	//const u32 ivlen = 0;
	//const u32 a2eo    = 0;

	int total_len  = pcrypto_adapter->hmac_seq_last_msglen; // 64
	int buf_pos    = pcrypto_adapter->hmac_seq_buf_is_used_bytes; // 0
	int rest_bytes = (64 - buf_pos); // 64
	int bodylen, restlen;

	DBG_CRYPTO_INFO("[SEQ_BUF] total_len = %d, buf_pos = %d, rest_bytes = %d\r\n", total_len, buf_pos, rest_bytes);
	if (pDigest != NULL) { // Make sure it's called from final api
		if (pcrypto_adapter->hmac_seq_buf_is_used_bytes > 0) { // last one put into cryptoEngine, may need to pad 16bytes aligned msglen
			ret = hal_rtl_crypto_engine(pcrypto_adapter, (u8 *)(pcrypto_adapter->hmac_seq_buf), pcrypto_adapter->hmac_seq_buf_is_used_bytes, NULL, 0, NULL, 0, pDigest,
										NULL);
		}
		pcrypto_adapter->hmac_seq_buf_is_used_bytes = 0;
	} else {
		if (rest_bytes == 0) { // There's no enough space for seq_buf
			ret = hal_rtl_crypto_engine(pcrypto_adapter, (u8 *)(pcrypto_adapter->hmac_seq_buf), 64, NULL, 0, NULL, 0, NULL, NULL);
			if (ret != SUCCESS) {
				DBG_CRYPTO_ERR("Handle rest_bytes = 0 fail\r\n");
				return ret;
			}
			pcrypto_adapter->hmac_seq_buf_is_used_bytes = 0;
			buf_pos = 0;
			rest_bytes = (64 - buf_pos);
		}

		// There's an enough space of seq_buf for total_len
		if (total_len < rest_bytes) {
			rtlc_memcpy((void *)(&pcrypto_adapter->hmac_seq_buf[buf_pos]), (const void *)(pcrypto_adapter->hmac_seq_last_message), total_len);
			pcrypto_adapter->hmac_seq_buf_is_used_bytes += total_len;
		} else {
			/***********************************************************
			 * send out all the hmac_seq_last_message or store into buf
			 ***********************************************************/
			if ((total_len - rest_bytes) == 0) {
				// Make up seq_buf, leve next round to handle full data of seq_buf
				rtlc_memcpy((void *)(&pcrypto_adapter->hmac_seq_buf[buf_pos]), (const void *)(pcrypto_adapter->hmac_seq_last_message), rest_bytes);

				pcrypto_adapter->hmac_seq_buf_is_used_bytes = 64;
				total_len -= rest_bytes; //
				if (total_len == 0) {
					pcrypto_adapter->hmac_seq_last_msglen = total_len;
					pcrypto_adapter->hmac_seq_last_message = NULL;
				} else {
					DBG_CRYPTO_ERR("seq_hash wrong length 1: total_len = %d, rest_bytes = %d\r\n", total_len, rest_bytes);
					return _ERRNO_CRYPTO_HASH_SEQUENTIAL_HASH_WORNG_LENGTH;
				}
			} else if ((total_len - rest_bytes) > 0) { // 65-64 = 1
				// Make up seq_buf
				rtlc_memcpy((void *)(&pcrypto_adapter->hmac_seq_buf[buf_pos]), (const void *)(pcrypto_adapter->hmac_seq_last_message), rest_bytes);
				ret = hal_rtl_crypto_engine(pcrypto_adapter, (u8 *)(pcrypto_adapter->hmac_seq_buf), 64, NULL, 0, NULL, 0, NULL, NULL);
				if (ret != SUCCESS) {
					return ret;
				}

