swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
					pcrypto_adapter->hmac_seq_buf_is_used_bytes = 0;
					buf_pos = 0;

					total_len -= rest_bytes; // 129 - 64 = 65
					pcrypto_adapter->hmac_seq_last_msglen = total_len; // 65
					pcrypto_adapter->hmac_seq_last_message += rest_bytes;

					// message(distinguish restlen[non_64bytes aligned] & bodylen[64bytes aligned])
					restlen = total_len & mask_seq_buf_size; //
					bodylen = total_len - restlen; // exceed 64 ?
					DBG_CRYPTO_INFO("[SEQ_BUF] total_len = %d, bodylen = %d, restlen = %d\r\n", total_len, bodylen, restlen);
					if ((bodylen == 0) && (restlen > 0)) { // there are only restlen, leave next round to handle seq_buf
						rtlc_memcpy((void *)(&p_hmac_seq_buf[0]), (const void *)(pcrypto_adapter->hmac_seq_last_message), restlen);
						total_len -= restlen;
						if (total_len == 0) {
							pcrypto_adapter->hmac_seq_last_msglen = total_len;
							pcrypto_adapter->hmac_seq_last_message = NULL;
							pcrypto_adapter->hmac_seq_buf_is_used_bytes = restlen;
						} else {
							DBG_CRYPTO_ERR("seq_hash wrong length 2: total_len = %d, bodylen = %d, restlen = %d\r\n", total_len, bodylen, restlen);
							return _ERRNO_CRYPTO_HASH_SEQUENTIAL_HASH_WORNG_LENGTH;
						}
					} else if ((bodylen > 0) && (restlen > 0)) { // there are 64x messages and restlen, leave next round to handle restlen
						ret = hal_rtl_crypto_engine(pcrypto_adapter, pcrypto_adapter->hmac_seq_last_message, bodylen, NULL, 0, NULL, 0, NULL, NULL);
						if (ret != SUCCESS) {
							return ret;
						}
						pcrypto_adapter->hmac_seq_last_message += bodylen;
						total_len -= bodylen;

						// backup the rest into seq_buf, leave next round to handle it
						rtlc_memcpy((void *)(&p_hmac_seq_buf[0]), (const void *)(pcrypto_adapter->hmac_seq_last_message), restlen);
						total_len -= restlen;
						if (total_len == 0) {
							pcrypto_adapter->hmac_seq_last_msglen = total_len;
							pcrypto_adapter->hmac_seq_last_message = NULL;
							pcrypto_adapter->hmac_seq_buf_is_used_bytes = restlen;
						} else {
							DBG_CRYPTO_ERR("seq_hash wrong length 3: total_len = %d, bodylen = %d, restlen = %d\r\n", total_len, bodylen, restlen);
							return _ERRNO_CRYPTO_HASH_SEQUENTIAL_HASH_WORNG_LENGTH;
						}
					} else if ((bodylen == seq_buf_size) && (restlen == 0)) {
						// there are only 64byte message, backup the bodylen into seq_buf, leave next round to handle it
						rtlc_memcpy((void *)(&p_hmac_seq_buf[0]), (const void *)(pcrypto_adapter->hmac_seq_last_message), bodylen);
						total_len -= bodylen;
						if (total_len == 0) {
							pcrypto_adapter->hmac_seq_last_msglen = total_len;
							pcrypto_adapter->hmac_seq_last_message = NULL;
							pcrypto_adapter->hmac_seq_buf_is_used_bytes = bodylen;
						} else {
							DBG_CRYPTO_ERR("seq_hash wrong length 4: total_len = %d, bodylen = %d, restlen = %d\r\n", total_len, bodylen, restlen);
							return _ERRNO_CRYPTO_HASH_SEQUENTIAL_HASH_WORNG_LENGTH;
						}
					} else if ((bodylen > seq_buf_size) && (restlen == 0)) { // there are only 64x messages, leave next round to handle full data of seq_buf
						ret = hal_rtl_crypto_engine(pcrypto_adapter, pcrypto_adapter->hmac_seq_last_message, (bodylen - seq_buf_size), NULL, 0, NULL, 0, NULL, NULL);
						if (ret != SUCCESS) {
							return ret;
						}
						pcrypto_adapter->hmac_seq_last_message += (bodylen - seq_buf_size);

						// backup the rest into seq_buf, leave next round to handle it
						total_len -= (bodylen - seq_buf_size);
						pcrypto_adapter->hmac_seq_last_msglen = total_len;

						if (total_len == seq_buf_size) {
							rtlc_memcpy((void *)(&p_hmac_seq_buf[0]), (const void *)(pcrypto_adapter->hmac_seq_last_message), total_len);
							pcrypto_adapter->hmac_seq_last_msglen = (total_len - seq_buf_size);
							pcrypto_adapter->hmac_seq_last_message = NULL;
							pcrypto_adapter->hmac_seq_buf_is_used_bytes = seq_buf_size;
						} else {
							DBG_CRYPTO_ERR("seq_hash wrong length 5: total_len = %d, bodylen = %d, restlen = %d\r\n", total_len, bodylen, restlen);
							return _ERRNO_CRYPTO_HASH_SEQUENTIAL_HASH_WORNG_LENGTH;
						}
					}
				}
			}
		}
	}
	return ret;
}
#endif

#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_send_seq_buf_SHA512(hal_crypto_adapter_t *pcrypto_adapter, u8 *pDigest)
{
	int ret = SUCCESS;
	//const u8 *pIV     = NULL;
	//const u32 ivlen = 0;
	//const u32 a2eo    = 0;

	int total_len  = pcrypto_adapter->hmac_seq_last_msglen; // 256
	int buf_pos    = pcrypto_adapter->hmac_seq_buf_is_used_bytes; // 0
	int rest_bytes = (128 - buf_pos); // 128
	int bodylen, restlen;

	DBG_CRYPTO_INFO("[SEQ_BUF] total_len = %d, buf_pos = %d, rest_bytes = %d\r\n", total_len, buf_pos, rest_bytes);
	if (pDigest != NULL) { // Make sure it's called from final api
		if (pcrypto_adapter->hmac_seq_buf_is_used_bytes > 0) { // last one put into cryptoEngine, may need to pad 16bytes aligned msglen
			ret = hal_rtl_crypto_engine_SHA512(pcrypto_adapter, (u8 *)(pcrypto_adapter->hmac_seq_buf_SHA512), pcrypto_adapter->hmac_seq_buf_is_used_bytes, NULL, 0, NULL, 0,
											   pDigest, NULL);
		}
		pcrypto_adapter->hmac_seq_buf_is_used_bytes = 0;
	} else {
		if (rest_bytes == 0) { // There's no enough space for seq_buf
			ret = hal_rtl_crypto_engine_SHA512(pcrypto_adapter, (u8 *)(pcrypto_adapter->hmac_seq_buf_SHA512), 128, NULL, 0, NULL, 0, NULL, NULL);
			if (ret != SUCCESS) {
				DBG_CRYPTO_ERR("Handle rest_bytes = 0 fail\r\n");
				return ret;
			}
			pcrypto_adapter->hmac_seq_buf_is_used_bytes = 0;
			buf_pos = 0;
			rest_bytes = (128 - buf_pos);
		}

		// There's an enough space of seq_buf for total_len
		if (total_len < rest_bytes) {
			rtlc_memcpy((void *)(&pcrypto_adapter->hmac_seq_buf_SHA512[buf_pos]), (const void *)(pcrypto_adapter->hmac_seq_last_message), total_len);
			pcrypto_adapter->hmac_seq_buf_is_used_bytes += total_len;
		} else {
			/***********************************************************
			 * send out all the hmac_seq_last_message or store into buf
			 ***********************************************************/
			if ((total_len - rest_bytes) == 0) {
				// Make up seq_buf, leve next round to handle full data of seq_buf
				rtlc_memcpy((void *)(&pcrypto_adapter->hmac_seq_buf_SHA512[buf_pos]), (const void *)(pcrypto_adapter->hmac_seq_last_message), rest_bytes);

