swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
				pcrypto_adapter->hmac_seq_buf_is_used_bytes = 128;
				total_len -= rest_bytes; //
				if (total_len == 0) {
					pcrypto_adapter->hmac_seq_last_msglen = total_len;
					pcrypto_adapter->hmac_seq_last_message = NULL;
				} else {
					DBG_CRYPTO_ERR("seq_hash wrong length 1: total_len = %d, rest_bytes = %d\r\n", total_len, rest_bytes);
					return _ERRNO_CRYPTO_HASH_SEQUENTIAL_HASH_WORNG_LENGTH;
				}
			} else if ((total_len - rest_bytes) > 0) { // 256-128 >0
				// Make up seq_buf
				rtlc_memcpy((void *)(&pcrypto_adapter->hmac_seq_buf_SHA512[buf_pos]), (const void *)(pcrypto_adapter->hmac_seq_last_message), rest_bytes);
				ret = hal_rtl_crypto_engine_SHA512(pcrypto_adapter, (u8 *)(pcrypto_adapter->hmac_seq_buf_SHA512), 128, NULL, 0, NULL, 0, NULL, NULL);
				if (ret != SUCCESS) {
					return ret;
				}

				pcrypto_adapter->hmac_seq_buf_is_used_bytes = 0;
				buf_pos = 0;

				total_len -= rest_bytes; // 129 - 64 = 65
				pcrypto_adapter->hmac_seq_last_msglen = total_len; // 65
				pcrypto_adapter->hmac_seq_last_message += rest_bytes;

				// message(distinguish restlen[non_64bytes aligned] & bodylen[64bytes aligned])
				restlen = total_len & 0x7F; //
				bodylen = total_len - restlen; // exceed 64 ?
				DBG_CRYPTO_INFO("[SEQ_BUF] total_len = %d, bodylen = %d, restlen = %d\r\n", total_len, bodylen, restlen);
				if ((bodylen == 0) && (restlen > 0)) { // there are only restlen, leave next round to handle seq_buf
					rtlc_memcpy((void *)(&pcrypto_adapter->hmac_seq_buf_SHA512[0]), (const void *)(pcrypto_adapter->hmac_seq_last_message), restlen);
					total_len -= restlen;
					if (total_len == 0) {
						pcrypto_adapter->hmac_seq_last_msglen = total_len;
						pcrypto_adapter->hmac_seq_last_message = NULL;
						pcrypto_adapter->hmac_seq_buf_is_used_bytes = restlen;
					} else {
						DBG_CRYPTO_ERR("seq_hash wrong length 2: total_len = %d, bodylen = %d, restlen = %d\r\n", total_len, bodylen, restlen);
						return _ERRNO_CRYPTO_HASH_SEQUENTIAL_HASH_WORNG_LENGTH;
					}
				} else if ((bodylen > 0) && (restlen > 0)) { // there are 64x messages and restlen, leave next round to handle restlen
					ret = hal_rtl_crypto_engine_SHA512(pcrypto_adapter, pcrypto_adapter->hmac_seq_last_message, bodylen, NULL, 0, NULL, 0, NULL, NULL);
					if (ret != SUCCESS) {
						return ret;
					}
					pcrypto_adapter->hmac_seq_last_message += bodylen;
					total_len -= bodylen;

					// backup the rest into seq_buf, leave next round to handle it
					rtlc_memcpy((void *)(&pcrypto_adapter->hmac_seq_buf_SHA512[0]), (const void *)(pcrypto_adapter->hmac_seq_last_message), restlen);
					total_len -= restlen;
					if (total_len == 0) {
						pcrypto_adapter->hmac_seq_last_msglen = total_len;
						pcrypto_adapter->hmac_seq_last_message = NULL;
						pcrypto_adapter->hmac_seq_buf_is_used_bytes = restlen;
					} else {
						DBG_CRYPTO_ERR("seq_hash wrong length 3: total_len = %d, bodylen = %d, restlen = %d\r\n", total_len, bodylen, restlen);
						return _ERRNO_CRYPTO_HASH_SEQUENTIAL_HASH_WORNG_LENGTH;
					}
				} else if ((bodylen == 128) && (restlen == 0)) {
					// there are only 64byte message, backup the bodylen into seq_buf, leave next round to handle it
					rtlc_memcpy((void *)(&pcrypto_adapter->hmac_seq_buf_SHA512[0]), (const void *)(pcrypto_adapter->hmac_seq_last_message), bodylen);
					total_len -= bodylen;
					if (total_len == 0) {
						pcrypto_adapter->hmac_seq_last_msglen = total_len;
						pcrypto_adapter->hmac_seq_last_message = NULL;
						pcrypto_adapter->hmac_seq_buf_is_used_bytes = bodylen;
					} else {
						DBG_CRYPTO_ERR("seq_hash wrong length 4: total_len = %d, bodylen = %d, restlen = %d\r\n", total_len, bodylen, restlen);
						return _ERRNO_CRYPTO_HASH_SEQUENTIAL_HASH_WORNG_LENGTH;
					}
				} else if ((bodylen > 128) && (restlen == 0)) { // there are only 64x messages, leave next round to handle full data of seq_buf
					ret = hal_rtl_crypto_engine_SHA512(pcrypto_adapter, pcrypto_adapter->hmac_seq_last_message, (bodylen - 128), NULL, 0, NULL, 0, NULL, NULL);
					if (ret != SUCCESS) {
						return ret;
					}
					pcrypto_adapter->hmac_seq_last_message += (bodylen - 128);

					// backup the rest into seq_buf, leave next round to handle it
					total_len -= (bodylen - 128);
					pcrypto_adapter->hmac_seq_last_msglen = total_len;

					if (total_len == 128) {
						rtlc_memcpy((void *)(&pcrypto_adapter->hmac_seq_buf_SHA512[0]), (const void *)(pcrypto_adapter->hmac_seq_last_message), total_len);
						pcrypto_adapter->hmac_seq_last_msglen = (total_len - 128);
						pcrypto_adapter->hmac_seq_last_message = NULL;
						pcrypto_adapter->hmac_seq_buf_is_used_bytes = 128;
					} else {
						DBG_CRYPTO_ERR("seq_hash wrong length 5: total_len = %d, bodylen = %d, restlen = %d\r\n", total_len, bodylen, restlen);
						return _ERRNO_CRYPTO_HASH_SEQUENTIAL_HASH_WORNG_LENGTH;
					}
				}
			}
		}
	}
	return ret;
}
#endif

/**
 *  \fn          void hal_crypto_engine_set_encrypt_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter)
 *  \brief       Set encrypt information in crypto adapter data.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_engine_set_encrypt(hal_crypto_adapter_t *pcrypto_adapter)
{
	pcrypto_adapter->cipher_type |= CIPHER_TYPE_MODE_ENCRYPT;
	pcrypto_adapter->isDecrypt = _FALSE;
}

/**
 *  \fn          void hal_crypto_engine_set_decrypt_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter)
 *  \brief       Set decrypt information in crypto adapter data.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_engine_set_decrypt(hal_crypto_adapter_t *pcrypto_adapter)
{
	pcrypto_adapter->cipher_type ^= CIPHER_TYPE_MODE_ENCRYPT;
	pcrypto_adapter->isDecrypt = _TRUE;
}

/**
 *  \fn          int hal_crypto_cipher_process_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
 *                                                      IN const u8 isEncrypt,  IN const u32 cipher_type,
 *                                                      IN const u8 *message,   IN const u32 msglen,
 *                                                      IN const u8 *iv,        IN const u32 ivlen,
 *                                                      IN const u8 *aad,       IN const u32 aadlen,
 *                                                      OUT u8 *pResult,        OUT u8 *pTag)
 *  \brief       Check input parameters which cipher needs, and make crypto engine encrypt the plaintext or decrypt the ciphertext.
 *               After that, get the cipher result.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   isEncrypt Indicate that crypto engine now is processing encryption or decryption
 *  \param[in]   cipher_type  Cipher type ID
 *  \param[in]   message Pointer to Crypto cipher message buffer
 *  \param[in]   msglen Crypto cipher message buffer length
 *  \param[in]   iv Pointer to Crypto cipher initial vector buffer
 *  \param[in]   ivlen Crypto cipher initial vector buffer length
 *  \param[in]   aad Pointer to Crypto cipher additional authentication buffer
 *  \param[in]   aadlen Crypto cipher additional authentication buffer length
 *  \param[out]  pResult Pointer to Crypto cipher result buffer
 *  \param[out]  pTag Pointer to Crypto cipher Tag buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_cipher_process(hal_crypto_adapter_t *pcrypto_adapter,
								  IN const u8 isEncrypt,  IN const u32 cipher_type,
								  IN const u8 *message,   IN const u32 msglen,
								  IN const u8 *iv,        IN const u32 ivlen,
								  IN const u8 *aad,       IN const u32 aadlen,
								  OUT u8 *pResult,        OUT u8 *pTag)
{
	int ret = SUCCESS;
	u32 count_be;
	u8  count_str[4];

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(iv) & 0x1f) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if ((u32)(aad) & 0x1f) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}

	do {
		if (pcrypto_adapter->isInit != _TRUE) {
			ret = _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
			break;
		}

		if (message == NULL) {
			DBG_CRYPTO_ERR("message is null pointer\r\n");
			ret = _ERRNO_CRYPTO_NULL_POINTER;
			break;
		}

