swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
		if (CIPHER_TYPE_FUNC_AES == (cipher_type & CIPHER_TYPE_MASK_FUNC)) { //AES
			if (CIPHER_TYPE_AES_GHASH == cipher_type) {
				if (pTag == NULL) {
					DBG_CRYPTO_ERR("pTag is null pointer\r\n");
					ret = _ERRNO_CRYPTO_NULL_POINTER;
					break;
				}
			} else if (CIPHER_TYPE_AES_GMAC == cipher_type) {
				if (pTag == NULL) {
					DBG_CRYPTO_ERR("pTag is null pointer\r\n");
					ret = _ERRNO_CRYPTO_NULL_POINTER;
					break;
				}
			} else {
				DBG_CRYPTO_INFO("msglen non_16_aligned %d bytes\r\n", (msglen % 16));
				if (((msglen % 16) != 0) && (!isEncrypt)) {
					ret = _ERRNO_CRYPTO_AES_MSGLEN_NOT_16Byte_Aligned;
					break;
				}
				if (pResult == NULL) {
					DBG_CRYPTO_ERR("pResult is null pointer\r\n");
					ret = _ERRNO_CRYPTO_NULL_POINTER;
					break;
				}
				if (CIPHER_TYPE_AES_GCM == cipher_type) {
					if (pTag == NULL) {
						DBG_CRYPTO_ERR("pTag is null pointer\r\n");
						ret = _ERRNO_CRYPTO_NULL_POINTER;
						break;
					}
				}
			}
		}

		if ((CIPHER_TYPE_FUNC_DES == (cipher_type & CIPHER_TYPE_MASK_FUNC)) || (CIPHER_TYPE_FUNC_3DES == (cipher_type & CIPHER_TYPE_MASK_FUNC))) {
			DBG_CRYPTO_INFO("msglen non_8_aligned %d bytes\r\n", (msglen % 8));
			if (((msglen % 8) != 0) && (!isEncrypt)) {
				ret = _ERRNO_CRYPTO_DES_MSGLEN_NOT_8Byte_Aligned;
				break;
			}
		}

		if ((cipher_type & CIPHER_TYPE_MASK_FUNC) == CIPHER_TYPE_FUNC_CHACHA) {
			if (cipher_type == CIPHER_TYPE_POLY1305) {
				if (pTag == NULL) {
					DBG_CRYPTO_ERR("pTag is null pointer\r\n");
					ret = _ERRNO_CRYPTO_NULL_POINTER;
					break;
				}
			} else {
				if (pResult == NULL) {
					DBG_CRYPTO_ERR("pResult is null pointer\r\n");
					ret = _ERRNO_CRYPTO_NULL_POINTER;
					break;
				}
				if (cipher_type == CIPHER_TYPE_CHACHA_POLY1305) {
					if (pTag == NULL) {
						DBG_CRYPTO_ERR("pTag is null pointer\r\n");
						ret = _ERRNO_CRYPTO_NULL_POINTER;
						break;
					}
				}
			}
		}

		if (CIPHER_TYPE_AES_GCM == cipher_type) {
			rtlc_memcpy((void *)(pcrypto_adapter->gcm_iv), (const void *)(iv), 96 / 8);
			rtlc_memcpy((void *)(&(pcrypto_adapter->gcm_iv)[12]), (const void *)(gcm_iv_tail), 4);

			if (isEncrypt) {
				hal_rtl_crypto_engine_set_encrypt(pcrypto_adapter);
				ret = hal_rtl_crypto_engine(pcrypto_adapter, message, msglen,
											(u8 *)(pcrypto_adapter->gcm_iv), 16, aad, aadlen, pResult, pTag);
			} else {
				hal_rtl_crypto_engine_set_decrypt(pcrypto_adapter);
				ret = hal_rtl_crypto_engine(pcrypto_adapter, message, msglen,
											(u8 *)(pcrypto_adapter->gcm_iv), 16, aad, aadlen, pResult, pTag);
			}
		} else if (CIPHER_TYPE_AES_GCTR == cipher_type) {
			rtlc_memcpy((void *)(pcrypto_adapter->gcm_iv), (const void *)(iv), 96 / 8);
			rtlc_memcpy((void *)(&(pcrypto_adapter->gcm_iv)[12]), (const void *)(gcm_iv_tail), 4);

			if (isEncrypt) {
				hal_rtl_crypto_engine_set_encrypt(pcrypto_adapter);
				ret = hal_rtl_crypto_engine(pcrypto_adapter, message, msglen,
											(u8 *)(pcrypto_adapter->gcm_iv), 16, NULL, 0, pResult, NULL);
			} else {
				hal_rtl_crypto_engine_set_decrypt(pcrypto_adapter);
				ret = hal_rtl_crypto_engine(pcrypto_adapter, message, msglen,
											(u8 *)(pcrypto_adapter->gcm_iv), 16, NULL, 0, pResult, NULL);
			}
		} else if (CIPHER_TYPE_AES_GHASH == cipher_type) {
			hal_rtl_crypto_engine_set_decrypt(pcrypto_adapter);
			ret = hal_rtl_crypto_engine(pcrypto_adapter, message, msglen, iv, ivlen, NULL, 0, pResult, pTag);
		} else if (CIPHER_TYPE_AES_GMAC == cipher_type) {
			rtlc_memcpy((void *)(pcrypto_adapter->gcm_iv), (const void *)(iv), 96 / 8);
			rtlc_memcpy((void *)(&(pcrypto_adapter->gcm_iv)[12]), (const void *)(gcm_iv_tail), 4);
			hal_rtl_crypto_engine_set_decrypt(pcrypto_adapter);
			ret = hal_rtl_crypto_engine(pcrypto_adapter, message, msglen,
										(u8 *)(pcrypto_adapter->gcm_iv), 16, aad, aadlen, NULL, pTag);
		} else if (cipher_type == CIPHER_TYPE_CHACHA) {
			count_be = ivlen;
			__rtl_cpu_to_be32(count_be);
			rtlc_memcpy((void *)count_str, (const void *)(&count_be), sizeof(u32));
			rtlc_memcpy((void *)(&(pcrypto_adapter->gcm_iv)[0]), count_str, 4);
			rtlc_memcpy((void *)(&(pcrypto_adapter->gcm_iv)[4]), iv, 96 / 8);

			if (isEncrypt) {
				//ret = __rtl_crypto_cipher_encrypt(pcrypto_adapter, message, msglen, (u8*)(pcrypto_adapter->gcm_iv), 16, NULL, 0, pResult, NULL);
				hal_rtl_crypto_engine_set_encrypt(pcrypto_adapter);
				ret = hal_rtl_crypto_engine(pcrypto_adapter, message, msglen, (u8 *)(pcrypto_adapter->gcm_iv), 16, NULL, 0, pResult, NULL);
			} else {
				//ret = __rtl_crypto_cipher_decrypt(pcrypto_adapter, message, msglen, (u8*)(pcrypto_adapter->gcm_iv), 16, NULL, 0, pResult, NULL);
				hal_rtl_crypto_engine_set_decrypt(pcrypto_adapter);
				ret = hal_rtl_crypto_engine(pcrypto_adapter, message, msglen, (u8 *)(pcrypto_adapter->gcm_iv), 16, NULL, 0, pResult, NULL);
			}
		} else if (cipher_type == CIPHER_TYPE_CHACHA_POLY1305) {
			count_be = 1;
			__rtl_cpu_to_be32(count_be);
			rtlc_memcpy((void *)count_str, (const void *)(&count_be), sizeof(u32));
			rtlc_memcpy((void *)(&(pcrypto_adapter->gcm_iv)[0]), count_str, 4);
			rtlc_memcpy((void *)(&(pcrypto_adapter->gcm_iv)[4]), iv, 96 / 8);

			if (isEncrypt) {
				//ret = __rtl_crypto_cipher_encrypt(pcrypto_adapter, message, msglen, (u8*)(pcrypto_adapter->gcm_iv), 16, aad, aadlen, pResult, pTag);
				hal_rtl_crypto_engine_set_encrypt(pcrypto_adapter);
				ret = hal_rtl_crypto_engine(pcrypto_adapter, message, msglen, (u8 *)(pcrypto_adapter->gcm_iv), 16, aad, aadlen, pResult, pTag);
			} else {
				//ret = __rtl_crypto_cipher_decrypt(pcrypto_adapter, message, msglen, (u8*)(pcrypto_adapter->gcm_iv), 16, aad, aadlen, pResult, pTag);
				hal_rtl_crypto_engine_set_decrypt(pcrypto_adapter);
				ret = hal_rtl_crypto_engine(pcrypto_adapter, message, msglen, (u8 *)(pcrypto_adapter->gcm_iv), 16, aad, aadlen, pResult, pTag);
			}
		} else {
			if (isEncrypt) {
				hal_rtl_crypto_engine_set_encrypt(pcrypto_adapter);
			} else {
				hal_rtl_crypto_engine_set_decrypt(pcrypto_adapter);
			}
			ret = hal_rtl_crypto_engine(pcrypto_adapter, message, msglen, iv, ivlen, NULL, 0, pResult, pTag);
			//ret = hal_rom_crypto_engine(pcrypto_adapter, message, msglen, iv, ivlen, NULL, 0, pResult, NULL);
		}

