swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
		if (ret != SUCCESS) {
			break;
		}

		if (isEncrypt) {
			//Encryption may need to modify msglen of destination descriptor,because of padding length
			hal_rtl_crypto_engine_get_result(pcrypto_adapter, NULL, pResult, (msglen + (pcrypto_adapter->apl)), pTag);
		} else {
			hal_rtl_crypto_engine_get_result(pcrypto_adapter, NULL, pResult, msglen, pTag);
		}
	} while (0);

	return ret;
}

/**
 *  \fn          void hal_crypto_engine_reset_rtl8710c(phal_crypto_adapter_t pcrypto_adapter)
 *  \brief       Reset crypto engine DMA arbiter mode, clock, swap setting, endian setting, DMA burst length setting.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_engine_reset(phal_crypto_adapter_t pcrypto_adapter)
{
	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;

	// Crypto engine : Software Reset
	(pcrypto->ipscsr_reset_isr_conf_reg_b.soft_rst) = 0;
	//(pcrypto->ipscsr_reset_isr_conf_reg_b.ipsec_rst) = 1;

#if (LEXRA_BIG_ENDIAN == 1)
	{
		crypto_ipscsr_swap_burst_reg_t val;
		val.w = 0;
		val.b.set_swap = 1;
		//val.b.dma_burst_length = burstSize;
		val.b.dma_burst_length = 16;
		(pcrypto->ipscsr_swap_burst_reg) = val.w;
	}
#else
	{
		crypto_ipscsr_swap_burst_reg_t val;
		val.w = 0;
		val.b.key_iv_swap = 1;
		val.b.key_pad_swap = 1;
		val.b.hash_inital_value_swap = 1;
		val.b.dma_in_little_endian = 1;
		val.b.data_out_little_endian = 1;
		val.b.mac_out_little_endian = 1;
		val.b.dma_burst_length = 16;
		(pcrypto->ipscsr_swap_burst_reg) = val.w;
		//dbg_printf("val %x\r\n", val);
	}
#endif

	// Crypto Engine : DMA arbiter , clock enable
	{
		crypto_ipscsr_debug_reg_t val;

		val.w = 0;
		val.b.arbiter_mode = 1;
		val.b.engine_clk_en = 1;
		//val.b.debug_wb = 1;
		(pcrypto->ipscsr_debug_reg) = val.w;
	}
}

/**
 *  \fn          void hal_crypto_en_ctrl_rtl8710c(int en)
 *  \brief       Enable/Disable the clock of IPsec.
 *  \param[in]   en Set the clock of IPsec state: 1=Enable, 0=Disable
 *  \return      none
 */
#if !defined(CONFIG_BUILD_NONSECURE)
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_en_ctrl(int en)
{
	hal_rtl_sys_peripheral_en(CRYPTO_SYS, en);
	hal_rtl_sys_peripheral_en(LXBUS_SYS, en);

//    u32 val;
//    val = HAL_READ32(0x50000800, 0x9C);
//    val = val | 0xC30000;
//    HAL_WRITE32(0x50000800, 0x9C, val);

}
#endif

/**
 *  \fn          int hal_crypto_engine_init_rtl8710c(phal_crypto_adapter_t pcrypto_adapter)
 *  \brief       Enable the clock and bus related IPsec and reset crypto engine.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_engine_init(phal_crypto_adapter_t pcrypto_adapter)
{
	int ret = SUCCESS;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	pcrypto_adapter->base_addr = CRYPTO_MODULE;

	rtlc_memset((u8 *)(&(pcrypto_adapter->padding[0])), 0x0, CRYPTO_PADSIZE);

	if (INIT_REG_SOMEONE == reg_init) {
		//CRYPTO_ADAPTER = pcrypto_adapter;
		pcrypto_adapter->isInit = 1;
		pcrypto_adapter->isIntMode = 0;
		ret = SUCCESS;
		DBG_CRYPTO_INFO("CryptoEngine initializes: isInit = %d, isIntMode = %d\r\n", pcrypto_adapter->isInit, pcrypto_adapter->isIntMode);
	} else {
		if (!((pcrypto_adapter->initmap) & CHECK_INIT_FROM_HAL)) {
#if !defined(CONFIG_BUILD_NONSECURE)
			hal_rtl_crypto_en_ctrl(ENABLE_PLATFORM);
#endif
		}
		hal_rtl_crypto_engine_reset(pcrypto_adapter);
		pcrypto_adapter->isInit = 1;
		pcrypto_adapter->isIntMode = 0;
		DBG_CRYPTO_INFO("After CryptoEngine reset: isInit = %d, isIntMode = %d\r\n", pcrypto_adapter->isInit, pcrypto_adapter->isIntMode);
		reg_init = INIT_REG_SOMEONE;
	}

	hal_rtl_crypto_cache(pcrypto_adapter, NULL, NULL);

	DBG_CRYPTO_INFO("[Register someone...] reg_init = 0x%x\r\n", reg_init);
	DBG_CRYPTO_INFO("[ROM code Init CryptoEngine success...]\r\n");
	//__rtl_crypto_irq_enable(pcrypto_adapter, g_crypto_handler);

	return ret;
}

/**
 *  \fn          int hal_crypto_engine_deinit_rtl8710c(phal_crypto_adapter_t pcrypto_adapter)
 *  \brief       Disable crypto engine interrupt, the clock and bus related IPsec.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_engine_deinit(phal_crypto_adapter_t pcrypto_adapter)
{
	int ret = SUCCESS;
	CRYPTO_Type *pcrypto;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	pcrypto = pcrypto_adapter->base_addr;
	if (pcrypto_adapter->isInit == _TRUE) {
		if (INIT_REG_SOMEONE == reg_init) {
			//Disable Crypto interrupt(enable interrupt mask), no matter whether interrupt registered before
			(pcrypto->ipscsr_int_mask_reg_b.cmd_ok_m) = 1;

#if defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE == 1)
			hal_rtl_irq_disable(Crypto_IRQn);
#else
			hal_rtl_irq_disable(SCrypto_IRQn);
#endif
			__ISB();

#if !defined(CONFIG_BUILD_NONSECURE)
			//Disable clock
			if (!((pcrypto_adapter->initmap) & CHECK_INIT_FROM_HAL)) {
				hal_rtl_crypto_en_ctrl(DISABLE_PLATFORM);
			}
#endif
		}
		reg_init = INIT_REG_NOONE;
		pcrypto_adapter->isIntMode = 0;
		pcrypto_adapter->isInit = 0;
		pcrypto_adapter->base_addr = NULL;
		//CRYPTO_ADAPTER = NULL;
		DBG_CRYPTO_INFO("[Deregister someone...] reg_init = 0x%x\r\n", reg_init);
		DBG_CRYPTO_INFO("[ROM code DeInit CryptoEngine success...] isIntMode = %d, isInit = %d\r\n", pcrypto_adapter->isIntMode, pcrypto_adapter->isInit);
	} else {
		DBG_CRYPTO_INFO("[Crypto engine doesn't initialize...]\r\n");
	}
	return ret;
}


#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
uint32_t hal_rtl_crypto_get_sk_cfg(hal_crypto_adapter_t *pcrypto_adapter, const uint8_t sk_op, const uint8_t sk_idx, const uint8_t wb_op, const uint8_t wb_idx)
{
	DBG_CRYPTO_ERR("Test-chip NON-support\r\n");
	return 0x0;
}

SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_sk_init(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
								IN const u8 *pAuthKey, IN const u32 sk_cfg)
{
	int ret = FAIL;
	DBG_CRYPTO_ERR("Test-chip NON-support\r\n");
	return ret;
}

#else
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_engine_set_ld_key_cfg(hal_crypto_adapter_t *pcrypto_adapter, IN const uint32_t cipher_type,
		IN const u32 auth_type, IN const hal_crypto_key_cfg_t *pkey_cfg)
{
	int ret = SUCCESS;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT;
	}

