swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
	hal_rtl_crypto_engine_set_security_type(pcrypto_adapter, cipher_type, auth_type);
	hal_rtl_crypto_key_stg_sk_sel(pcrypto_adapter, pkey_cfg);
	return ret;
}

SECTION_CRYPTO_TEXT
int hal_rtl_crypto_engine_sk_sel_mode(hal_crypto_adapter_t *pcrypto_adapter, IN const uint32_t cipher_type,
									  IN const u32 auth_type, IN const u8 sk_idx)
{
	int ret = SUCCESS;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT;
	}

	hal_rtl_crypto_engine_set_security_type(pcrypto_adapter, cipher_type, auth_type);

	if (CRYPTO_KEY_STG_INPUT_SK_DIS != sk_idx) {
		hal_rtl_crypto_key_storage_securekey(pcrypto_adapter, sk_idx, _TRUE);
	} else {
		hal_rtl_crypto_key_storage_securekey(pcrypto_adapter, sk_idx, _FALSE);
	}
	pcrypto_adapter->lenCipherKey = 0;
	pcrypto_adapter->pCipherKey   = NULL;

	pcrypto_adapter->pAuthKey   = NULL;
	pcrypto_adapter->lenAuthKey = 0;
	pcrypto_adapter->ipad = NULL;
	pcrypto_adapter->opad = NULL;
	return ret;
}

SECTION_CRYPTO_TEXT
void hal_rtl_crypto_get_sk_cfg_info(IN const u32 sk_cfg, IN u8 *pcfg, IN const u8 role)
{
	u8 cfg_shift = 0;
	u32 cfg_mask = 0xFF;

	if (CRYPTO_KEY_STG_ROLE_KEYCFG == role) {
		cfg_shift = 0;
	} else {
		cfg_shift = 8;
	}
	*pcfg = ((sk_cfg >> cfg_shift) & cfg_mask);
}

SECTION_CRYPTO_TEXT
void hal_rtl_crypto_set_sk_cfg_info(IN u32 *psk_cfg, IN const u8 cfg, IN const u8 role)
{
	u8 cfg_shift = 0;
	u32 cfg_mask = 0xFF;

	if (CRYPTO_KEY_STG_ROLE_KEYCFG == role) {
		cfg_shift = 0;
	} else {
		cfg_shift = 8;
	}
	*psk_cfg |= ((cfg & cfg_mask) << cfg_shift);
}

SECTION_CRYPTO_TEXT
uint32_t hal_rtl_crypto_get_sk_cfg(hal_crypto_adapter_t *pcrypto_adapter, const uint8_t sk_op, const uint8_t sk_idx, const uint8_t wb_op, const uint8_t wb_idx)
{
	uint32_t sk_cfg = 0x0;
	hal_crypto_key_cfg_t key_cfg;
	hal_crypto_wb_cfg_t wb_cfg;

	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}

	key_cfg.b.sel = (sk_op & 0xF);
	key_cfg.b.idx = (sk_idx & 0xF);
	hal_rtl_crypto_set_sk_cfg_info(&sk_cfg, (key_cfg.w), CRYPTO_KEY_STG_ROLE_KEYCFG);

	wb_cfg.b.sel = (wb_op & 0xF);
	wb_cfg.b.idx = (wb_idx & 0xF);
	hal_rtl_crypto_set_sk_cfg_info(&sk_cfg, (wb_cfg.w), CRYPTO_KEY_STG_ROLE_WBCFG);
	return sk_cfg;
}

SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_sk_init(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
								IN const u8 *pAuthKey, IN const u32 sk_cfg)
{
	int ret = SUCCESS;
	hal_crypto_key_cfg_t    key_cfg;
	hal_crypto_wb_cfg_t     wb_cfg;
	u8 *pKey = NULL;
	u32 lenAuthKey = 0;

	pKey = (u8 *)pAuthKey;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}

	if ((AUTH_TYPE_SHA2_256_ALL != auth_type) && (AUTH_TYPE_HMAC_SHA2_256_ALL != auth_type)) {
		return _ERRNO_CRYPTO_KEY_STORAGE_NON_SUPPORT;
	}

	// for sequential hash
	pcrypto_adapter->hmac_seq_is_recorded = 0;
	pcrypto_adapter->hmac_seq_buf_is_used_bytes = 0;
	pcrypto_adapter->hmac_seq_hash_sk_last = 0;

	// 1. get key_cfg, wb_cfg
	hal_rtl_crypto_get_sk_cfg_info(sk_cfg, &key_cfg, CRYPTO_KEY_STG_ROLE_KEYCFG);
	hal_rtl_crypto_get_sk_cfg_info(sk_cfg, &wb_cfg, CRYPTO_KEY_STG_ROLE_WBCFG);
	//dbg_printf("sk_cfg=0x%x\r\n",sk_cfg);
	//dbg_printf("key_cfg=0x%x\r\n",key_cfg);
	//dbg_printf("wb_cfg=0x%x\r\n",wb_cfg);

	if (AUTH_TYPE_SHA2_256_ALL == auth_type) {
		pKey = NULL;
		lenAuthKey = 0;
	} else {
		lenAuthKey = 32;
	}

	// 2. set key_cfg, wb_cfg and init auth type for adapter
	if (KEY_STG_SKTYPE_LD_SK == key_cfg.b.sel) {
		ret = hal_rtl_crypto_engine_set_ld_key_cfg(pcrypto_adapter, CIPHER_TYPE_NO_CIPHER, auth_type, &key_cfg);
	} else {
		ret = hal_rtl_crypto_auth_init(pcrypto_adapter, auth_type, pKey, lenAuthKey);
	}
	ret = hal_rtl_crypto_key_stg_wb_sel(pcrypto_adapter, &wb_cfg);
	return ret;
}

SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_sk_sel_init(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
									IN const u8 sk_idx, IN const u8 wb_idx)
{
	int ret = SUCCESS;

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	// for sequential hash
	pcrypto_adapter->hmac_seq_is_recorded = 0;
	pcrypto_adapter->hmac_seq_buf_is_used_bytes = 0;

	ret = hal_rtl_crypto_engine_sk_sel_mode(pcrypto_adapter, CIPHER_TYPE_NO_CIPHER, auth_type, sk_idx);

	if (pcrypto_adapter->sha2type == SHA2_256) {
		if (wb_idx != 0xFF) {
			ret = hal_rtl_crypto_key_storage_writeback(pcrypto_adapter, wb_idx, _TRUE);
		} else {
			ret = hal_rtl_crypto_key_storage_writeback(pcrypto_adapter, wb_idx, _FALSE);
		}
	} else {
		return _ERRNO_CRYPTO_AUTH_TYPE_NOT_MATCH;
	}

	return ret;
}
#endif

//AUTH
#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_init(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
							 IN const u8 *pAuthKey, IN const u32 lenAuthKey)
{
	int ret = SUCCESS;
	const u8 *pCipherKey    = NULL;
	const u32 lenCipherKey  = 0;

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	// for sequential hash
	pcrypto_adapter->hmac_seq_is_recorded = 0;
	pcrypto_adapter->hmac_seq_buf_is_used_bytes = 0;

	if (auth_type & AUTH_TYPE_MASK_HMAC) {
		if (pAuthKey == NULL) {
			return _ERRNO_CRYPTO_NULL_POINTER;
		}
		if ((u32)(pAuthKey) & 0x1F) {
			return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
		}
		if (lenAuthKey == 0) {
			return _ERRNO_CRYPTO_KEY_OutRange;
		}
		if (lenAuthKey > CRYPTO_AUTH_PADDING) {
			return _ERRNO_CRYPTO_KEY_OutRange;
		}
		ret = hal_rtl_crypto_engine_set_security_mode(pcrypto_adapter, CIPHER_TYPE_NO_CIPHER, auth_type,
				pCipherKey, lenCipherKey, pAuthKey, lenAuthKey);
	} else {
		ret = hal_rtl_crypto_engine_set_security_mode(pcrypto_adapter, CIPHER_TYPE_NO_CIPHER, auth_type,
				pCipherKey, lenCipherKey, NULL, 0);
	}

	return ret;
}

#else
/**
 *  \fn          int hal_crypto_auth_init_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
 *                                                 IN const u8 *pAuthKey, IN const u32 lenAuthKey)
 *  \brief       Check input parameters which authentication Hash/HMAC needs,
 *               and set related authentication Hash/HMAC initial values to crypto adapter.
 *  \note
 *               auth_type =
 *               {
 *                  AUTH_TYPE_MD5,
 *                  AUTH_TYPE_SHA1,
 *                  AUTH_TYPE_SHA2_224_ALL,
 *                  AUTH_TYPE_SHA2_256_ALL,
 *                  AUTH_TYPE_HMAC_MD5,
 *                  AUTH_TYPE_HMAC_SHA1,
 *                  AUTH_TYPE_HMAC_SHA2_224_ALL,
 *                  AUTH_TYPE_HMAC_SHA2_256_ALL
 *               }
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   auth_type Hash/HMAC type ID
 *  \param[in]   pAuthKey Pointer to authentication key buffer
 *  \param[in]   lenAuthKey Authentication key buffer length
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_init(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
							 IN const u8 *pAuthKey, IN const u32 lenAuthKey)
{
	int ret = SUCCESS;
	const u8 *pCipherKey    = NULL;
	const u32 lenCipherKey  = 0;
	hal_crypto_key_cfg_t key_cfg;
	hal_crypto_wb_cfg_t  wb_cfg;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	// for sequential hash
	pcrypto_adapter->hmac_seq_is_recorded = 0;
	pcrypto_adapter->hmac_seq_buf_is_used_bytes = 0;
	pcrypto_adapter->hmac_seq_hash_sk_last = 0;

	if (auth_type & AUTH_TYPE_MASK_HMAC) {
		if (pAuthKey == NULL) {
			return _ERRNO_CRYPTO_NULL_POINTER;
		}
		if ((u32)(pAuthKey) & 0x1F) {
			return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
		}
		if (lenAuthKey == 0) {
			return _ERRNO_CRYPTO_KEY_OutRange;
		}
		if ((AUTH_TYPE_HMAC_SHA2_384_ALL == auth_type) || (AUTH_TYPE_HMAC_SHA2_512_ALL == auth_type)) {
			if (lenAuthKey > CRYPTO_PADSIZE_SHA512) {
				return _ERRNO_CRYPTO_KEY_OutRange;
			}
		} else {
			if (lenAuthKey > CRYPTO_AUTH_PADDING) {
				return _ERRNO_CRYPTO_KEY_OutRange;
			}
		}
		ret = hal_rtl_crypto_engine_set_security_mode(pcrypto_adapter, CIPHER_TYPE_NO_CIPHER, auth_type,
				pCipherKey, lenCipherKey, pAuthKey, lenAuthKey);
		key_cfg.b.idx = KEY_STG_SK_IDX_NONE;
		key_cfg.b.sel = KEY_STG_SKTYPE_LD_KEYBUF;
		ret = hal_rtl_crypto_key_stg_sk_sel(pcrypto_adapter, &key_cfg);
	} else {
		ret = hal_rtl_crypto_engine_set_security_mode(pcrypto_adapter, CIPHER_TYPE_NO_CIPHER, auth_type,
				pCipherKey, lenCipherKey, NULL, 0);
		key_cfg.b.idx = KEY_STG_SK_IDX_NONE;
		key_cfg.b.sel = KEY_STG_SKTYPE_LD_NOKEY;
		ret = hal_rtl_crypto_key_stg_sk_sel(pcrypto_adapter, &key_cfg);
	}
	wb_cfg.b.idx = KEY_STG_SK_IDX_NONE;
	wb_cfg.b.sel = KEY_STG_WBTYPE_WB_ONLY_BUF;
	ret = hal_rtl_crypto_key_stg_wb_sel(pcrypto_adapter, &wb_cfg);
	return ret;
}
#endif

#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_init_SHA512(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
									IN const u8 *pAuthKey, IN const u32 lenAuthKey)
{
	int ret = SUCCESS;
	const u8 *pCipherKey    = NULL;
	const u32 lenCipherKey  = 0;

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	// for sequential hash
	pcrypto_adapter->hmac_seq_is_recorded = 0;
	pcrypto_adapter->hmac_seq_buf_is_used_bytes = 0;

	if (auth_type & AUTH_TYPE_MASK_HMAC) {
		if (pAuthKey == NULL) {
			return _ERRNO_CRYPTO_NULL_POINTER;
		}
		if ((u32)(pAuthKey) & 0x1F) {
			return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
		}
		if (lenAuthKey == 0) {
			return _ERRNO_CRYPTO_KEY_OutRange;
		}
		if (lenAuthKey > CRYPTO_AUTH_PADDING) {
			return _ERRNO_CRYPTO_KEY_OutRange;
		}
		ret = hal_rtl_crypto_engine_set_security_mode_SHA512(pcrypto_adapter, CIPHER_TYPE_NO_CIPHER, auth_type,
				pCipherKey, lenCipherKey, pAuthKey, lenAuthKey);
	} else {
		ret = hal_rtl_crypto_engine_set_security_mode_SHA512(pcrypto_adapter, CIPHER_TYPE_NO_CIPHER, auth_type,
				pCipherKey, lenCipherKey, NULL, 0);
	}

	return ret;
}
#endif

/**
 *  \fn          int hal_crypto_auth_process_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
 *                                                    IN const u8 *message, IN const u32 msglen, OUT u8 *pDigest)
 *  \brief       Check input parameters which authentication Hash/HMAC needs,
 *               and make crypto engine run Hash/HMAC algorithm. After that, get the hash digest.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   auth_type Hash/HMAC type ID
 *  \param[in]   message Pointer to authentication message buffer
 *  \param[in]   msglen Authentication message buffer length
 *  \param[out]  pDigest Pointer to authentication digest buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */

SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_process(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
								IN const u8 *message, IN const u32 msglen, OUT u8 *pDigest)
{
	int ret = SUCCESS;

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((pcrypto_adapter->auth_type & AUTH_TYPE_MASK_FUNC_ALL) != (auth_type & AUTH_TYPE_MASK_FUNC_ALL)) {
		return _ERRNO_CRYPTO_AUTH_TYPE_NOT_MATCH;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	//if ( msglen > CRYPTO_MAX_MSG_LENGTH ) return _ERRNO_CRYPTO_MSG_OutRange;

	ret = hal_rtl_crypto_engine(pcrypto_adapter, message, msglen, NULL, 0, NULL, 0, pDigest, NULL);
	if (ret != SUCCESS) {
		return ret;
	}

	hal_rtl_crypto_engine_get_result(pcrypto_adapter, pDigest, NULL, 0, NULL);
	return ret;
}

#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_process_SHA512(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
									   IN const u8 *message, IN const u32 msglen, OUT u8 *pDigest)
{
	int ret = SUCCESS;

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((pcrypto_adapter->auth_type & AUTH_TYPE_MASK_FUNC_ALL) != (auth_type & AUTH_TYPE_MASK_FUNC_ALL)) {
		return _ERRNO_CRYPTO_AUTH_TYPE_NOT_MATCH;
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (msglen == 0) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}
	//if ( msglen > CRYPTO_MAX_MSG_LENGTH ) return _ERRNO_CRYPTO_MSG_OutRange;

	ret = hal_rtl_crypto_engine_SHA512(pcrypto_adapter, message, msglen, NULL, 0, NULL, 0, pDigest, NULL);
	if (ret != SUCCESS) {
		return ret;
	}

	hal_rtl_crypto_engine_get_result_SHA512(pcrypto_adapter, pDigest, NULL, 0, NULL);
	return ret;
}
#endif

#if IS_CUT_TEST(CONFIG_CHIP_VER)
/**
 *  \fn          int hal_crypto_auth_update_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
 *                                                   IN const u8 *message, IN const u32 msglen)
 *  \brief       Check input parameters which authentication needs,and use a sequential buffer to help crypto engine
 *               to pre-process authentication message buffer.After that, update related sequential hash data in crypto adapter.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   auth_type Hash/HMAC type ID
 *  \param[in]   message Pointer to authentication message buffer
 *  \param[in]   msglen Authentication message buffer length
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_update(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
							   IN const u8 *message, IN const u32 msglen)
{
	int ret = SUCCESS;

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	//if ( msglen > CRYPTO_MAX_MSG_LENGTH ) return _ERRNO_CRYPTO_MSG_OutRange;

	if ((pcrypto_adapter->auth_type & AUTH_TYPE_MASK_FUNC_ALL) != (auth_type & AUTH_TYPE_MASK_FUNC_ALL)) {
		return _ERRNO_CRYPTO_AUTH_TYPE_NOT_MATCH;
	}

	{
		pcrypto_adapter->hmac_seq_last_message = (u8 *)message;
		pcrypto_adapter->hmac_seq_last_msglen  = msglen;
		pcrypto_adapter->hmac_seq_is_recorded  = 1;

