swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
		if ((pcrypto_adapter->sha2type == SHA2_384) || (pcrypto_adapter->sha2type == SHA2_512)) {
			ret = hal_rtl_crypto_send_seq_buf_SHA512(pcrypto_adapter, NULL);
		} else {
			ret = hal_rtl_crypto_send_seq_buf(pcrypto_adapter, NULL);
		}
	}
	return ret;
}

#else

/**
 *  \fn          int hal_crypto_auth_update_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
 *                                                   IN const u8 *message, IN const u32 msglen)
 *  \brief       Check input parameters which authentication needs,and use a sequential buffer to help crypto engine
 *               to pre-process authentication message buffer.After that, update related sequential hash data in crypto adapter.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   auth_type Hash/HMAC type ID
 *  \param[in]   message Pointer to authentication message buffer
 *  \param[in]   msglen Authentication message buffer length
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_update(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
							   IN const u8 *message, IN const u32 msglen)
{
	int ret = SUCCESS;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	//if ( msglen > CRYPTO_MAX_MSG_LENGTH ) return _ERRNO_CRYPTO_MSG_OutRange;

	if ((pcrypto_adapter->auth_type & AUTH_TYPE_MASK_FUNC_ALL) != (auth_type & AUTH_TYPE_MASK_FUNC_ALL)) {
		return _ERRNO_CRYPTO_AUTH_TYPE_NOT_MATCH;
	}

	{
		pcrypto_adapter->hmac_seq_last_message = (u8 *)message;
		pcrypto_adapter->hmac_seq_last_msglen  = msglen;
		pcrypto_adapter->hmac_seq_is_recorded  = 1;
		ret = hal_rtl_crypto_send_seq_buf(pcrypto_adapter, NULL);
	}
	return ret;
}
#endif

#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_update_SHA512(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
									  IN const u8 *message, IN const u32 msglen)
{
	int ret = SUCCESS;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (message == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	//if ( msglen > CRYPTO_MAX_MSG_LENGTH ) return _ERRNO_CRYPTO_MSG_OutRange;

	if ((pcrypto_adapter->auth_type & AUTH_TYPE_MASK_FUNC_ALL) != (auth_type & AUTH_TYPE_MASK_FUNC_ALL)) {
		return _ERRNO_CRYPTO_AUTH_TYPE_NOT_MATCH;
	}

	{
		pcrypto_adapter->hmac_seq_last_message = (u8 *)message;
		pcrypto_adapter->hmac_seq_last_msglen  = msglen;
		pcrypto_adapter->hmac_seq_is_recorded  = 1;

		ret = hal_rtl_crypto_send_seq_buf_SHA512(pcrypto_adapter, NULL);
	}
	return ret;
}
#endif

#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_sk_final(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type, OUT u8 *pDigest)
{
	int ret = FAIL;
	DBG_CRYPTO_ERR("Test-chip non-support\r\n");
	return ret;
}
#else
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_sk_final(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type, OUT u8 *pDigest)
{
	int ret = SUCCESS;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if ((pcrypto_adapter->auth_type & AUTH_TYPE_MASK_FUNC_ALL) != (auth_type & AUTH_TYPE_MASK_FUNC_ALL)) {
		return _ERRNO_CRYPTO_AUTH_TYPE_NOT_MATCH;
	}
	if (pcrypto_adapter->hmac_seq_is_recorded == 0) {
		return _ERRNO_CRYPTO_HASH_FINAL_NO_UPDATE;
	}

	if (KEY_STG_WBTYPE_WB_ONLY_STG != (pcrypto_adapter->wb_key_cfg.b.sel)) {
		if (pDigest == NULL) {
			return _ERRNO_CRYPTO_NULL_POINTER;
		}
	}
	pcrypto_adapter->hmac_seq_hash_sk_last = 1;

	{
		ret = hal_rtl_crypto_send_seq_buf(pcrypto_adapter, pDigest);
		if (ret != SUCCESS) {
			return ret;
		}
	}
	if (pDigest != NULL) {
		hal_rtl_crypto_engine_get_result(pcrypto_adapter, pDigest, NULL, 0, NULL);
	}
	pcrypto_adapter->hmac_seq_is_recorded = 0;

	return ret;
}
#endif

#if IS_CUT_TEST(CONFIG_CHIP_VER)
/**
 *  \fn          int hal_crypto_auth_final_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type, OUT u8 *pDigest)
 *  \brief       Check input parameters which authentication needs,and process authentication last message buffer.
 *               After that, get the hash digest.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   auth_type Hash/HMAC type ID
 *  \param[out]  pDigest Pointer to authentication digest buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_final(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type, OUT u8 *pDigest)
{
	int ret = SUCCESS;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if ((pcrypto_adapter->auth_type & AUTH_TYPE_MASK_FUNC_ALL) != (auth_type & AUTH_TYPE_MASK_FUNC_ALL)) {
		return _ERRNO_CRYPTO_AUTH_TYPE_NOT_MATCH;
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->hmac_seq_is_recorded == 0) {
		return _ERRNO_CRYPTO_HASH_FINAL_NO_UPDATE;
	}

	{
		if ((pcrypto_adapter->sha2type == SHA2_384) || (pcrypto_adapter->sha2type == SHA2_512)) {
			ret = hal_rtl_crypto_send_seq_buf_SHA512(pcrypto_adapter, pDigest);
		} else {
			ret = hal_rtl_crypto_send_seq_buf(pcrypto_adapter, pDigest);
		}
		if (ret != SUCCESS) {
			return ret;
		}
	}
	hal_rtl_crypto_engine_get_result(pcrypto_adapter, pDigest, NULL, 0, NULL);
	pcrypto_adapter->hmac_seq_is_recorded = 0;
	return ret;
}

#else
/**
 *  \fn          int hal_crypto_auth_final_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type, OUT u8 *pDigest)
 *  \brief       Check input parameters which authentication needs,and process authentication last message buffer.
 *               After that, get the hash digest.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   auth_type Hash/HMAC type ID
 *  \param[out]  pDigest Pointer to authentication digest buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_final(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type, OUT u8 *pDigest)
{
	int ret = SUCCESS;

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if ((pcrypto_adapter->auth_type & AUTH_TYPE_MASK_FUNC_ALL) != (auth_type & AUTH_TYPE_MASK_FUNC_ALL)) {
		return _ERRNO_CRYPTO_AUTH_TYPE_NOT_MATCH;
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->hmac_seq_is_recorded == 0) {
		return _ERRNO_CRYPTO_HASH_FINAL_NO_UPDATE;
	}

	{
		ret = hal_rtl_crypto_send_seq_buf(pcrypto_adapter, pDigest);
		if (ret != SUCCESS) {
			return ret;
		}
	}

	hal_rtl_crypto_engine_get_result(pcrypto_adapter, pDigest, NULL, 0, NULL);
	pcrypto_adapter->hmac_seq_is_recorded = 0;
	return ret;
}
#endif

#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth_final_SHA512(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type, OUT u8 *pDigest)
{
	int ret = SUCCESS;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if ((pcrypto_adapter->auth_type & AUTH_TYPE_MASK_FUNC_ALL) != (auth_type & AUTH_TYPE_MASK_FUNC_ALL)) {
		return _ERRNO_CRYPTO_AUTH_TYPE_NOT_MATCH;
	}
	if (pDigest == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->hmac_seq_is_recorded == 0) {
		return _ERRNO_CRYPTO_HASH_FINAL_NO_UPDATE;
	}

	{
		ret = hal_rtl_crypto_send_seq_buf_SHA512(pcrypto_adapter, pDigest);
		if (ret != SUCCESS) {
			return ret;
		}
	}

	hal_rtl_crypto_engine_get_result_SHA512(pcrypto_adapter, pDigest, NULL, 0, NULL);
	pcrypto_adapter->hmac_seq_is_recorded = 0;

	return ret;
}
#endif

/**
 *  \fn          int hal_crypto_auth_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
 *                                            IN const u8 *message, IN const u32 msglen,
 *                                            IN const u8 *pAuthKey, IN const u32 lenAuthKey, OUT u8 *pDigest)
 *  \brief       Make crypto engine run Hash/HMAC algorithm. After that, get the hash digest.
 *  \note        The maximum input buffer length can't be over 64k bytes.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   auth_type Hash/HMAC type ID
 *  \param[in]   message Pointer to authentication message buffer
 *  \param[in]   msglen Authentication message buffer length
 *  \param[in]   pAuthKey Pointer to authentication key buffer
 *  \param[in]   lenAuthKey Authentication key buffer length
 *  \param[out]  pDigest Pointer to authentication digest buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_auth(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
						IN const u8 *message, IN const u32 msglen,
						IN const u8 *pAuthKey, IN const u32 lenAuthKey, OUT u8 *pDigest)
{
	int ret = FAIL;
	do {
		ret = hal_rtl_crypto_auth_init(pcrypto_adapter, auth_type, pAuthKey, lenAuthKey);
		if (ret != SUCCESS) {
			break;
		}
		ret = hal_rtl_crypto_auth_process(pcrypto_adapter, auth_type, message, msglen, pDigest);
	} while (0);
	return ret;
}

/**
 *  \fn          int hal_crypto_cipher_init_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type,
 *                                                   IN const u8 *key, IN const u32 keylen)
 *  \brief       Check input parameters which cipher needs, and set related cipher initial values to crypto adapter.
 *  \note
 *               cipher_type =
 *               {
 *                  CIPHER_TYPE_AES_ECB,
 *                  CIPHER_TYPE_AES_CBC,
 *                  CIPHER_TYPE_AES_CFB,
 *                  CIPHER_TYPE_AES_OFB,
 *                  CIPHER_TYPE_AES_CTR,
 *                  CIPHER_TYPE_AES_GCTR,
 *                  CIPHER_TYPE_AES_GMAC,
 *                  CIPHER_TYPE_AES_GHASH,
 *                  CIPHER_TYPE_AES_GCM
 *               }
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   cipher_type  Cipher type ID
 *  \param[in]   key Pointer to crypto cipher key buffer
 *  \param[in]   keylen Cipher key buffer length
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_cipher_init(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type, IN const u8 *key, IN const u32 keylen)
{
	int ret = SUCCESS;
	u8 *pAuthKey = NULL;
	u32 lenAuthKey = 0;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(key) & 0x1f) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned; // need to be 4-byte alignment
	}
	if (CIPHER_TYPE_AES_GHASH == cipher_type) {
		if ((128 / 8) != keylen) {
			return _ERRNO_CRYPTO_KEY_OutRange;
		}
	} else if (CIPHER_TYPE_AES_GMAC == cipher_type) {
		if (((128 / 8) != keylen) && ((192 / 8) != keylen) && ((256 / 8) != keylen)) {
			return _ERRNO_CRYPTO_KEY_OutRange;
		}
	}
	//if ( (keylen != 128/8) && (keylen != 192/8) && (keylen != 256/8) ) return _ERRNO_CRYPTO_KEY_OutRange;
	ret = hal_rtl_crypto_engine_set_security_mode(pcrypto_adapter, cipher_type, AUTH_TYPE_NO_AUTH,
			key, keylen, pAuthKey, lenAuthKey);
	return ret;
}

/**
 *  \fn          int hal_crypto_cipher_encrypt_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type,
 *                                                      IN const u8 *message, IN const u32 msglen,
 *                                                      IN const u8 *iv, IN const u32 ivlen,
 *                                                      IN const u8 *aad, IN const u32 aadlen,
 *                                                      OUT u8 *pResult, OUT u8 *pTag)
 *  \brief       Check input parameters which cipher needs, and make crypto engine encrypt the plaintext.
 *               After that, get the ciphertext.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   cipher_type  Cipher type ID
 *  \param[in]   message Pointer to Crypto cipher message buffer
 *  \param[in]   msglen Crypto cipher message data length
 *  \param[in]   iv Pointer to Crypto cipher initial vector buffer
 *  \param[in]   ivlen Crypto cipher initial vector data length
 *  \param[in]   aad Pointer to Crypto cipher additional authentication buffer
 *  \param[in]   aadlen Crypto cipher additional authentication data length
 *  \param[out]  pResult Pointer to Crypto cipher result buffer
 *  \param[out]  pTag Pointer to Crypto cipher Tag buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_cipher_encrypt(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type,
								  IN const u8 *message, IN const u32 msglen,
								  IN const u8 *iv, IN const u32 ivlen,
								  IN const u8 *aad, IN const u32 aadlen,
								  OUT u8 *pResult, OUT u8 *pTag)
{
	int ret = SUCCESS;
	if ((pcrypto_adapter->cipher_type & CIPHER_TYPE_MASK_ALL) != (cipher_type & CIPHER_TYPE_MASK_ALL)) {
		return _ERRNO_CRYPTO_CIPHER_TYPE_NOT_MATCH;
	}

	if (CIPHER_TYPE_FUNC_AES == (cipher_type & CIPHER_TYPE_MASK_FUNC)) {
		if (CIPHER_TYPE_AES_GCM == cipher_type) {
			ret = hal_rtl_crypto_cipher_process(pcrypto_adapter, TYPE_ENCRYPT, cipher_type, message, msglen,
												iv, 0, aad, aadlen, pResult, pTag);
		} else if (CIPHER_TYPE_AES_GCTR == cipher_type) {
			ret = hal_rtl_crypto_cipher_process(pcrypto_adapter, TYPE_ENCRYPT, cipher_type, message, msglen,
												iv, 0, NULL, 0, pResult, NULL);
		} else if (CIPHER_TYPE_AES_GHASH == cipher_type) {
			return ret; //do nothing, because aes_ghash only use decrypt function
		} else if (CIPHER_TYPE_AES_GMAC == cipher_type) {
			return ret; //do nothing, because aes_gmac only use decrypt function
		} else {
			ret = hal_rtl_crypto_cipher_process(pcrypto_adapter, TYPE_ENCRYPT, cipher_type, message, msglen,
												iv, ivlen, NULL, 0, pResult, NULL);
		}
	} else if ((CIPHER_TYPE_FUNC_DES == (cipher_type & CIPHER_TYPE_MASK_FUNC)) || (CIPHER_TYPE_FUNC_3DES == (cipher_type & CIPHER_TYPE_MASK_FUNC))) {
		ret = hal_rtl_crypto_cipher_process(pcrypto_adapter, TYPE_ENCRYPT, cipher_type, message, msglen,
											iv, ivlen, NULL, 0, pResult, NULL);
	}
	return ret;
}

/**
 *  \fn          int hal_crypto_cipher_decrypt_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type,
 *                                                      IN const u8 *message, IN const u32 msglen,
 *                                                      IN const u8 *iv, IN const u32 ivlen,
 *                                                      IN const u8 *aad, IN const u32 aadlen,
 *                                                      OUT u8 *pResult, OUT u8 *pTag)
 *  \brief       Check input parameters which cipher needs, and make crypto engine decrypt the ciphertext.
 *               After that, get the plaintext.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   cipher_type  Cipher type ID
 *  \param[in]   message Pointer to Crypto cipher message buffer
 *  \param[in]   msglen Crypto cipher message data length
 *  \param[in]   iv Pointer to Crypto cipher initial vector buffer
 *  \param[in]   ivlen Crypto cipher initial vector data length
 *  \param[in]   aad Pointer to Crypto cipher additional authentication buffer
 *  \param[in]   aadlen Crypto cipher additional authentication data length
 *  \param[out]  pResult Pointer to Crypto cipher result buffer
 *  \param[out]  pTag Pointer to Crypto cipher Tag buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_cipher_decrypt(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type,
								  IN const u8 *message, IN const u32 msglen,
								  IN const u8 *iv, IN const u32 ivlen,
								  IN const u8 *aad, IN const u32 aadlen,
								  OUT u8 *pResult, OUT u8 *pTag)
{
	int ret = SUCCESS;
	if ((pcrypto_adapter->cipher_type & CIPHER_TYPE_MASK_ALL) != (cipher_type & CIPHER_TYPE_MASK_ALL)) {
		return _ERRNO_CRYPTO_CIPHER_TYPE_NOT_MATCH;
	}
	if (CIPHER_TYPE_FUNC_AES == (cipher_type & CIPHER_TYPE_MASK_FUNC)) {
		if (CIPHER_TYPE_AES_GCM == cipher_type) {
			ret = hal_rtl_crypto_cipher_process(pcrypto_adapter, TYPE_DECRYPT, cipher_type, message, msglen,
												iv, 0, aad, aadlen, pResult, pTag);
		} else if (CIPHER_TYPE_AES_GCTR == cipher_type) {
			ret = hal_rtl_crypto_cipher_process(pcrypto_adapter, TYPE_DECRYPT, cipher_type, message, msglen,
												iv, 0, NULL, 0, pResult, NULL);
		} else if (CIPHER_TYPE_AES_GHASH == cipher_type) {
			ret = hal_rtl_crypto_cipher_process(pcrypto_adapter, TYPE_DECRYPT, cipher_type, message, msglen,
												NULL, 0, NULL, 0, NULL, pTag);
		} else if (CIPHER_TYPE_AES_GMAC == cipher_type) {
			ret = hal_rtl_crypto_cipher_process(pcrypto_adapter, TYPE_DECRYPT, cipher_type, message, msglen,
												iv, 0, aad, aadlen, NULL, pTag);
		} else {
			ret = hal_rtl_crypto_cipher_process(pcrypto_adapter, TYPE_DECRYPT, cipher_type, message, msglen,
												iv, ivlen, NULL, 0, pResult, NULL);
		}
	} else if ((CIPHER_TYPE_FUNC_DES == (cipher_type & CIPHER_TYPE_MASK_FUNC)) || (CIPHER_TYPE_FUNC_3DES == (cipher_type & CIPHER_TYPE_MASK_FUNC))) {
		ret = hal_rtl_crypto_cipher_process(pcrypto_adapter, TYPE_DECRYPT, cipher_type, message, msglen,
											iv, ivlen, NULL, 0, pResult, NULL);
	}
	return ret;
}

/**
 *  \fn          int hal_crypto_mix_mode_init_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type,
 *                                                     IN const u32 auth_type, IN const u8 *cipher_key,
 *                                                     IN const u32 cipher_keylen, IN const u8 *auth_key,
 *                                                     IN const u32 auth_keylen)
 *  \brief       Check input parameters which cipher & auth needs, and set related initial values to crypto adapter.
 *  \note
 *               mix_mode_type =
 *               {
 *                  CRYPTO_MIX_MODE_SSH_ENC,
 *                  CRYPTO_MIX_MODE_SSH_DEC,
 *                  CRYPTO_MIX_MODE_ESP_ENC,
 *                  CRYPTO_MIX_MODE_ESP_DEC,
 *                  CRYPTO_MIX_MODE_SSL_TLS_ENC
 *               }
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   cipher_type  Cipher type ID
 *  \param[in]   auth_type Hash/HMAC type ID
 *  \param[in]   cipher_key Pointer to crypto cipher key buffer
 *  \param[in]   cipher_keylen Cipher key buffer length
 *  \param[in]   auth_key Pointer to authentication key buffer
 *  \param[in]   auth_keylen Authentication key buffer length
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_mix_mode_init(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type, IN const u32 auth_type,
								 IN const u8 *cipher_key, IN const u32 cipher_keylen,
								 IN const u8 *auth_key, IN const u32 auth_keylen)
{
	int ret = SUCCESS;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if (cipher_key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if ((u32)(cipher_key) & 0x1f) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned; // need to be 4-byte alignment
	}
	if ((cipher_keylen != CRYPTO_AES128_KEY_LENGTH) && (cipher_keylen != CRYPTO_AES192_KEY_LENGTH) &&
		(cipher_keylen != CRYPTO_AES256_KEY_LENGTH)) {
		return _ERRNO_CRYPTO_KEY_OutRange;
	}
	if (auth_keylen != 0) {
		if (auth_keylen > CRYPTO_AUTH_PADDING) {
			return _ERRNO_CRYPTO_KEY_OutRange;
		}
		if (auth_key == NULL) {
			return _ERRNO_CRYPTO_NULL_POINTER;
		}
		if ((u32)(auth_key) & 0x1F) {
			return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
		}
	}

	ret = hal_rtl_crypto_engine_set_security_mode(pcrypto_adapter, cipher_type, auth_type,
			cipher_key, cipher_keylen, auth_key, auth_keylen);
	return ret;
}

/**
 *  \fn          int hal_crypto_engine_mix_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
                                                    IN const u8 *message, IN const uint32_t msglen,
                                                    IN const u8 *pIv, IN const uint32_t ivlen,
                                                    IN const u8 *paad, IN const uint32_t aadlen,
                                                    IN const u8 *phash_pad, IN const uint32_t hash_padlen,
                                                    IN const u8 *penc_pad, IN const uint32_t enc_padlen,
                                                    OUT u8 *pResult, OUT u8 *pTag)
 *  \brief       Check input parameters, and set crypto engine registers, then make crypto engine handle those algorithms
 *               in mix mode.
 *  \details     The executing order of crypto engine setting: \n
 *               - Initialize the notified mechanism.
 *               - Set essential buffers and buffer lengths of the cryptographic feature to crypto adapter
 *               - Setup desitination descriptor
 *               - Setup source descriptor
 *                  - Setup command setting buffer
 *                  - Setup key, initial vector, HMAC padding buffer
 *                  - Prepare Data1 ~ DataN
 *               - Wait to be notified after interrupt service routine processed over.
 *  \note        For mix mode(consider hash padding buffer)
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   message Pointer to Crypto cipher message buffer
 *  \param[in]   msglen Crypto cipher message buffer length
 *  \param[in]   pIv Pointer to Crypto cipher initial vector buffer
 *  \param[in]   ivlen Crypto cipher initial vector buffer length
 *  \param[in]   paad Pointer to Crypto cipher additional authentication data buffer
 *  \param[in]   aadlen Crypto cipher additional authentication data buffer length
 *  \param[in]   phash_pad Pointer to mix mode hash padding data buffer
 *  \param[in]   hash_padlen Mix mode hash padding data buffer length
 *  \param[in]   penc_pad Pointer to mix mode encryption padding data buffer
 *  \param[in]   enc_padlen Mix mode encryption padding data buffer length
 *  \param[out]  pResult Pointer to Crypto cipher result buffer
 *  \param[out]  pTag Pointer to Crypto hash digest buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_engine_mix(hal_crypto_adapter_t *pcrypto_adapter,
							  IN const u8 *message,    IN const uint32_t msglen,
							  IN const u8 *pIv,        IN const uint32_t ivlen,
							  IN const u8 *paad,       IN const uint32_t aadlen,
							  IN const u8 *phash_pad,  IN const uint32_t hash_padlen,
							  IN const u8 *penc_pad,   IN const uint32_t enc_padlen,
							  OUT u8 *pResult, OUT u8 *pTag)
{
	rtl_crypto_srcdesc_t srcdesc;

	uint32_t a2eo;
	uint32_t enl;
	uint32_t auth_padlen;
	uint32_t cipher_padlen;
	uint32_t digestlen;

	volatile uint8_t *padding = NULL;
	int ret = SUCCESS;

