swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	} else {
		padding = (&(pcrypto_adapter->padding[0]));
	}
	hal_rtl_crypto_engine_pre_exec(pcrypto_adapter);

	if ((paad != NULL) && (aadlen > 0)) {
		uint32_t cache_len;
		if (aadlen & 0x1F) {
			cache_len = ((aadlen / 32) + 1) * 32;
		} else {
			cache_len = aadlen;
		}
		arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)paad, cache_len);
	}

	// Use only one scatter
	a2eo = aadlen;
	enl = msglen;
	auth_padlen = hash_padlen;
	cipher_padlen = enc_padlen;

	hal_rtl_crypto_start_packet_init(pcrypto_adapter);
//
//   Set relative length data
//
	hal_rtl_crypto_engine_auth_calc_apl(pcrypto_adapter, a2eo, enl, auth_padlen, cipher_padlen);

	//Hash result length
	digestlen = pcrypto_adapter->digestlen;

	/********************************************
	 * step 1: Setup desitination descriptor
	 ********************************************/
	pcrypto_adapter->is_dst_first_cache_used = 0;
	pcrypto_adapter->is_dst_last_cache_used  = 0;

	rtl_crypto_dstdesc_t  dst_auth_desc;
	rtl_crypto_dstdesc_t  dst_cipher_desc;
	int8_t first_cache_pos = 0;
	int8_t first_cache_len = 0;
	int8_t last_cache_pos  = 0;
	int8_t last_cache_len  = 0;
	int dst_len;

	if (pResult != NULL) {
		if ((CRYPTO_ENGINE_SET_MIX_MODE_SSH_ENC_ESP_DEC == (pcrypto_adapter->mix_mode_type)) ||
			(CRYPTO_ENGINE_SET_MIX_MODE_SSH_DEC_ESP_ENC == (pcrypto_adapter->mix_mode_type))) {
			//Destination descriptor may change msglen, because of encryption padding
			dst_len = (pcrypto_adapter->enl + (pcrypto_adapter->apl));
			DBG_CRYPTO_INFO("[Set dest_desc] dst_len = %d,enl = %d,apl = %d\r\n", dst_len, (pcrypto_adapter->enl), (pcrypto_adapter->apl));
		} else {
			//CRYPTO_ENGINE_SET_MIX_MODE_SSL_TLS_ENC
			dst_len = (pcrypto_adapter->enl + digestlen + pcrypto_adapter->enc_padlen);
			DBG_CRYPTO_INFO("[Set dest_desc] dst_len = %d,enl = %d,digestlen = %d,enc_padlen = %d\r\n", dst_len, (pcrypto_adapter->enl),
							digestlen, (pcrypto_adapter->enc_padlen));
		}

		first_cache_pos = (uint32_t)pResult & 0x1F;
		first_cache_len = (32 - first_cache_pos) % 32;
		if (first_cache_len >= dst_len) {
			//There's an enough space of first_cache_line for dst_len
			first_cache_len = dst_len;
			last_cache_len  = 0;
		} else {
			last_cache_pos = (uint32_t)(pResult + dst_len - 1) & 0x1F;
			last_cache_len = last_cache_pos + 1;
			if (last_cache_len == 32) {
				last_cache_len = 0;
			}
		}
		DBG_CRYPTO_INFO("[Set dest_desc] f_cache_pos = %d,f_cache_len = %d\r\n", first_cache_pos, first_cache_len);
		DBG_CRYPTO_INFO("[Set dest_desc] l_cache_pos = %d,l_cache_len = %d\r\n", last_cache_pos, last_cache_len);

		dst_cipher_desc.w = 0;
		dst_cipher_desc.cipher.ws  = 1;
		dst_cipher_desc.cipher.fs  = 1;
		dst_cipher_desc.cipher.enc = 1;

		if (first_cache_len != 0) {
			pcrypto_adapter->is_dst_first_cache_used = 1;

			if (CRYPTO_ENGINE_SET_MIX_MODE_SSL_TLS_ENC == (pcrypto_adapter->mix_mode_type)) {
				if (dst_len == first_cache_len) {
					dst_cipher_desc.cipher.ls  = 1;
				}
			}

			dst_cipher_desc.cipher.enl = first_cache_len;
			DBG_CRYPTO_INFO("[Set dest_desc] f_cache_line_enl = %d\r\n", first_cache_len);

			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pcrypto_adapter->dst_first_cache_line, 32);
			hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_cipher_desc.w, (uint32_t)pcrypto_adapter->dst_first_cache_line);

			dst_len -= first_cache_len;
			pResult += first_cache_len;

			dst_cipher_desc.w = 0;
			dst_cipher_desc.cipher.ws = 1;
			dst_cipher_desc.cipher.enc = 1;
		}

		if (dst_len > 0) {
			//Cut off valid msg of last_cache_line
			//It means leave 32 bytes alignment addr of msg_body
			dst_cipher_desc.cipher.enl = (dst_len - last_cache_len);

			if (last_cache_len != 0) {
				pcrypto_adapter->is_dst_last_cache_used = 1;
				if (dst_len > last_cache_len) { // body
					arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pResult, (dst_len - last_cache_len));
					hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_cipher_desc.w, (uint32_t)pResult);
				}
				pResult += (dst_len - last_cache_len);
				dst_len = last_cache_len;

				dst_cipher_desc.w = 0;
				dst_cipher_desc.cipher.ws  = 1;
				dst_cipher_desc.cipher.enc = 1;
				if (CRYPTO_ENGINE_SET_MIX_MODE_SSL_TLS_ENC == (pcrypto_adapter->mix_mode_type)) {
					dst_cipher_desc.cipher.ls  = 1;
				}
				dst_cipher_desc.cipher.enl = last_cache_len;
				DBG_CRYPTO_INFO("[Set dest_desc] l_cache_line_enl = %d\r\n", last_cache_len);

				arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pcrypto_adapter->dst_last_cache_line, 32);
				hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_cipher_desc.w, (uint32_t)pcrypto_adapter->dst_last_cache_line);
			} else {
				if (CRYPTO_ENGINE_SET_MIX_MODE_SSL_TLS_ENC == (pcrypto_adapter->mix_mode_type)) {
					dst_cipher_desc.cipher.ls  = 1;
				}
				arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pResult, dst_cipher_desc.cipher.enl);
				hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_cipher_desc.w, (uint32_t)pResult);
			}
		}
	}

	if (pTag != NULL) {
		//Calculate cipher Tag,use adl not enc!
		dst_auth_desc.w = 0;
		dst_auth_desc.auth.ws  = 1;
		dst_auth_desc.auth.ls  = 1;
		dst_auth_desc.auth.enc = 0;
		dst_auth_desc.auth.adl = digestlen;
		arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pcrypto_adapter->tag_result, 32);
		hal_rtl_crypto_set_dstdesc(pcrypto_adapter, dst_auth_desc.w, (uint32_t)pcrypto_adapter->tag_result);
	}

	/********************************************
	 * step 2: Setup source descriptor
	 ********************************************/
	/********************************************
	 * step 2-1: prepare Key & IV array:
	 ********************************************/

	hal_rtl_crypto_engine_srcdesc_generate_cl_key_iv(pcrypto_adapter, pIv, ivlen);


	/********************************************
	 * step 2-2: prepare Data1 ~ DataN
	 ********************************************/

	srcdesc.w = 0;
	srcdesc.d.rs = 1;

	if (paad != NULL) {
		while (a2eo > 24) {
			srcdesc.d.a2eo = 24;

			__dbg_mem_dump(pcrypto_adapter->isMemDump, paad, 24, "MIX_AAD[while-loop]: ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)paad);

			paad += 24;
			a2eo -= 24;
			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		}

		if (a2eo > 0) {
			DBG_CRYPTO_INFO("[Set src_desc_data] a2eo = %d\r\n", a2eo);
			srcdesc.d.a2eo = a2eo;
			__dbg_mem_dump(pcrypto_adapter->isMemDump, paad, a2eo, "AAD[rest]: ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)paad);
			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		}

		//Handle padding issue
		if (pcrypto_adapter->apl_aad > 0) {
			DBG_CRYPTO_INFO("[Set src_desc_data] apl_aad = %d\r\n", pcrypto_adapter->apl_aad);
			srcdesc.d.a2eo = pcrypto_adapter->apl_aad;
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)padding, 64);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, padding, pcrypto_adapter->apl_aad, "AAD padding ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)padding);
			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		}

