swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
	}

	{
		int8_t first_cache_pos = 0;
		int8_t first_cache_len = 0;
		int8_t last_cache_pos  = 0;
		int8_t last_cache_len  = 0;

		first_cache_pos = (uint32_t) message & 0x1F;
		first_cache_len = (32 - first_cache_pos) % 32;
		if ((uint32_t)first_cache_len >= enl) { // the same one
			first_cache_len = enl;
			last_cache_len  = 0;
		} else {
			last_cache_pos = ((uint32_t)(message) + enl - 1) & 0x1F;
			last_cache_len = last_cache_pos + 1;
		}

		DBG_CRYPTO_INFO("[Set src_desc_data] f_cache_pos = %d,f_cache_len = %d\r\n", first_cache_pos, first_cache_len);
		DBG_CRYPTO_INFO("[Set src_desc_data] l_cache_pos = %d,l_cache_len = %d\r\n", last_cache_pos, last_cache_len);

		if (first_cache_len != 0) {
			rtlc_memcpy((void *)(&(pcrypto_adapter->src_first_cache_line[0])), (const void *)(message), first_cache_len);

			srcdesc.d.enl = first_cache_len;
			DBG_CRYPTO_INFO("[Set src_desc_data] f_cache_line_enl = %d\r\n", first_cache_len);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, &(pcrypto_adapter->src_first_cache_line[0]), first_cache_len, "src_data[first_cache_line]: ");
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)(&(pcrypto_adapter->src_first_cache_line[0])), 32);
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)(&(pcrypto_adapter->src_first_cache_line[0])));
			message += first_cache_len;
			enl -= first_cache_len;
			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		}

		// 16352 bytes is the max size of enl could set!
		while (enl > 16352) {
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)message, 16352);
			srcdesc.d.enl = 16352;
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)message);

			message += 16352;
			enl -= 16352;
			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		}

		//Cut off valid msg of last_cache_line
		//It means leave 32 bytes alignment addr of msg_body
		// message aligned body
		if (enl > (uint32_t)(last_cache_len)) {
			uint32_t dst_len = enl - (uint32_t)(last_cache_len);

			// assert
			if ((dst_len & 0x1F) != 0) {
				DBG_CRYPTO_ERR("Strange : enl(%d), last_cache_len(%d)", enl, last_cache_len);
				return _ERRNO_CRYPTO_CACHE_HANDLE;
			}

			DBG_CRYPTO_INFO("[Set src_desc_data] dst_len = %d\r\n", dst_len);
			srcdesc.d.enl = dst_len;
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)message, srcdesc.d.enl);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, message, msglen, "src_data[msg_32align_body]: ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)message);
			message += dst_len;
			enl -= dst_len;

			srcdesc.w = 0;
			srcdesc.d.rs = 1;
		} else if (enl < (uint32_t)(last_cache_len)) {

			DBG_CRYPTO_ERR("Strange : enl(%d), last_cache_len(%d)", enl, last_cache_len);
			return _ERRNO_CRYPTO_CACHE_HANDLE;
		}

		if (last_cache_len == 32) {

			srcdesc.d.enl = 32;
			__dbg_mem_dump(pcrypto_adapter->isMemDump, message, 32, "src_data[last_cache_len_equal_32]: ");
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)message, 32);
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)message);

		} else if (last_cache_len != 0)  {
			rtlc_memcpy((void *)(pcrypto_adapter->src_last_cache_line), (const void *)(message), last_cache_len);
			DBG_CRYPTO_INFO("[Set src_desc_data] l_cache_len(below 32) = %d\r\n", last_cache_len);

			srcdesc.d.enl = last_cache_len;
			__dbg_mem_dump(pcrypto_adapter->isMemDump, pcrypto_adapter->src_last_cache_line, last_cache_len, "src_data[last_cache_len_below_32]: ");
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)pcrypto_adapter->src_last_cache_line, 32);
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)pcrypto_adapter->src_last_cache_line);
		}

		if (pcrypto_adapter->apl != 0) {
			DBG_CRYPTO_INFO("[Set src_desc_data] pcrypto_adapter->apl = %d\r\n", pcrypto_adapter->apl);
			srcdesc.w = 0;
			srcdesc.d.rs  = 1;
			srcdesc.d.enl = pcrypto_adapter->apl;

			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)padding, 64);
			__dbg_mem_dump(pcrypto_adapter->isMemDump, padding, srcdesc.d.enl, "src_data padding ");
			hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)padding);
		}

		if (phash_pad != NULL) {
			if ((phash_pad != NULL) && (auth_padlen > 0)) {
				uint32_t cache_len;
				if (auth_padlen & 0x1F) {
					cache_len = ((auth_padlen / 32) + 1) * 32;
				} else {
					cache_len = auth_padlen;
				}
				arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)phash_pad, cache_len);
			}
			DBG_CRYPTO_INFO("[Set src_desc_data] pcrypto_adapter->hash_padlen = %d\r\n", pcrypto_adapter->hash_padlen);
			srcdesc.w = 0;
			srcdesc.d.rs  = 1;

			while (auth_padlen > 128) {
				srcdesc.d.apl = 128;

				__dbg_mem_dump(pcrypto_adapter->isMemDump, phash_pad, 128, "MIX_APL[while-loop]: ");
				hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)phash_pad);

				phash_pad += 128;
				auth_padlen -= 128;
				srcdesc.w = 0;
				srcdesc.d.rs = 1;
			}

			if (auth_padlen > 0) {
				DBG_CRYPTO_INFO("[Set src_desc_data] auth_padlen = %d\r\n", auth_padlen);
				if ((CRYPTO_ENGINE_SET_MIX_MODE_SSH_ENC_ESP_DEC == (pcrypto_adapter->mix_mode_type)) ||
					(CRYPTO_ENGINE_SET_MIX_MODE_SSH_DEC_ESP_ENC == (pcrypto_adapter->mix_mode_type))) {
					if (pcrypto_adapter->hashpad_pad == 0) {
						srcdesc.d.ls  = 1;
					}
				}

				srcdesc.d.apl = auth_padlen;
				__dbg_mem_dump(pcrypto_adapter->isMemDump, phash_pad, auth_padlen, "APL[rest]: ");
				hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)phash_pad);
				srcdesc.w = 0;
				srcdesc.d.rs = 1;
			}

			//Handle hash padding issue
			if (pcrypto_adapter->hashpad_pad > 0) {
				DBG_CRYPTO_INFO("[Set src_desc_data] hashpad_pad = %d\r\n", pcrypto_adapter->hashpad_pad);
				if ((CRYPTO_ENGINE_SET_MIX_MODE_SSH_ENC_ESP_DEC == (pcrypto_adapter->mix_mode_type)) ||
					(CRYPTO_ENGINE_SET_MIX_MODE_SSH_DEC_ESP_ENC == (pcrypto_adapter->mix_mode_type))) {
					srcdesc.d.ls  = 1;
				}
				srcdesc.d.apl = pcrypto_adapter->hashpad_pad;

				arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)padding, 64);
				__dbg_mem_dump(pcrypto_adapter->isMemDump, padding, pcrypto_adapter->hashpad_pad, "Hash pad padding ");
				hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)padding);
			}

