swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
		}

		// Only mix_mod ssl_tls_enc could match
		if ((cipher_padlen > 0) && (penc_pad != NULL)) {
			uint32_t cache_len;
			if (cipher_padlen & 0x1F) {
				cache_len = ((cipher_padlen / 32) + 1) * 32;
			} else {
				cache_len = cipher_padlen;
			}
			arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)penc_pad, cache_len);
			DBG_CRYPTO_INFO("[Set src_desc_data] pcrypto_adapter->enc_padlen = %d\r\n", pcrypto_adapter->enc_padlen);
			srcdesc.w = 0;
			srcdesc.d.rs  = 1;
			srcdesc.d.zero = 1;

			while (cipher_padlen > 8) {
				srcdesc.d.a2eo = 8;

				__dbg_mem_dump(pcrypto_adapter->isMemDump, penc_pad, 8, "MIX_EPL[while-loop]: ");
				hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)penc_pad);

				penc_pad += 8;
				cipher_padlen -= 8;
				srcdesc.w = 0;
				srcdesc.d.rs = 1;
				srcdesc.d.zero = 1;
			}

			if (cipher_padlen > 0) {
				DBG_CRYPTO_INFO("[Set src_desc_data] cipher_padlen = %d\r\n", cipher_padlen);
				if (pcrypto_adapter->encpad_pad == 0) {
					srcdesc.d.ls  = 1;
				}

				srcdesc.d.a2eo = cipher_padlen;
				__dbg_mem_dump(pcrypto_adapter->isMemDump, penc_pad, cipher_padlen, "EPL[rest]: ");
				hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)penc_pad);
				srcdesc.w = 0;
				srcdesc.d.rs = 1;
				srcdesc.d.zero = 1;
			}

			//Handle encryption padding issue
			if (pcrypto_adapter->encpad_pad > 0) {
				DBG_CRYPTO_INFO("[Set src_desc_data] encpad_pad = %d\r\n", pcrypto_adapter->encpad_pad);
				srcdesc.d.ls  = 1;
				srcdesc.d.a2eo = pcrypto_adapter->encpad_pad;

				arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)padding, 64);
				__dbg_mem_dump(pcrypto_adapter->isMemDump, padding, pcrypto_adapter->encpad_pad, "Enc pad padding ");
				hal_rtl_crypto_set_srcdesc(pcrypto_adapter, srcdesc.w, (uint32_t)padding);
			}
		}
	}
	ret = hal_rtl_crypto_engine_wait_done(pcrypto_adapter);

	return ret;
}

/**
 *  \fn          void hal_crypto_engine_mix_get_result_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, u8 *pResult,
 *                                                              uint32_t len, u8 *pTag)
 *  \brief       Get crypto cipher result and authetication digest.
 *  \note        For mix mode
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   len Crypto cipher message buffer length
 *  \param[out]  pResult Pointer to crypto cipher result buffer
 *  \param[out]  pTag Pointer to Crypto hash digest buffer
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_engine_mix_get_result(hal_crypto_adapter_t *pcrypto_adapter, u8 *pResult, uint32_t len, u8 *pTag)
{
	if (pResult != NULL) {
		uint32_t dst_len = 0;
		uint32_t first_cache_pos = 0;
		uint32_t first_cache_len = 0;
		uint32_t last_cache_pos  = 0;
		uint32_t last_cache_len  = 0;

		first_cache_pos = (uint32_t)(pResult) & 0x1F;
		first_cache_len = (32 - first_cache_pos) % 32;
		if (first_cache_len >= len) { // the same one
			first_cache_len = len;
			last_cache_len  = 0;
		} else {
			last_cache_pos = ((uint32_t)(pResult) + len - 1) & 0x1F;
			last_cache_len = last_cache_pos + 1;
			if (last_cache_len == 32) {
				last_cache_len = 0;
			}
		}

		DBG_CRYPTO_INFO("[Get cipher_result] f_cache_pos = %d,f_cache_len = %d\r\n", first_cache_pos, first_cache_len);
		DBG_CRYPTO_INFO("[Get cipher_result] l_cache_pos = %d,l_cache_len = %d\r\n", last_cache_pos, last_cache_len);

		if (pcrypto_adapter->is_dst_first_cache_used != 0) {
			arch_invalidate_dcache_by_size(pcrypto_adapter, (uint32_t)(pcrypto_adapter->dst_first_cache_line), 32);
			rtlc_memcpy((void *)(pResult), (const void *)(pcrypto_adapter->dst_first_cache_line), first_cache_len);
			dst_len += first_cache_len;
		}

		//32 byte aligned msg body which doesn't need memcpy
		if (len > (dst_len + last_cache_len)) {
			DBG_CRYPTO_INFO("[Get cipher_result] msg_body_len = %d\r\n", (len - dst_len - last_cache_len));
			arch_invalidate_dcache_by_size(pcrypto_adapter, (uint32_t)(pResult) + dst_len, (len - dst_len - last_cache_len));
		}

		//Handle last_cache_line
		dst_len = len - last_cache_len;
		if (pcrypto_adapter->is_dst_last_cache_used != 0) {
			arch_invalidate_dcache_by_size(pcrypto_adapter, (uint32_t)(pcrypto_adapter->dst_last_cache_line), 32);
			rtlc_memcpy((void *)(pResult + dst_len), (const void *)(pcrypto_adapter->dst_last_cache_line), last_cache_len);
		}
	}
	if (pTag != NULL) {
		arch_invalidate_dcache_by_size(pcrypto_adapter, (uint32_t)(pcrypto_adapter->tag_result), sizeof(pcrypto_adapter->tag_result));
		__dbg_mem_dump(pcrypto_adapter->isMemDump, pcrypto_adapter->tag_result, 32, "tag_result: ");
		rtlc_memcpy((void *)pTag, (const void *)(pcrypto_adapter->tag_result), pcrypto_adapter->digestlen);
	}
}


/**
 *  \fn          int hal_crypto_mix_process_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter,
                                                     IN const u8 isEncrypt, IN const u32 cipher_type,
                                                     IN const u8 *message, IN const u32 msglen,
                                                     IN const u8 *iv, IN const u32 ivlen,
                                                     IN const u8 *aad, IN const u32 aadlen,
                                                     IN const u32 auth_type,
                                                     IN const u8 *hash_pad, IN const u32 hash_padlen,
                                                     IN const u8 *enc_pad, IN const u32 enc_padlen,
                                                     OUT u8 *pResult, OUT u8 *pTag)
 *  \brief       Check input parameters which mix mode needs, and make crypto engine run mix mode algorithm.
 *               After that, get the cipher result and hash digest.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   isEncrypt Indicate that crypto engine now is processing encryption or decryption
 *  \param[in]   cipher_type  Cipher type ID
 *  \param[in]   message Pointer to Crypto cipher message buffer
 *  \param[in]   msglen Crypto cipher message buffer length
 *  \param[in]   iv Pointer to Crypto cipher initial vector buffer
 *  \param[in]   ivlen Crypto cipher initial vector buffer length
 *  \param[in]   aad Pointer to Crypto cipher additional authentication buffer
 *  \param[in]   aadlen Crypto cipher additional authentication buffer length
 *  \param[in]   auth_type  Hash/HMAC type ID
 *  \param[in]   hash_pad Pointer to mix mode hash padding data buffer
 *  \param[in]   hash_padlen Mix mode hash padding data buffer length
 *  \param[in]   enc_pad Pointer to mix mode encryption padding data buffer
 *  \param[in]   enc_padlen Mix mode encryption padding data buffer length
 *  \param[out]  pResult Pointer to Crypto cipher result data
 *  \param[out]  pTag Pointer to Crypto cipher Tag data
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_mix_process(hal_crypto_adapter_t *pcrypto_adapter,
							   IN const u8 isEncrypt,  IN const u32 cipher_type,
							   IN const u8 *message,   IN const u32 msglen,
							   IN const u8 *iv,        IN const u32 ivlen,
							   IN const u8 *aad,       IN const u32 aadlen,
							   IN const u32 auth_type,
							   IN const u8 *hash_pad,  IN const u32 hash_padlen,
							   IN const u8 *enc_pad,   IN const u32 enc_padlen,
							   OUT u8 *pResult,        OUT u8 *pTag)
{

	int ret = SUCCESS;

