swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
	if ((u32)(iv) & 0x1f) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if ((u32)(aad) & 0x1f) {
		return _ERRNO_CRYPTO_ADDR_NOT_32Byte_Aligned;
	}
	if (msglen == 0) {
		return _ERRNO_CRYPTO_MSG_OutRange;
	}

	do {
		if (message == NULL) {
			DBG_CRYPTO_ERR("message is null pointer\r\n");
			ret = _ERRNO_CRYPTO_NULL_POINTER;
			break;
		}

		if (CIPHER_TYPE_FUNC_AES == (cipher_type & CIPHER_TYPE_MASK_FUNC)) { //AES
			DBG_CRYPTO_INFO("msglen non_16_aligned %d bytes\r\n", (msglen % 16));
			if (((msglen % 16) != 0) && (!isEncrypt)) {
				ret = _ERRNO_CRYPTO_AES_MSGLEN_NOT_16Byte_Aligned;
				break;
			}
			if (pResult == NULL) {
				DBG_CRYPTO_ERR("pResult is null pointer\r\n");
				ret = _ERRNO_CRYPTO_NULL_POINTER;
				break;
			}
		}

		if (hash_pad == NULL) {
			DBG_CRYPTO_ERR("Hash_pad is null pointer\r\n");
			ret = _ERRNO_CRYPTO_MIX_MODE_HASH_PAD_NULL_POINTER;
			break;
		}

		if ((CRYPTO_ENGINE_SET_MIX_MODE_SSH_ENC_ESP_DEC == (pcrypto_adapter->mix_mode_type)) ||
			(CRYPTO_ENGINE_SET_MIX_MODE_SSH_DEC_ESP_ENC == (pcrypto_adapter->mix_mode_type))) {
			if (pTag == NULL) {
				DBG_CRYPTO_ERR("pTag is null pointer\r\n");
				ret = _ERRNO_CRYPTO_MIX_MODE_TAG_NULL_POINTER;
				break;
			}
		} else { // Mix_mode ssl_tls_enc
			if (enc_pad == NULL) {
				DBG_CRYPTO_ERR("ENC_pad is null pointer\r\n");
				ret = _ERRNO_CRYPTO_MIX_MODE_ENC_PAD_NULL_POINTER;
				break;
			}
		}

		if (isEncrypt) {
			hal_rtl_crypto_engine_set_encrypt(pcrypto_adapter);
		} else {
			hal_rtl_crypto_engine_set_decrypt(pcrypto_adapter);
		}
		ret = hal_rtl_crypto_engine_mix(pcrypto_adapter, message, msglen, iv, ivlen, aad, aadlen, hash_pad, hash_padlen,
										enc_pad, enc_padlen, pResult, pTag);

		if (ret != SUCCESS) {
			break;
		}

		if (isEncrypt) {
			if ((CRYPTO_ENGINE_SET_MIX_MODE_SSH_ENC_ESP_DEC == (pcrypto_adapter->mix_mode_type)) ||
				(CRYPTO_ENGINE_SET_MIX_MODE_SSH_DEC_ESP_ENC == (pcrypto_adapter->mix_mode_type))) {
				//Encryption may need to modify msglen of destination descriptor,because of padding length
				hal_rtl_crypto_engine_mix_get_result(pcrypto_adapter, pResult, (msglen + (pcrypto_adapter->apl)), pTag);
			} else {
				//CRYPTO_ENGINE_SET_MIX_MODE_SSL_TLS_ENC mode, because of new msglen (plaintext_len + digestlen + enc_padlen)
				hal_rtl_crypto_engine_mix_get_result(pcrypto_adapter, pResult,
													 (msglen + (pcrypto_adapter->digestlen) + (pcrypto_adapter->enc_padlen)), NULL);
			}
		} else {
			hal_rtl_crypto_engine_mix_get_result(pcrypto_adapter, pResult, msglen, pTag);
		}
	} while (0);

	return ret;
}

/**
 *  \fn          int hal_crypto_mix_mode_process_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 mix_mode_type,
                                                          IN const u32 cipher_type,
                                                          IN const u8 *message, IN const u32 msglen,
                                                          IN const u8 *iv, IN const u32 ivlen,
                                                          IN const u8 *aad, IN const u32 aadlen,
                                                          IN const u32 auth_type,
                                                          IN const u8 *hash_pad, IN const u32 hash_padlen,
                                                          IN const u8 *enc_pad,  IN const u32 enc_padlen,
                                                          OUT u8 *pResult, OUT u8 *pTag)
 *  \brief       Check input parameters which mix mode needs(cipher_type,auth_type,mix_mode type and encryption/decryption).
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   mix_mode_type Mix mode type ID
 *  \param[in]   cipher_type  Cipher type ID
 *  \param[in]   message Pointer to Crypto cipher message buffer
 *  \param[in]   msglen Crypto cipher message buffer length
 *  \param[in]   iv Pointer to Crypto cipher initial vector buffer
 *  \param[in]   ivlen Crypto cipher initial vector buffer length
 *  \param[in]   aad Pointer to Crypto cipher additional authentication buffer
 *  \param[in]   aadlen Crypto cipher additional authentication buffer length
 *  \param[in]   auth_type  Hash/HMAC type ID
 *  \param[in]   hash_pad Pointer to mix mode hash padding data buffer
 *  \param[in]   hash_padlen Mix mode hash padding data buffer length
 *  \param[in]   enc_pad Pointer to mix mode encryption padding data buffer
 *  \param[in]   enc_padlen Mix mode encryption padding data buffer length
 *  \param[out]  pResult Pointer to Crypto cipher result data
 *  \param[out]  pTag Pointer to Crypto cipher Tag data
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_mix_mode_process(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 mix_mode_type,
									IN const u32 cipher_type,
									IN const u8 *message, IN const u32 msglen,
									IN const u8 *iv, IN const u32 ivlen,
									IN const u8 *aad, IN const u32 aadlen,
									IN const u32 auth_type,
									IN const u8 *hash_pad, IN const u32 hash_padlen,
									IN const u8 *enc_pad,  IN const u32 enc_padlen,
									OUT u8 *pResult, OUT u8 *pTag)
{
	int ret = SUCCESS;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if ((pcrypto_adapter->cipher_type & CIPHER_TYPE_MASK_ALL) != (cipher_type & CIPHER_TYPE_MASK_ALL)) {
		return _ERRNO_CRYPTO_CIPHER_TYPE_NOT_MATCH;
	}
	if ((pcrypto_adapter->auth_type & AUTH_TYPE_MASK_FUNC_ALL) != (auth_type & AUTH_TYPE_MASK_FUNC_ALL)) {
		return _ERRNO_CRYPTO_AUTH_TYPE_NOT_MATCH;
	}
	pcrypto_adapter->mix_mode_type = (mix_mode_type & CRYPTO_MIX_MODE_MASK_TYPE);

	ret = hal_rtl_crypto_mix_process(pcrypto_adapter, ((CRYPTO_MIX_MODE_MASK_FUNC & mix_mode_type) >> 1),
									 cipher_type, message, msglen,
									 iv, ivlen, aad, aadlen, auth_type, hash_pad, hash_padlen, enc_pad, enc_padlen,
									 pResult, pTag);
	return ret;
}


SECTION_CRYPTO_TEXT
void hal_rtl_crypto_key_byte2word(u32 *p, u8 *s_value)
{
	uint32_t val;
	*p = 0x0;
	val = (((uint32_t)(s_value)[0] << 24)) |
		  (((uint32_t)(s_value)[1] << 16)) |
		  (((uint32_t)(s_value)[2] << 8)) |
		  (((uint32_t)(s_value)[3])) ;

