swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
	*p = val;
}

#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_key_storage_writekey(hal_crypto_adapter_t *pcrypto_adapter, uint8_t *key, uint8_t Key_number, bool _Lock, uint32_t keylen)
{
	u32 lock;
	pKey_storage_t pkey = NULL;
	uint8_t index;
	uint8_t temp_key[32];

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT;
	}

	pkey = (pKey_storage_t)(SK_ADDR + Key_number * (SK_OFFSET));

	for (index = 0; index < 32; index++) {
		if (index < keylen) {
			temp_key[index] = key[index];
		} else {
			temp_key[index] = 0x0;
		}
	}

	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_8), (temp_key + 0 * SECUREKEY_OFFSET));
	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_7), (temp_key + 1 * SECUREKEY_OFFSET));
	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_6), (temp_key + 2 * SECUREKEY_OFFSET));
	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_5), (temp_key + 3 * SECUREKEY_OFFSET));
	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_4), (temp_key + 4 * SECUREKEY_OFFSET));
	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_3), (temp_key + 5 * SECUREKEY_OFFSET));
	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_2), (temp_key + 6 * SECUREKEY_OFFSET));
	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_1), (temp_key + 7 * SECUREKEY_OFFSET));

	pcrypto_adapter->key_buffer |= (1 << Key_number);

	return SUCCESS;
}

#else
/**
 *  \fn          int hal_rtl_crypto_key_storage_writekey(hal_crypto_adapter_t *pcrypto_adapter,
                                                          IN uint8_t* key, IN uint8_t keylen,
                                                          IN uint32_t Key_number)
 *  \brief       Function used to set key storage secure key. CPU can only set secure key and can not read it.
 *  \note        The maximum Key_number is 8 in amebaPro2, keybuffer will be write to 2'b1 in corresponding key place.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   key Pointer to crypto cipher key buffer
 *  \param[in]   keylen Cipher key buffer length
 *  \param[in]   Key_number Secure key number
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_key_storage_writekey(hal_crypto_adapter_t *pcrypto_adapter,
										IN uint8_t *key, IN uint8_t keylen,
										IN uint8_t Key_number)
{
	pKey_storage_t pkey = NULL;
	uint8_t index;
	uint8_t temp_key[32];

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT;
	}
	if (key == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}

	pkey = (pKey_storage_t)(SK_ADDR + Key_number * (SK_OFFSET));

	for (index = 0; index < 32; index++) {
		if (index < keylen) {
			temp_key[index] = key[index];
		} else {
			temp_key[index] = 0x0;
		}
	}

	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_8), (temp_key + 0 * SECUREKEY_OFFSET));
	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_7), (temp_key + 1 * SECUREKEY_OFFSET));
	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_6), (temp_key + 2 * SECUREKEY_OFFSET));
	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_5), (temp_key + 3 * SECUREKEY_OFFSET));
	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_4), (temp_key + 4 * SECUREKEY_OFFSET));
	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_3), (temp_key + 5 * SECUREKEY_OFFSET));
	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_2), (temp_key + 6 * SECUREKEY_OFFSET));
	hal_rtl_crypto_key_byte2word(&(pkey->REG_SKDR_1), (temp_key + 7 * SECUREKEY_OFFSET));

	pcrypto_adapter->key_buffer |= (1 << Key_number);

	return SUCCESS;
}
#endif

#if IS_CUT_TEST(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_key_storage_lock(hal_crypto_adapter_t *pcrypto_adapter, uint8_t Key_number, bool _Lock)
{
	u32 lock;
	pKey_storage_t pkey = NULL;
	uint8_t index;
	uint8_t temp_key[32];

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT;
	}

	if (_Lock == _TRUE) {
		lock = HAL_READ32(key_lock, 0x0);
		lock = (lock | (1 << Key_number));
		HAL_WRITE32(key_lock, 0x0, lock);
	}

	return SUCCESS;
}

#else
/**
*  \fn          int hal_rtl_crypto_key_storage_lock(hal_crypto_adapter_t *pcrypto_adapter,
                                                    IN uint8_t Key_number, IN bool _Lock)
*  \brief       Function used to lock key storage secure key. If the key is locked, then it can not be changed anymore.
*  \note        The lock can not be opened. Once it locked, the bit can not be cleared.
*  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
*  \param[in]   Key_number Secure key number
*  \return      value == 0     success
*  \return      value < 0      fail(error code)
*/
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_key_storage_lock(hal_crypto_adapter_t *pcrypto_adapter,
									IN uint8_t Key_number)
{
	u32 lock;

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT;
	}

	lock = HAL_READ32(key_lock, 0x0);
	lock = (lock | (1 << Key_number));
	HAL_WRITE32(key_lock, 0x0, lock);

	pcrypto_adapter->user_key_lock |= (1 << Key_number);

	return SUCCESS;
}
#endif

/**
*  \fn          int hal_rtl_crypto_key_storage_writeback(hal_crypto_adapter_t *pcrypto_adapter,
                                                         IN uint8_t Keynumber, IN bool _IsWriteback)
*  \brief       Function used to set key storage use writeback mode.
*  \note        Only valid in SHA256 / HMAC SHA256
*  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
*  \param[in]   Key_number Secure key number
*  \param[in]   _IsWriteback Set write back mode or not
*  \return      value == 0     success
*  \return      value < 0      fail(error code)
*/
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_key_storage_writeback(hal_crypto_adapter_t *pcrypto_adapter,
		IN uint8_t Keynumber, IN bool _IsWriteback)
{
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT;
	}

	if (_IsWriteback == _TRUE) {
		pcrypto_adapter->is_writeback = 1;
		pcrypto_adapter->index_writeback = Keynumber;
	} else {
		pcrypto_adapter->is_writeback = 0;
	}

	return SUCCESS;
}

#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_key_stg_wb_sel(hal_crypto_adapter_t *pcrypto_adapter, hal_crypto_wb_cfg_t *pkey_cfg)
{
	int ret = SUCCESS;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT;
	}
	//dbg_printf("wb sel 0x%x, idx=0x%x \r\n",pkey_cfg->b.sel,pkey_cfg->b.idx);
	switch (pkey_cfg->b.sel) {
	case KEY_STG_WBTYPE_WB_ONLY_BUF:
		pcrypto_adapter->is_writeback = CRYPTO_KEY_STG_WB_SK_DIS;
		pcrypto_adapter->index_writeback = KEY_STG_SK_IDX_NONE;
		break;
	case KEY_STG_WBTYPE_WB_ONLY_STG:
		pcrypto_adapter->is_writeback = CRYPTO_KEY_STG_WB_SK_EN;
		pcrypto_adapter->index_writeback = pkey_cfg->b.idx;
		break;
	case KEY_STG_WBTYPE_WB_STG_BUF:
		pcrypto_adapter->is_writeback = CRYPTO_KEY_STG_WB_SK_EN;
		pcrypto_adapter->index_writeback = pkey_cfg->b.idx;
		break;
	default:
		pcrypto_adapter->is_writeback = CRYPTO_KEY_STG_WB_SK_DIS;
		pcrypto_adapter->index_writeback = KEY_STG_SK_IDX_NONE;
		break;
	}
	pcrypto_adapter->wb_key_cfg = *pkey_cfg;
	return ret;
}

SECTION_CRYPTO_TEXT
int hal_rtl_crypto_key_stg_sk_sel(hal_crypto_adapter_t *pcrypto_adapter, hal_crypto_key_cfg_t *pkey_cfg)
{
	int ret = SUCCESS;
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT;
	}
	switch (pkey_cfg->b.sel) {
	case KEY_STG_SKTYPE_LD_NOKEY:
		pcrypto_adapter->is_securekey = CRYPTO_KEY_STG_LD_SK_DIS;
		pcrypto_adapter->index_securekey = KEY_STG_SK_IDX_NONE;
		break;
	case KEY_STG_SKTYPE_LD_SK:
		pcrypto_adapter->is_securekey = CRYPTO_KEY_STG_LD_SK_EN;
		pcrypto_adapter->index_securekey = pkey_cfg->b.idx;
		break;
	case KEY_STG_SKTYPE_LD_KEYBUF:
		pcrypto_adapter->is_securekey = CRYPTO_KEY_STG_LD_SK_DIS;
		pcrypto_adapter->index_securekey = KEY_STG_SK_IDX_NONE;
		break;
	default:
		pcrypto_adapter->is_securekey = CRYPTO_KEY_STG_LD_SK_DIS;
		pcrypto_adapter->index_securekey = KEY_STG_SK_IDX_NONE;
		break;
	}
	pcrypto_adapter->ld_key_cfg = *pkey_cfg;
	return ret;
}
#endif

/**
*  \fn          int hal_rtl_crypto_key_storage_securekey(hal_crypto_adapter_t *pcrypto_adapter,
                                                         IN uint8_t Keynumber, IN bool _UseKey)
*  \brief       Function used to set key storage use secure key mode.
*  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
*  \param[in]   Key_number Secure key number
*  \param[in]   _UseKey Set secure key mode or not
*  \return      value == 0     success
*  \return      value < 0      fail(error code)
*/
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_key_storage_securekey(hal_crypto_adapter_t *pcrypto_adapter,
		IN uint8_t Keynumber, IN bool _UseKey)
{
	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT;
	}

	if (_UseKey == _TRUE) {
		pcrypto_adapter->is_securekey = 1;
		pcrypto_adapter->index_securekey = Keynumber;
	} else {
		pcrypto_adapter->is_securekey = 0;
	}

	return SUCCESS;
}

/**
 *  \fn          int rtl_crypto_poly1305_s(IN const u8* message, IN const u32 msglen, IN const u8* key, OUT u8* pDigest)
 *  \brief       Initialize and process poly1305, call \ref rtl_crypto_poly1305_init_s() and \ref rtl_crypto_poly1305_process_s().
 *  \note        Poly1305 is a hash algorithm, but use cipher algorithm procedure to process it.
 *  \param[in]   message Pointer to poly1305 message buffer
 *  \param[in]   msglen Poly1305 message buffer length
 *  \param[in]   key  Pointer to poly1305 key buffer
 *  \param[out]  pDigest Pointer to Crypto poly1305 digest buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_poly1305(
	IN hal_crypto_adapter_t *pcrypto_adapter,
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *key,
	OUT u8 *pDigest)
{
	int ret;


	ret = hal_rtl_crypto_poly1305_init(pcrypto_adapter, key);
	if (ret != SUCCESS) {
		return ret;
	}

	ret = hal_rtl_crypto_poly1305_process(pcrypto_adapter, message, msglen, pDigest);

	return ret;
}

/**
 *  \fn          int rtl_crypto_poly1305_init_s(IN const u8 *key)
 *  \brief       Initialize poly1305, call \ref rtl_crypto_cipher_init(): Initialize crypto cipher algorithms.
 *  \note        Poly1305 is a hash algorithm, but use cipher algorithm procedure to process it.
 *  \param[in]   key  Pointer to poly1305 key buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_poly1305_init(IN hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *key)
{
	return hal_rtl_crypto_cipher_init(pcrypto_adapter, CIPHER_TYPE_POLY1305, key, 32);
}

/**
 *  \fn          int rtl_crypto_poly1305_process_s(IN const u8 *message, IN const u32 msglen, OUT u8 *pDigest)
 *  \brief       Process poly1305, call \ref rtl_crypto_cipher_process(): Process crypto cipher algorithms.
 *  \note        Poly1305 is a hash algorithm, but use cipher algorithm procedure to process it.
 *  \param[in]   message Pointer to poly1305 message buffer
 *  \param[in]   msglen Poly1305 message buffer length
 *  \param[out]  pDigest Pointer to Crypto poly1305 digest buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_poly1305_process(
	IN hal_crypto_adapter_t *pcrypto_adapter,
	IN const u8 *message, IN const u32 msglen,
	OUT u8 *pDigest)
{
	return hal_rtl_crypto_cipher_process(pcrypto_adapter, TYPE_DECRYPT, CIPHER_TYPE_POLY1305,
										 message, msglen, NULL, 0, NULL, 0, NULL, pDigest);


