swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
}

// CHACHA
//
/**
 *  \fn          int rtl_crypto_chacha_init_s(IN const u8* key)
 *  \brief       Initialize chacha20, call \ref rtl_crypto_cipher_init(): Initialize crypto cipher algorithms.
 *  \param[in]   key  Pointer to crypto cipher key buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_chacha_init(IN hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *key)
{
	return hal_rtl_crypto_cipher_init(pcrypto_adapter, CIPHER_TYPE_CHACHA, key, 32);
}

/**
 *  \fn          int rtl_crypto_chacha_encrypt_s(IN const u8* message, IN const u32 msglen, IN const u8* iv,
 *                                               IN const u32 count, OUT u8* pResult)
 *  \brief       Encrypt chacha20, call \ref rtl_crypto_cipher_process(): Process crypto cipher algorithms.
 *  \param[in]   message Pointer to crypto plaintext message buffer
 *  \param[in]   msglen Crypto plaintext message buffer length
 *  \param[in]   iv Pointer to initial vector buffer
 *  \param[in]   count Chacha20 count begin value
 *  \param[out]  pResult Pointer to Crypto result buffer(ciphertext)
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_chacha_encrypt(
	IN hal_crypto_adapter_t *pcrypto_adapter,
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *iv,        IN const u32 count,
	OUT u8 *pResult)
{
	return hal_rtl_crypto_cipher_process(pcrypto_adapter, TYPE_ENCRYPT, CIPHER_TYPE_CHACHA,
										 message, msglen, iv, count, NULL, 0, pResult, NULL);
}

/**
 *  \fn          int rtl_crypto_chacha_decrypt_s(IN const u8* message, IN const u32 msglen, IN const u8* iv,
 *                                               IN const u32 count, OUT u8* pResult)
 *  \brief       Decrypt chacha20, call \ref rtl_crypto_cipher_process(): Process crypto cipher algorithms.
 *  \param[in]   message Pointer to crypto ciphertext message buffer
 *  \param[in]   msglen Crypto ciphertext message buffer length
 *  \param[in]   iv Pointer to initial vector buffer
 *  \param[in]   count Chacha20 count begin value
 *  \param[out]  pResult Pointer to Crypto result buffer(plaintext)
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_chacha_decrypt(
	IN hal_crypto_adapter_t *pcrypto_adapter,
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *iv,        IN const u32 count,
	OUT u8 *pResult)
{
	return hal_rtl_crypto_cipher_process(pcrypto_adapter, TYPE_DECRYPT, CIPHER_TYPE_CHACHA,
										 message, msglen, iv, count, NULL, 0, pResult, NULL);
}

/**
 *  \fn          int rtl_crypto_chacha_poly1305_init_s(IN const u8* key)
 *  \brief       Initialize chacha_poly1305, call \ref rtl_crypto_cipher_init(): Initialize crypto cipher algorithms.
 *  \param[in]   key  Pointer to crypto cipher key buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_chacha_poly1305_init(IN hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *key)
{
	return hal_rtl_crypto_cipher_init(pcrypto_adapter, CIPHER_TYPE_CHACHA_POLY1305, key, 32);
}

/**
 *  \fn          int rtl_crypto_chacha_poly1305_encrypt_s(IN const u8* message, IN const u32 msglen, IN const u8* nonce,
 *                                                        IN const u8* aad, IN const u32 aadlen, OUT u8* pResult, OUT u8 *pTag)
 *  \brief       Encrypt chacha_poly1305, call \ref rtl_crypto_cipher_process(): Process crypto cipher algorithms.
 *  \param[in]   message Pointer to crypto plaintext message buffer
 *  \param[in]   msglen Crypto plaintext message buffer length
 *  \param[in]   nonce Pointer to number only used once buffer
 *  \param[in]   aad Pointer to additional authentication data buffer
 *  \param[in]   aadlen Additional authentication data buffer length
 *  \param[out]  pResult Pointer to Crypto result buffer(ciphertext)
 *  \param[out]  pTag Pointer to authentication tag buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_chacha_poly1305_encrypt(
	IN hal_crypto_adapter_t *pcrypto_adapter,
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *nonce,
	IN const u8 *aad, IN const u32 aadlen,
	OUT u8 *pResult, OUT u8 *pTag)
{
	return hal_rtl_crypto_cipher_process(pcrypto_adapter, TYPE_ENCRYPT, CIPHER_TYPE_CHACHA_POLY1305,
										 message, msglen, nonce, 16, aad, aadlen, pResult, pTag);
}

/**
 *  \fn          int rtl_crypto_chacha_poly1305_decrypt_s(IN const u8* message, IN const u32 msglen, IN const u8* nonce,
 *                                                        IN const u8* aad, IN const u32 aadlen, OUT u8* pResult, OUT u8 *pTag)
 *  \brief       Decrypt chacha_poly1305, call \ref rtl_crypto_cipher_process(): Process crypto cipher algorithms.
 *  \param[in]   message Pointer to crypto ciphertext message buffer
 *  \param[in]   msglen Crypto ciphertext message buffer length
 *  \param[in]   nonce Pointer to number only used once buffer
 *  \param[in]   aad Pointer to additional authentication data buffer
 *  \param[in]   aadlen Additional authentication data buffer length
 *  \param[out]  pResult Pointer to Crypto result buffer(plaintext)
 *  \param[out]  pTag Pointer to authentication tag buffer
 *  \return      value == 0     success
 *  \return      value < 0      fail(error code)
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_chacha_poly1305_decrypt(
	IN hal_crypto_adapter_t *pcrypto_adapter,
	IN const u8 *message,   IN const u32 msglen,
	IN const u8 *nonce,
	IN const u8 *aad, IN const u32 aadlen,
	OUT u8 *pResult, OUT u8 *pTag)
{
	return hal_rtl_crypto_cipher_process(pcrypto_adapter, TYPE_DECRYPT, CIPHER_TYPE_CHACHA_POLY1305,
										 message, msglen, nonce, 16, aad, aadlen, pResult, pTag);
}

SECTION_CRYPTO_TEXT
void hal_rtl_crypto_cache(IN phal_crypto_adapter_t pcrypto_adapter, IN void *dcache_clean_function, IN void *dcache_invalidate_function)
{
	if (dcache_clean_function == NULL) {
		pcrypto_adapter->arch_clean_dcache_by_size = (void (*)(uint32_t, int32_t))rtl_dcache_clean_by_addr;
	} else {
		pcrypto_adapter->arch_clean_dcache_by_size = (void (*)(uint32_t, int32_t))dcache_clean_function;
	}

	if (dcache_clean_function == NULL) {
		pcrypto_adapter->arch_invalidate_dcache_by_size = (void (*)(uint32_t, int32_t))rtl_dcache_invalidate_by_addr;
	} else {
		pcrypto_adapter->arch_invalidate_dcache_by_size = (void (*)(uint32_t, int32_t))dcache_invalidate_function;
	}
}



//#if defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE == 1)
//#if 1
#if !defined(CONFIG_BUILD_NONSECURE)

//
// CRC
//

//
// crc32
//
//#define CRC_DMA_MODE 1
//#define CRC_POLLING  0

/**
 *  \fn          uint8_t hal_crc_isbusy_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter)
 *  \brief       Check whether crc engine is busy.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      regValue The value of the register
 */
SECTION_CRYPTO_TEXT
uint8_t hal_rtl_crypto_crc_isbusy_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter)
{
	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	volatile uint8_t regValue;

	regValue = pcrypto->crc_stat_reg_b.busy;

	return regValue;
}

/**
 *  \fn          void hal_crc_set_dma_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, u8 enabled)
 *  \brief       Enable/Disable CRC engine DMA mode.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   enabled Enable/Disable CRC engine DMA mode: 1=enable, 0=disable
 *  \return      void
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_crc_set_dma_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, u8 enabled)
{
	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	volatile uint32_t regValue;

	regValue = pcrypto->crc_op_reg;

	if (enabled) {
		regValue |= CRC_104_DMA;
	} else {
		regValue &= ~((uint32_t)(CRC_104_DMA));
	}

	pcrypto->crc_op_reg = regValue;
}


/**
 *  \fn          void hal_crc_set_swap_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, u8 iswap_type, u8 oswap)
 *  \brief       Write the input swap and output swap value to the CRC operation register.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   iswap_type The input swap value that is ready to write
 *  \param[in]   oswap The output swap value that is ready to write
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_crc_set_swap_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, u8 iswap_type, u8 oswap)
{
	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	volatile uint32_t regValue;

	regValue = pcrypto->crc_op_reg;

	//
	regValue &= ~((uint32_t)(0xF));
	regValue |= ((uint32_t)(iswap_type)) & 0x7;
	regValue |= ((uint32_t)(oswap & 0x1)) << 3;
	//

	pcrypto->crc_op_reg = regValue;
}

/**
 *  \fn          void hal_crc_set_crc_type_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, u8 crc_data_type)
 *  \brief       Write the crc type to the CRC operation register.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   crc_data_type The crc type(depends on crc bit value)that is ready to write
 *               - 32 bits: 3'd0
 *               - 24 bits: 3'd1
 *               - 16 bits: 3'd2
 *               - 12 bits: 3'd3
 *               - 10 bits: 3'd4
 *               -  8 bits: 3'd5
 *               -  7 bits: 3'd6
 *               -  5 bits: 3'd7
 *  \return      void
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_crc_set_crc_type_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, u8 crc_data_type)
{
	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	volatile uint32_t regValue;

	regValue = pcrypto->crc_op_reg;

	//
	regValue &= ~(((uint32_t)(0x7)) << 4);
	regValue |= (crc_data_type & 0x7) << 4;

	pcrypto->crc_op_reg = regValue;
}

/**
 *  \fn          void hal_crc_set_byte_type_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, u8 byte_type)
 *  \brief       Write the crc type to the CRC operation register.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   byte_type The byte type that is ready to write
 *               - 32 bits: 2'd0
 *               - 24 bits: 2'd3
 *               - 16 bits: 2'd2
 *               - 8 bits:  2'd1
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_crc_set_byte_type_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, u8 byte_type)
{
	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	volatile uint32_t regValue;

	regValue = pcrypto->crc_op_reg;

	regValue &= ~(((uint32_t)(0x3)) << 8);
	regValue |= (uint32_t)(byte_type & 0x3) << 8;

	pcrypto->crc_op_reg = regValue;
}


/**
 *  \fn          void hal_crc_set_data_length_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, uint32_t data_len)
 *  \brief       Write the data length(bytes) to the CRC operation register.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   data_len The data length(bytes) that is ready to write
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_crc_set_data_length_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, uint32_t data_len)
{
	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	volatile uint32_t regValue;

	regValue = pcrypto->crc_op_reg;

	regValue &= ~((uint32_t)0xFFFFF000);

	if (data_len != 0) { // not last
		regValue |= data_len << 16;
	} else {
		regValue |= 0x1000;
	}

	//dbg_printf("pcrypto->crc_op_reg %x\r\n", regValue);
	pcrypto->crc_op_reg = regValue;
}


