swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
#if 0
void check_registers(hal_crypto_adapter_t *pcrypto_adapter)
{
	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	volatile uint32_t regValue;
	uint32_t crc_length;
	uint32_t crc_last;
	uint32_t crc_be;
	uint32_t crc_dma;
	uint32_t crc_sel;
	uint32_t crc_oswap;
	uint32_t crc_iswap;
	uint32_t crc_SDBP;
	uint32_t crc_oxor;
	uint32_t crc_poly;
	uint32_t crc_init;


	regValue = pcrypto->crc_op_reg;
	dbg_printf("[0x104] : 0x%x \r\n", regValue);
	crc_length = regValue >> 16;
	crc_last = (regValue >> 12) & 0x1;
	crc_be = (regValue >> 8) & 0x3;
	crc_dma = (regValue >> 7) & 0x1;
	crc_sel = (regValue >> 4) & 0x7;
	crc_oswap = (regValue >> 3) & 0x1;
	crc_iswap = (regValue) & 0x7;


	crc_SDBP = pcrypto->crc_data_reg;
	crc_oxor = pcrypto->crc_oxor_reg;
	crc_poly = pcrypto->crc_poly_reg;;
	crc_init = pcrypto->crc_iv_reg;;

	dbg_printf("DMA: 0x%x \r\n", crc_dma);
	dbg_printf("SDBP: 0x%x \r\n", crc_SDBP);
	dbg_printf("len: 0x%x \r\n", crc_length);
	dbg_printf("last: 0x%x \r\n", crc_last);
	dbg_printf("be: 0x%x \r\n", crc_be);
	dbg_printf("oxor: 0x%x \r\n", crc_oxor);
	dbg_printf("poly: 0x%x \r\n", crc_poly);
	dbg_printf("init: 0x%x \r\n", crc_init);
	dbg_printf("iswap: 0x%x \r\n", crc_iswap);
	dbg_printf("oswap: 0x%x \r\n", crc_oswap);
	dbg_printf("sel: 0x%x \r\n", crc_sel);
}
#endif

/**
 *  \fn          void read_crc_setting_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter)
 *  \brief       Read the current crc setting values(\b Order, \b Refout, \b Refin, \b XOR, \b Initial_Value, \b Polynomial)
 *               from crc registers .
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      none
 */
SECTION_CRYPTO_TEXT
void hal_rtl_crypto_read_crc_setting(hal_crypto_adapter_t *pcrypto_adapter)
{
	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	volatile uint32_t regValue;

	regValue = pcrypto->crc_op_reg;
	DBG_CRYPTO_INFO("[0x104] : 0x%x \r\n", regValue);

	pcrypto_adapter->crc_sel = (regValue >> 4) & 0x7;
	pcrypto_adapter->crc_oswap = (regValue >> 3) & 0x1;
	pcrypto_adapter->crc_iswap = (regValue) & 0x7;

	pcrypto_adapter->crc_oxor = pcrypto->crc_oxor_reg;
	pcrypto_adapter->crc_init = pcrypto->crc_iv_reg;
	pcrypto_adapter->crc_poly = pcrypto->crc_poly_reg;
#if 1
	DBG_CRYPTO_INFO("sel: 0x%x \r\n", pcrypto_adapter->crc_sel);
	DBG_CRYPTO_INFO("poly: 0x%x \r\n", pcrypto_adapter->crc_poly);
	DBG_CRYPTO_INFO("init: 0x%x \r\n", pcrypto_adapter->crc_init);
	DBG_CRYPTO_INFO("oxor: 0x%x \r\n", pcrypto_adapter->crc_oxor);
	DBG_CRYPTO_INFO("iswap: 0x%x \r\n", pcrypto_adapter->crc_iswap);
	DBG_CRYPTO_INFO("oswap: 0x%x \r\n", pcrypto_adapter->crc_oswap);
#endif
}

/**
 *  \fn          int hal_crypto_crc_wait_done_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter)
 *  \brief       CRC command mode uses the polling way to check crc interrupt. If it waits over timeout value, then return FAIL.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      value ==  0     success
 *  \return      value == -1     fail
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_crc_wait_done(hal_crypto_adapter_t *pcrypto_adapter)
{
	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	volatile uint32_t regValue;
	uint32_t i;

	i = 0;
	while (i < CRC_TIMEOUT) {
		regValue = pcrypto->crc_stat_reg;
		if (regValue & CRC_118_INTR) {
			break;
		}
		i++;
	}
	if (i == CRC_TIMEOUT) {
		DBG_CRYPTO_ERR("CRC wait done failed \r\n");
		return FAIL;
	} else {
		regValue = pcrypto->crc_result_reg;
		//dbg_printf("%s : 0x%x \r\n", __FUNCTION__, regValue);
		//clear interrupt
		//HAL_CRYPTO_WRITE32(REG_CRC_STAT, CRC_118_INTR);
		pcrypto->crc_stat_reg_b.crc_ok = 1;
	}
	return SUCCESS;
}


/**
 *  \fn          uint32_t  hal_crypto_crc_get_result_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter)
 *  \brief       Read crc result register, and return the crc result value.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \return      regValue Get crc result value
 */
SECTION_CRYPTO_TEXT
uint32_t  hal_rtl_crypto_crc_get_result(hal_crypto_adapter_t *pcrypto_adapter)
{
	CRYPTO_Type *pcrypto;
	pcrypto = pcrypto_adapter->base_addr;
	volatile uint32_t regValue;

	regValue = pcrypto->crc_result_reg;

	return regValue;
}

/**
 *  \fn          int hal_crypto_crc_setting_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN int order,
 *                                                   IN uint32_t polynom, IN uint32_t crcinit, IN uint32_t crcxor,
 *                                                   IN uint32_t refin, IN uint32_t refout)
 *  \brief       Set the basic parameters that crc algorithm needs to crc registers.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   order CRC polynomial order
 *  \param[in]   polynom CRC polynomial coefficients
 *  \param[in]   crcinit CRC initial value
 *  \param[in]   crcxor CRC XOR output value
 *  \param[in]   refin CRC input swap value
 *  \param[in]   refout CRC output swap value
 *  \return      value ==  0     success
 *  \return      value == -1     fail
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_crc_setting(hal_crypto_adapter_t *pcrypto_adapter,
							   IN int order, IN uint32_t polynom, IN uint32_t crcinit, IN uint32_t crcxor, IN uint32_t refin, IN uint32_t refout)
{
	u8 crc_data_type;
	u8 iswap, oswap;
	CRYPTO_Type *pcrypto;
	volatile uint32_t regValue;

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if ((pcrypto_adapter->base_addr) == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	} else {
		pcrypto = pcrypto_adapter->base_addr;
	}

	// check if busy
	if (hal_rtl_crypto_crc_isbusy_rtl8710c(pcrypto_adapter)) {
		DBG_CRYPTO_ERR("CRC engine is busy\r\n");
		return FAIL;
	}

	// check polynom
	if ((polynom & 0x1) != 0x1) {
		DBG_CRYPTO_ERR("CRC poly needs to be odd\r\n");
		return FAIL;
	}
	pcrypto->crc_poly_reg = polynom;
	DBG_CRYPTO_INFO("polynom %x\r\n", polynom);
	regValue = pcrypto->crc_poly_reg;
	DBG_CRYPTO_INFO("REG_CRC_POLY: 0x%x \r\n", regValue);
	if (regValue == 0) {
		return FAIL;
	}

