swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
	// init
	pcrypto->crc_iv_reg = crcinit;

	// oxor
	pcrypto->crc_oxor_reg = crcxor;

	// refin , refout
	iswap = (refin) ? 4 : 0;
	oswap = (refout) ? 1 : 0;
	hal_rtl_crypto_crc_set_swap_rtl8710c(pcrypto_adapter, iswap, oswap);

	// sel
	// order : crc type
	pcrypto_adapter->crc_order = order;
	switch (order) {
	case 32:
		crc_data_type = 0;
		break;
	case 24:
		crc_data_type = 1;
		break;
	case 16:
		crc_data_type = 2;
		break;
	case 12:
		crc_data_type = 3;
		break;
	case 10:
		crc_data_type = 4;
		break;
	case 8:
		crc_data_type = 5;
		break;
	case 7:
		crc_data_type = 6;
		break;
	case 5:
		crc_data_type = 7;
		break;
	default:
		DBG_CRYPTO_ERR("CRC order : %d not support \r\n", order);
		return FAIL;
	}
	hal_rtl_crypto_crc_set_crc_type_rtl8710c(pcrypto_adapter, crc_data_type);

	return SUCCESS;
}

/**
 *  \fn          int hal_crypto_crc_cmd_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u8* message, IN const uint32_t msglen)
 *  \brief       Use CRC command mode to calculate this crc message buffer.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   message Pointer to CRC message buffer
 *  \param[in]   msglen The crc message buffer length
 *  \return      value ==  0     success
 *  \return      value == -1     fail
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_crc_cmd(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen)
{
#if 1

	CRYPTO_Type *pcrypto;
	int ret = SUCCESS;

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if ((pcrypto_adapter->base_addr) == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	} else {
		pcrypto = pcrypto_adapter->base_addr;
	}
	// check if busy
	if (hal_rtl_crypto_crc_isbusy_rtl8710c(pcrypto_adapter)) {
		DBG_CRYPTO_ERR("[CRC_CMD] CRC engine is busy\r\n");
		return FAIL;
	}

	uint32_t data;
	int msglen_4bytes;
	int i;

	hal_rtl_crypto_crc_set_dma_rtl8710c(pcrypto_adapter, 0);

	// set data length
	hal_rtl_crypto_crc_set_data_length_rtl8710c(pcrypto_adapter, msglen);

	//crc start polling
	// MSK : disable intr
	pcrypto->crc_stat_reg_b.crc_ok = 1;
	pcrypto->crc_stat_reg_b.crc_intr_mask = 1;
	pcrypto->crc_stat_reg_b.crc_little_endian = 1;

	// reset crc engine
	pcrypto->crc_rst_reg = 0x1;

	/***********************************************
	 * Note:
	 * Command mode need process 4bytes and 1 byte whether the msglen is only 4 times.
	 *
	 ************************************************/

	//32 bit
	hal_rtl_crypto_crc_set_byte_type_rtl8710c(pcrypto_adapter, 0);

	msglen_4bytes = (msglen / 4) * 4;
	//msglen_rest = msglen - msglen_4bytes;
	DBG_CRYPTO_INFO("[CRC_CMD] msglen_4bytes = %d\r\n", msglen_4bytes);

	for (i = 0; i < msglen_4bytes; i += 4) {
		data = (uint32_t)(message[i]);
		data |= (uint32_t)(message[i + 1]) << 8;
		data |= (uint32_t)(message[i + 2]) << 16;
		data |= (uint32_t)(message[i + 3]) << 24;

		pcrypto->crc_data_reg = data;
	}

	DBG_CRYPTO_INFO("[CRC_CMD] msglen_rest = %d, count_byte = %d\r\n", (msglen - msglen_4bytes), i);
	if ((msglen - msglen_4bytes) > 0) {
		//8bit
		hal_rtl_crypto_crc_set_byte_type_rtl8710c(pcrypto_adapter, 1);
		for (; (uint32_t)(i) < msglen; i++) {
			data = message[i];
			pcrypto->crc_data_reg = data;
		}
	} else if ((msglen - msglen_4bytes) == 0) {
		//8bit
		hal_rtl_crypto_crc_set_byte_type_rtl8710c(pcrypto_adapter, 1);
		data = 0;
		pcrypto->crc_data_reg = data;
	}

	// polling way to check interrupt
	ret = hal_rtl_crypto_crc_wait_done(pcrypto_adapter);
	return ret;

#else

	CRYPTO_Type *pcrypto;
	int ret = SUCCESS;

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if ((pcrypto_adapter->base_addr) == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	} else {
		pcrypto = pcrypto_adapter->base_addr;
	}
	// check if busy
	if (hal_rtl_crypto_crc_isbusy_rtl8710c(pcrypto_adapter)) {
		dbg_printf("[CRC_CMD] CRC engine is busy\r\n");
		return FAIL;
	}

	uint32_t data;
	int msglen_4bytes;
	int i;

	hal_crc_set_dma_rtl8710c(pcrypto_adapter, 0);

	// set data length
	hal_crc_set_data_length_rtl8710c(pcrypto_adapter, msglen);

	//crc start polling
	// MSK : disable intr
	//dbg_printf("crc_stat_reg %x\r\n", pcrypto->crc_stat_reg);
	pcrypto->crc_stat_reg_b.crc_ok = 1;
	pcrypto->crc_stat_reg_b.crc_intr_mask = 1;
	pcrypto->crc_stat_reg_b.crc_little_endian = 1;
	//dbg_printf("crc_stat_reg %x\r\n", pcrypto->crc_stat_reg);

	// reset crc engine
	pcrypto->crc_rst_reg = 0x1;
	//dbg_printf("crc_stat_reg %x\r\n", pcrypto->crc_stat_reg);

	/***********************************************
	 * Note:
	 * Command mode need process 4bytes and 1 byte whether the msglen is only 4 times.
	 *
	 ************************************************/

	//32 bit
	hal_crc_set_byte_type_rtl8710c(pcrypto_adapter, 0);

	msglen_4bytes = (msglen / 4) * 4;
	//msglen_rest = msglen - msglen_4bytes;
	dbg_printf("[CRC_CMD] msglen_4bytes = %d\r\n", msglen_4bytes);

	for (i = 0; i < msglen_4bytes; i += 4) {
		data = (uint32_t)(message[i]);
		data |= (uint32_t)(message[i + 1]) << 8;
		data |= (uint32_t)(message[i + 2]) << 16;
		data |= (uint32_t)(message[i + 3]) << 24;

		pcrypto->crc_data_reg = data;
	}

	dbg_printf("[CRC_CMD] msglen_rest = %d, count_byte = %d\r\n", (msglen - msglen_4bytes), i);
	if ((msglen - msglen_4bytes) > 0) {
		//8bit
		hal_crc_set_byte_type_rtl8710c(pcrypto_adapter, 1);
		for (; (uint32_t)(i) < msglen; i++) {
			data = message[i];
			pcrypto->crc_data_reg = data;
		}
	} else if ((msglen - msglen_4bytes) == 0) {
		//8bit
		hal_crc_set_byte_type_rtl8710c(pcrypto_adapter, 1);
		data = 0;
		pcrypto->crc_data_reg = data;
	}

	// polling way to check interrupt
	ret = hal_rtl_crypto_crc_wait_done(pcrypto_adapter);
	return ret;

#endif
}



/**
 *  \fn          int hal_crypto_crc32_cmd_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u8* message, IN const uint32_t msglen)
 *  \brief       Use CRC command mode and crc32 type to calculate this crc message buffer.
 *  \details     It will call \ref hal_crypto_crc_setting_rtl8710c() to set crc32 type parameters,
 *               then call \ref hal_crypto_crc_cmd_rtl8710c() to calculate this crc message data via Command mode.
 *               crc32 type: \n
 *               - order: 32
 *               - polynomial: 0x4c11DB7
 *               - crcinit: 0xFFFFFFFF
 *               - crcxor: 0xFFFFFFFF
 *               - refin: true
 *               - refout: true
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   message Pointer to CRC message buffer
 *  \param[in]   msglen The crc message buffer length
 *  \return      value ==  0     success
 *  \return      value == -1     fail
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_crc32_cmd(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen)
{
	int ret;

	ret = hal_rtl_crypto_crc_setting(pcrypto_adapter, 32, 0x4c11DB7, 0xFFFFFFFF, 0xFFFFFFFF, 1, 1);
	if (ret != SUCCESS) {
		return ret;
	}

