swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
	ret = hal_rtl_crypto_crc_cmd(pcrypto_adapter, message, msglen);
	return ret;
}

//#else

/**
 *  \fn          int hal_crypto_crc_dma_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u8* message, IN const uint32_t msglen)
 *  \brief       Use CRC DMA mode to calculate this crc message buffer.
 *  \note        DMA mode need to check whether is 32bytes alignment, because of cache clean.
 *               - If it's not-32bytes alignment address,but the space in cache line is enough for message,
 *               then copy message to a 32bytes aligment address and jump to dma_process.
 *               - If it's not-32bytes alignment address,and the space in cache line isn't enough for message,
 *               then do cmd mode preprocess, after that jump to dma_process.
 *               - If it's 32bytes alignment address, do dma_proces directly.
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   message Pointer to CRC message buffer
 *  \param[in]   msglen The crc message buffer length
 *  \return      value ==  0     success
 *  \return      value == -1     fail
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_crc_dma(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen)
{
#if 1

	CRYPTO_Type *pcrypto;
	volatile uint32_t regValue;
	int ret = SUCCESS;
	uint32_t cache_len = (msglen & 0x1F) ? ((msglen / 32) + 1) * 32 : msglen;
	int8_t first_cache_pos = 0;
	int8_t first_cache_len = 0;
	int8_t is_cmdpreprocess = 0;
	uint32_t tmp_crcinit;
	uint32_t last_msglen;


	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if ((pcrypto_adapter->base_addr) == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	} else {
		pcrypto = pcrypto_adapter->base_addr;
	}

	// check if busy
	if (hal_rtl_crypto_crc_isbusy_rtl8710c(pcrypto_adapter)) {
		DBG_CRYPTO_ERR("[CRC_DMA] CRC engine is busy\r\n");
		return FAIL;
	}



	/***********************************************
	* Note:
	* DMA mode need to check whether is 32bytes alignment, because of cache clean.
	* - If not-32bytes alignment addr,but the space in cache line is enough for message,
	*   then copy message to a 32bytes aligment addr and jump to dma_process.
	* - If not-32bytes alignment addr,and the space in cache line isn't enough for message,
	*   then do cmd mode preporcess, after jump to dma_process.
	* - If 32bytes alignment addr, do dma_proces.
	*
	************************************************/
	first_cache_pos = (uint32_t)message & 0x1F;
	first_cache_len = (32 - first_cache_pos) % 32;

	if (first_cache_pos) {
		if (first_cache_len >= msglen) {
			DBG_CRYPTO_INFO("[CRC_DMA] msg_addr not 32 aligned & cache_len >= msglen\r\n");
			rtlc_memcpy((void *) & (pcrypto_adapter->crc_first_cache_line[0]), (const void *)message, msglen);
			message = (const u8 *) & (pcrypto_adapter->crc_first_cache_line[0]);
			goto dma_process;
		} else {
			//cmd mode preporcess
			is_cmdpreprocess = TRUE;
			hal_rtl_crypto_read_crc_setting(pcrypto_adapter);

			//reset_crc_setting for cmd(refout,crcxor)
			pcrypto->crc_oxor_reg = (uint32_t)0x0;
			hal_rtl_crypto_crc_set_swap_rtl8710c(pcrypto_adapter, pcrypto_adapter->crc_iswap, 0x0);
			regValue = pcrypto->crc_op_reg;
			DBG_CRYPTO_INFO("[0x104] : 0x%x \r\n", regValue);

			// check if busy
			if (hal_rtl_crypto_crc_isbusy_rtl8710c(pcrypto_adapter)) {
				DBG_CRYPTO_ERR("[CRC_DMA] After set CRC, CRC engine is busy\r\n");
				return FAIL;
			}

			ret = hal_rtl_crypto_crc_cmd(pcrypto_adapter, message, first_cache_len);
			if (ret == SUCCESS) {
				tmp_crcinit = hal_rtl_crypto_crc_get_result(pcrypto_adapter);
				message += first_cache_len;
				last_msglen = msglen;
				last_msglen -= first_cache_len;
				cache_len = (last_msglen & 0x1F) ? ((last_msglen / 32) + 1) * 32 : last_msglen;
				DBG_CRYPTO_INFO("[CRC_DMA] last_msglen =%d, cache_len = %d\r\n", last_msglen, cache_len);

				// check if busy
				if (hal_rtl_crypto_crc_isbusy_rtl8710c(pcrypto_adapter)) {
					DBG_CRYPTO_ERR("[CRC_DMA] After CRC_CMD_preprocess, CRC engine is busy\r\n");
					return FAIL;
				}
				//reset_crc_setting for dma(refout,crcxor,crcinit)
				DBG_CRYPTO_INFO("[CRC_DMA] last_crcinit = 0x%x \r\n", tmp_crcinit);
				//iv
				pcrypto->crc_iv_reg = tmp_crcinit;

				//oxor
				pcrypto->crc_oxor_reg = (pcrypto_adapter->crc_oxor);
				hal_rtl_crypto_crc_set_swap_rtl8710c(pcrypto_adapter, (pcrypto_adapter->crc_iswap), (pcrypto_adapter->crc_oswap));

				regValue = pcrypto->crc_op_reg;
				DBG_CRYPTO_INFO("[0x104] : 0x%x \r\n", regValue);

				goto dma_process;
			} else {
				DBG_CRYPTO_ERR("[CRC_DMA] CRC_CMD_preprocess fail!\r\n");
				return (ret);
			}
		}
	} else {

dma_process:

		//DMA mode use interrupt handler
//        if (!(pcrypto_adapter->isIntMode)) {
//            dbg_printf("[CRC_DMA] check interrupt handler fail!\r\n");
//            return (FAIL);
//        }

		//dbg_printf("DMA mode \r\n");
		hal_rtl_crypto_crc_set_dma_rtl8710c(pcrypto_adapter, 1);

		// set data length
		//dbg_printf("set data length\r\n");
		if (is_cmdpreprocess == TRUE) {
			DBG_CRYPTO_INFO("[CRC_DMA] last_msglen = %d\r\n", last_msglen);
			hal_rtl_crypto_crc_set_data_length_rtl8710c(pcrypto_adapter, last_msglen);
		} else {
			hal_rtl_crypto_crc_set_data_length_rtl8710c(pcrypto_adapter, msglen);
		}

		// Need 32 bytes alignment address
		arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)(message), cache_len);
		pcrypto->crc_data_reg = (uint32_t)(message);

		pcrypto->crc_stat_reg_b.crc_ok = 1;
		pcrypto->crc_stat_reg_b.crc_intr_mask = 0;
		pcrypto->crc_stat_reg_b.crc_little_endian = 1;
		pcrypto->crc_rst_reg = 0x1;

		regValue = pcrypto->crc_stat_reg;
	}
	return ret;

#else

	CRYPTO_Type *pcrypto;
	volatile uint32_t regValue;
	int ret = SUCCESS;
	uint32_t cache_len = (msglen & 0x1F) ? ((msglen / 32) + 1) * 32 : msglen;
	int8_t first_cache_pos = 0;
	int8_t first_cache_len = 0;
	int8_t is_cmdpreprocess = 0;
	uint32_t tmp_crcinit;
	uint32_t last_msglen;

	if (pcrypto_adapter == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	}
	if (pcrypto_adapter->isInit != _TRUE) {
		return _ERRNO_CRYPTO_ENGINE_NOT_INIT; // not init yet
	}
	if ((pcrypto_adapter->base_addr) == NULL) {
		return _ERRNO_CRYPTO_NULL_POINTER;
	} else {
		pcrypto = pcrypto_adapter->base_addr;
		dbg_printf("base addr %x\r\n", pcrypto);
	}

	// check if busy
	if (hal_rtl_crypto_crc_isbusy_rtl8710c(pcrypto_adapter)) {
		dbg_printf("[CRC_DMA] CRC engine is busy\r\n");
		return FAIL;
	}

	/***********************************************
	* Note:
	* DMA mode need to check whether is 32bytes alignment, because of cache clean.
	* - If not-32bytes alignment addr,but the space in cache line is enough for message,
	*   then copy message to a 32bytes aligment addr and jump to dma_process.
	* - If not-32bytes alignment addr,and the space in cache line isn't enough for message,
	*   then do cmd mode preporcess, after jump to dma_process.
	* - If 32bytes alignment addr, do dma_proces.
	*
	************************************************/
	first_cache_pos = (uint32_t)message & 0x1F;

//    dbg_printf("message buffer1 %x\r\n", message);
//    dbg_printf("message %x\r\n", *message);

	first_cache_len = (32 - first_cache_pos) % 32;
	dbg_printf("[CRC_DMA] f_cache_pos = %d, f_cache_len = %d, msglen = %d\r\n", first_cache_pos, first_cache_len, msglen);

	if (first_cache_pos) {
		if (first_cache_len >= msglen) {
			dbg_printf("[CRC_DMA] msg_addr not 32 aligned & cache_len >= msglen\r\n");
			rtlc_memcpy((void *) & (pcrypto_adapter->crc_first_cache_line[0]), (const void *)message, msglen);
			message = (const u8 *) & (pcrypto_adapter->crc_first_cache_line[0]);
//            dbg_printf("message buffer2 %x\r\n", message);
//            dbg_printf("message %x\r\n", *message);
//
//
//            dbg_printf("message buffer3 %x\r\n", (message+1) );
//            dbg_printf("message %x\r\n", *(message+1) );

