swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
			goto dma_process;
		} else {
			//cmd mode preporcess
			is_cmdpreprocess = TRUE;
			hal_rtl_crypto_read_crc_setting(pcrypto_adapter);

			//reset_crc_setting for cmd(refout,crcxor)
			pcrypto->crc_oxor_reg = (uint32_t)0x0;
			hal_crc_set_swap_rtl8710c(pcrypto_adapter, pcrypto_adapter->crc_iswap, 0x0);
			regValue = pcrypto->crc_op_reg;
			dbg_printf("[0x104] : 0x%x \r\n", regValue);

			// check if busy
			if (hal_rtl_crypto_crc_isbusy_rtl8710c(pcrypto_adapter)) {
				dbg_printf("[CRC_DMA] After set CRC, CRC engine is busy\r\n");
				return FAIL;
			}

			ret = hal_rtl_crypto_crc_cmd(pcrypto_adapter, message, first_cache_len);
			if (ret == SUCCESS) {
				tmp_crcinit = hal_rtl_crypto_crc_get_result(pcrypto_adapter);
				message += first_cache_len;
				last_msglen = msglen;
				last_msglen -= first_cache_len;
				cache_len = (last_msglen & 0x1F) ? ((last_msglen / 32) + 1) * 32 : last_msglen;
				dbg_printf("[CRC_DMA] last_msglen =%d, cache_len = %d\r\n", last_msglen, cache_len);

				// check if busy
				if (hal_rtl_crypto_crc_isbusy_rtl8710c(pcrypto_adapter)) {
					dbg_printf("[CRC_DMA] After CRC_CMD_preprocess, CRC engine is busy\r\n");
					return FAIL;
				}
				//reset_crc_setting for dma(refout,crcxor,crcinit)
				dbg_printf("[CRC_DMA] last_crcinit = 0x%x \r\n", tmp_crcinit);
				//iv
				pcrypto->crc_iv_reg = tmp_crcinit;

				//oxor
				pcrypto->crc_oxor_reg = (pcrypto_adapter->crc_oxor);
				hal_crc_set_swap_rtl8710c(pcrypto_adapter, (pcrypto_adapter->crc_iswap), (pcrypto_adapter->crc_oswap));

				regValue = pcrypto->crc_op_reg;
				dbg_printf("[0x104] : 0x%x \r\n", regValue);

				goto dma_process;
			} else {
				dbg_printf("[CRC_DMA] CRC_CMD_preprocess fail!\r\n");
				return (ret);
			}
		}
	} else {

dma_process:

#if 0
		//DMA mode use interrupt handler
		if (!(pcrypto_adapter->isIntMode)) {
			dbg_printf("[CRC_DMA] check interrupt handler fail!\r\n");
			return (FAIL);
		}
#endif

		//dbg_printf("DMA mode \r\n");
		hal_crc_set_dma_rtl8710c(pcrypto_adapter, 1);

		// set data length
		//dbg_printf("set data length\r\n");
		if (is_cmdpreprocess == TRUE) {
			dbg_printf("[CRC_DMA] last_msglen = %d\r\n", last_msglen);
			hal_crc_set_data_length_rtl8710c(pcrypto_adapter, last_msglen);
		} else {
			dbg_printf("F2\r\n");
			hal_crc_set_data_length_rtl8710c(pcrypto_adapter, msglen);
		}

		// Need 32 bytes alignment address
		arch_clean_dcache_by_size(pcrypto_adapter, (uint32_t)(message), cache_len);
		pcrypto->crc_data_reg = (uint32_t)(message);
#if 0
		dbg_printf("cache len %x\r\n", cache_len);
		dbg_printf("message after dcache1 %x\r\n", *message);
		dbg_printf("message after dcache2 %x\r\n", *(message + 1));
		dbg_printf("crc_data_reg %x\r\n", pcrypto->crc_data_reg);
#endif
		__dbg_mem_dump(pcrypto_adapter->isMemDump, pcrypto->crc_data_reg, cache_len, "crc_data_reg: ");

		pcrypto->crc_stat_reg_b.crc_ok = 1;
		pcrypto->crc_stat_reg_b.crc_intr_mask = 0;
		pcrypto->crc_stat_reg_b.crc_little_endian = 1; // 1

		pcrypto->crc_rst_reg = 0x1;

	}
	return ret;

#endif
}


/**
 *  \fn          int hal_crypto_crc32_dma_rtl8710c(hal_crypto_adapter_t *pcrypto_adapter, IN const u8* message, IN const uint32_t msglen)
 *  \brief       Use CRC DMA mode and crc32 type to calculate this crc message buffer.
 *  \details     It will call \ref hal_crypto_crc_setting_rtl8710c() to set crc32 type parameters,
 *               then call \ref hal_crypto_crc_dma_rtl8710c() to calculate this crc message data via DMA mode.
 *               crc32 type: \n
 *               - order: 32
 *               - polynomial: 0x4c11DB7
 *               - crcinit: 0xFFFFFFFF
 *               - crcxor: 0xFFFFFFFF
 *               - refin: true
 *               - refout: true
 *  \param[in]   pcrypto_adapter  Pointer to crypto adapter data
 *  \param[in]   message Pointer to CRC message buffer
 *  \param[in]   msglen The crc message buffer length
 *  \return      value ==  0     success
 *  \return      value == -1     fail
 */
SECTION_CRYPTO_TEXT
int hal_rtl_crypto_crc32_dma(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen)
{
	int ret;
	ret = hal_rtl_crypto_crc_setting(pcrypto_adapter, 32, 0x4c11DB7, 0xFFFFFFFF, 0xFFFFFFFF, 1, 1);
	if (ret != SUCCESS) {
		return ret;
	}

	ret = hal_rtl_crypto_crc_dma(pcrypto_adapter, message, msglen);
	return ret;
}
#endif

//#if defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE == 1)
#if !defined(CONFIG_BUILD_NONSECURE)

/**
 *   \brief  The data struct of CRYPTO secure stub functions. ROM code functions are accessed in RAM code through stub functions.
 */
SECTION_CRYPTO_STUBS
const hal_crypto_func_stubs_t hal_crypto_stubs_s = {
	.hal_crypto_engine_init   = hal_rtl_crypto_engine_init,
	.hal_crypto_engine_deinit = hal_rtl_crypto_engine_deinit,
#if !defined(CONFIG_BUILD_NONSECURE)
	.hal_crypto_engine_platform_en_ctrl = hal_rtl_crypto_en_ctrl,
#endif

	.hal_crypto_auth         = hal_rtl_crypto_auth,
	.hal_crypto_auth_init    = hal_rtl_crypto_auth_init,
	.hal_crypto_auth_process = hal_rtl_crypto_auth_process,
	.hal_crypto_auth_update  = hal_rtl_crypto_auth_update,
	.hal_crypto_auth_final   = hal_rtl_crypto_auth_final,

	.hal_crypto_cipher_init     = hal_rtl_crypto_cipher_init,
	.hal_crypto_cipher_encrypt  = hal_rtl_crypto_cipher_encrypt,
	.hal_crypto_cipher_decrypt  = hal_rtl_crypto_cipher_decrypt,

	.hal_crypto_mix_mode_init     = hal_rtl_crypto_mix_mode_init,
	.hal_crypto_mix_mode_process  = hal_rtl_crypto_mix_mode_process,

	.hal_crypto_crc_setting       = hal_rtl_crypto_crc_setting,
	.hal_crypto_crc_cmd           = hal_rtl_crypto_crc_cmd,
	.hal_crypto_crc_dma           = hal_rtl_crypto_crc_dma,
	.hal_crypto_crc_get_result    = hal_rtl_crypto_crc_get_result,
	.hal_crypto_crc32_cmd         = hal_rtl_crypto_crc32_cmd,
	.hal_crypto_crc32_dma         = hal_rtl_crypto_crc32_dma,

	.hal_crypto_engine            = hal_rtl_crypto_engine,
	.hal_crypto_engine_get_result = hal_rtl_crypto_engine_get_result,
	.hal_crypto_set_srcdesc       = hal_rtl_crypto_set_srcdesc,
	.hal_crypto_set_dstdesc       = hal_rtl_crypto_set_dstdesc,
	.hal_crypto_engine_setup_cl_buffer = hal_rtl_crypto_engine_setup_cl_buffer,
	.hal_crypto_key_storage_writekey = hal_rtl_crypto_key_storage_writekey,
	.hal_crypto_key_storage_writeback = hal_rtl_crypto_key_storage_writeback,
	.hal_crypto_key_storage_securekey = hal_rtl_crypto_key_storage_securekey,
	.hal_crypto_key_storage_lock = hal_rtl_crypto_key_storage_lock,

	.hal_crypto_poly1305          = hal_rtl_crypto_poly1305,
	.hal_crypto_poly1305_init     = hal_rtl_crypto_poly1305_init,
	.hal_crypto_poly1305_process  = hal_rtl_crypto_poly1305_process,
	.hal_crypto_chacha_init       = hal_rtl_crypto_chacha_init,
	.hal_crypto_chacha_encrypt    = hal_rtl_crypto_chacha_encrypt,
	.hal_crypto_chacha_decrypt    = hal_rtl_crypto_chacha_decrypt,
	.hal_crypto_chacha_poly1305_init = hal_rtl_crypto_chacha_poly1305_init,
	.hal_crypto_chacha_poly1305_encrypt = hal_rtl_crypto_chacha_poly1305_encrypt,
	.hal_crypto_chacha_poly1305_decrypt = hal_rtl_crypto_chacha_poly1305_decrypt,

	.hal_crypto_cache             = hal_rtl_crypto_cache,
#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)
	.hal_crypto_auth_sk_init      = hal_rtl_crypto_auth_sk_init,
	.hal_crypto_auth_sk_final     = hal_rtl_crypto_auth_sk_final,
	.hal_crypto_set_sk_cfg_info   = hal_rtl_crypto_set_sk_cfg_info,
	.hal_crypto_get_sk_cfg_info   = hal_rtl_crypto_get_sk_cfg_info
#endif
};


#else

/**
 *   \brief  The data struct of CRYPTO non-secure stub functions. ROM code functions are accessed in RAM code through stub functions.
 */
SECTION_CRYPTO_STUBS
const hal_crypto_func_stubs_t hal_crypto_stubs_ns = {
	.hal_crypto_engine_init   = hal_rtl_crypto_engine_init,
	.hal_crypto_engine_deinit = hal_rtl_crypto_engine_deinit,
#if !defined(CONFIG_BUILD_NONSECURE)
	.hal_crypto_engine_platform_en_ctrl = hal_rtl_crypto_en_ctrl,
#endif

	.hal_crypto_auth         = hal_rtl_crypto_auth,
	.hal_crypto_auth_init    = hal_rtl_crypto_auth_init,
	.hal_crypto_auth_process = hal_rtl_crypto_auth_process,
	.hal_crypto_auth_update  = hal_rtl_crypto_auth_update,
	.hal_crypto_auth_final   = hal_rtl_crypto_auth_final,

