swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom/rtl8735b_crypto.c
	.hal_crypto_cipher_init     = hal_rtl_crypto_cipher_init,
	.hal_crypto_cipher_encrypt  = hal_rtl_crypto_cipher_encrypt,
	.hal_crypto_cipher_decrypt  = hal_rtl_crypto_cipher_decrypt,

	.hal_crypto_mix_mode_init     = hal_rtl_crypto_mix_mode_init,
	.hal_crypto_mix_mode_process  = hal_rtl_crypto_mix_mode_process,
#if 0
	.hal_crypto_crc_setting       = hal_rtl_crypto_crc_setting,
	.hal_crypto_crc_cmd           = hal_rtl_crypto_crc_cmd,
	.hal_crypto_crc_dma           = hal_rtl_crypto_crc_dma,
	.hal_crypto_crc_get_result    = hal_rtl_crypto_crc_get_result,
	.hal_crypto_crc32_cmd         = hal_rtl_crypto_crc32_cmd,
	.hal_crypto_crc32_dma         = hal_rtl_crypto_crc32_dma,
#endif

	.hal_crypto_engine            = hal_rtl_crypto_engine,
	.hal_crypto_engine_get_result = hal_rtl_crypto_engine_get_result,
	.hal_crypto_set_srcdesc       = hal_rtl_crypto_set_srcdesc,
	.hal_crypto_set_dstdesc       = hal_rtl_crypto_set_dstdesc,
	.hal_crypto_engine_setup_cl_buffer = hal_rtl_crypto_engine_setup_cl_buffer,
	.hal_crypto_key_storage_writekey = hal_rtl_crypto_key_storage_writekey,
	.hal_crypto_key_storage_writeback = hal_rtl_crypto_key_storage_writeback,
	.hal_crypto_key_storage_securekey = hal_rtl_crypto_key_storage_securekey,
	.hal_crypto_key_storage_lock = hal_rtl_crypto_key_storage_lock,

	.hal_crypto_poly1305          = hal_rtl_crypto_poly1305,
	.hal_crypto_poly1305_init     = hal_rtl_crypto_poly1305_init,
	.hal_crypto_poly1305_process  = hal_rtl_crypto_poly1305_process,
	.hal_crypto_chacha_init       = hal_rtl_crypto_chacha_init,
	.hal_crypto_chacha_encrypt    = hal_rtl_crypto_chacha_encrypt,
	.hal_crypto_chacha_decrypt    = hal_rtl_crypto_chacha_decrypt,
	.hal_crypto_chacha_poly1305_init = hal_rtl_crypto_chacha_poly1305_init,
	.hal_crypto_chacha_poly1305_encrypt = hal_rtl_crypto_chacha_poly1305_encrypt,
	.hal_crypto_chacha_poly1305_decrypt = hal_rtl_crypto_chacha_poly1305_decrypt,

	.hal_crypto_cache             = hal_rtl_crypto_cache,
};

#endif

/** @} */ /* End of group hs_hal_crypto_rom_func */
/// @endcond
/** @} */ /* End of group hs_hal_crypto */

#endif  // end of "#if CONFIG_CRYPTO_EN"

